[
	{"iIndex": 1000, "sQuestion": "Sarah was given 641 White balls, and 445 Yellow balls. How many more Yellow balls are there than White balls?", "lEquations": ["X=445-641"], "lSolutions": [-196]},
	{"iIndex": 1001, "sQuestion": "Sarah was given 288 Yellow balls, 372 Azure balls, 247 Golden balls, 70 White balls, and 149 Red balls. How many more Red balls are there than Golden balls?", "lEquations": ["X=149-247"], "lSolutions": [-98]},
	{"iIndex": 1002, "sQuestion": "Sarah was given 544 Violet balls, 784 Gray balls, 331 Orange balls, 376 Green balls, and 822 Magenta balls. How many more Green balls are there than Gray balls?", "lEquations": ["X=376-784"], "lSolutions": [-408]},
	{"iIndex": 1003, "sQuestion": "Sarah was given 771 Azure balls, 84 Blue balls, and 947 Black balls. How many more Azure balls are there than Black balls?", "lEquations": ["X=771-947"], "lSolutions": [-176]},
	{"iIndex": 1004, "sQuestion": "Sarah was given 541 Black balls, and 847 Brown balls. How many more Black balls are there than Brown balls?", "lEquations": ["X=541-847"], "lSolutions": [-306]},
	{"iIndex": 1005, "sQuestion": "Sarah was given 78 Red balls, 474 Orange balls, and 112 Azure balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=78-474"], "lSolutions": [-396]},
	{"iIndex": 1006, "sQuestion": "Sarah was given 373 Azure balls, 143 Orange balls, 613 Red balls, and 243 Gray balls. How many more Gray balls are there than Red balls?", "lEquations": ["X=243-613"], "lSolutions": [-370]},
	{"iIndex": 1007, "sQuestion": "Sarah was given 989 Magenta balls, 547 Violet balls, and 103 Golden balls. How many more Violet balls are there than Magenta balls?", "lEquations": ["X=547-989"], "lSolutions": [-442]},
	{"iIndex": 1008, "sQuestion": "Sarah was given 503 Red balls, 910 Green balls, 965 White balls, 553 Blue balls, and 202 Orange balls. How many more Red balls are there than Blue balls?", "lEquations": ["X=503-553"], "lSolutions": [-50]},
	{"iIndex": 1009, "sQuestion": "Sarah was given 227 Brown balls, 884 Violet balls, 200 Pink balls, and 800 Azure balls. How many more Brown balls are there than Violet balls?", "lEquations": ["X=227-884"], "lSolutions": [-657]},
	{"iIndex": 1010, "sQuestion": "Sarah was given 404 Gray balls, 127 Orange balls, 518 Blue balls, 72 Brown balls, and 101 Green balls. How many more Blue balls are there than Orange balls?", "lEquations": ["X=518-127"], "lSolutions": [391]},
	{"iIndex": 1011, "sQuestion": "Sarah was given 420 Golden balls, 945 Azure balls, and 264 Green balls. How many more Green balls are there than Golden balls?", "lEquations": ["X=264-420"], "lSolutions": [-156]},
	{"iIndex": 1012, "sQuestion": "Sarah was given 416 Azure balls, 330 White balls, 783 Orange balls, 420 Blue balls, and 284 Yellow balls. How many more Blue balls are there than White balls?", "lEquations": ["X=420-330"], "lSolutions": [90]},
	{"iIndex": 1013, "sQuestion": "Sarah was given 721 Orange balls, 695 Azure balls, and 375 Yellow balls. How many more Yellow balls are there than Azure balls?", "lEquations": ["X=375-695"], "lSolutions": [-320]},
	{"iIndex": 1014, "sQuestion": "Sarah was given 763 White balls, 628 Yellow balls, 955 Magenta balls, 367 Black balls, and 184 Blue balls. How many more Blue balls are there than Magenta balls?", "lEquations": ["X=184-955"], "lSolutions": [-771]},
	{"iIndex": 1015, "sQuestion": "Sarah was given 839 Violet balls, 381 Red balls, 983 Azure balls, 897 Yellow balls, and 32 Pink balls. How many more Red balls are there than Pink balls?", "lEquations": ["X=381-32"], "lSolutions": [349]},
	{"iIndex": 1016, "sQuestion": "Sarah was given 457 Magenta balls, 701 Orange balls, 554 Brown balls, and 197 Golden balls. How many more Magenta balls are there than Brown balls?", "lEquations": ["X=457-554"], "lSolutions": [-97]},
	{"iIndex": 1017, "sQuestion": "Sarah was given 920 Azure balls, and 959 Blue balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=959-920"], "lSolutions": [39]},
	{"iIndex": 1018, "sQuestion": "Sarah was given 40 Brown balls, 799 Black balls, and 881 Golden balls. How many more Golden balls are there than Brown balls?", "lEquations": ["X=881-40"], "lSolutions": [841]},
	{"iIndex": 1019, "sQuestion": "Sarah was given 511 Blue balls, 686 White balls, and 340 Gray balls. How many more Blue balls are there than Gray balls?", "lEquations": ["X=511-340"], "lSolutions": [171]},
	{"iIndex": 1020, "sQuestion": "Sarah was given 137 Golden balls, 380 Green balls, 461 Orange balls, and 434 Black balls. How many more Orange balls are there than Golden balls?", "lEquations": ["X=461-137"], "lSolutions": [324]},
	{"iIndex": 1021, "sQuestion": "Sarah was given 580 Black balls, 593 Brown balls, 601 Blue balls, and 215 Red balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=601-215"], "lSolutions": [386]},
	{"iIndex": 1022, "sQuestion": "Sarah was given 667 Golden balls, 975 Green balls, 260 Black balls, and 912 Violet balls. How many more Green balls are there than Violet balls?", "lEquations": ["X=975-912"], "lSolutions": [63]},
	{"iIndex": 1023, "sQuestion": "Sarah was given 833 Azure balls, 556 Blue balls, 339 Red balls, and 250 Violet balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=556-339"], "lSolutions": [217]},
	{"iIndex": 1024, "sQuestion": "Sarah was given 78 Golden balls, and 708 Pink balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=78-708"], "lSolutions": [-630]},
	{"iIndex": 1025, "sQuestion": "Sarah was given 406 Red balls, and 999 Azure balls. How many more Red balls are there than Azure balls?", "lEquations": ["X=406-999"], "lSolutions": [-593]},
	{"iIndex": 1026, "sQuestion": "Sarah was given 240 Pink balls, 653 Green balls, 599 Blue balls, 231 Red balls, and 621 Brown balls. How many more Blue balls are there than Brown balls?", "lEquations": ["X=599-621"], "lSolutions": [-22]},
	{"iIndex": 1027, "sQuestion": "Sarah was given 136 Magenta balls, 652 Brown balls, 675 Gray balls, 526 Orange balls, and 885 Green balls. How many more Brown balls are there than Magenta balls?", "lEquations": ["X=652-136"], "lSolutions": [516]},
	{"iIndex": 1028, "sQuestion": "Sarah was given 599 Golden balls, 10 Violet balls, and 531 Red balls. How many more Violet balls are there than Red balls?", "lEquations": ["X=10-531"], "lSolutions": [-521]},
	{"iIndex": 1029, "sQuestion": "Sarah was given 895 Orange balls, 493 White balls, and 559 Yellow balls. How many more Yellow balls are there than Orange balls?", "lEquations": ["X=559-895"], "lSolutions": [-336]},
	{"iIndex": 1030, "sQuestion": "Sarah was given 650 Yellow balls, 189 Golden balls, and 724 Magenta balls. How many more Yellow balls are there than Magenta balls?", "lEquations": ["X=650-724"], "lSolutions": [-74]},
	{"iIndex": 1031, "sQuestion": "Sarah was given 505 Pink balls, 680 Magenta balls, and 756 Gray balls. How many more Pink balls are there than Gray balls?", "lEquations": ["X=505-756"], "lSolutions": [-251]},
	{"iIndex": 1032, "sQuestion": "Sarah was given 736 Magenta balls, 272 Blue balls, 875 Azure balls, and 730 Brown balls. How many more Blue balls are there than Magenta balls?", "lEquations": ["X=272-736"], "lSolutions": [-464]},
	{"iIndex": 1033, "sQuestion": "Sarah was given 294 Black balls, and 511 White balls. How many more Black balls are there than White balls?", "lEquations": ["X=294-511"], "lSolutions": [-217]},
	{"iIndex": 1034, "sQuestion": "Sarah was given 933 Magenta balls, 195 Yellow balls, 167 Blue balls, and 348 Green balls. How many more Blue balls are there than Magenta balls?", "lEquations": ["X=167-933"], "lSolutions": [-766]},
	{"iIndex": 1035, "sQuestion": "Sarah was given 178 Blue balls, and 404 Pink balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=404-178"], "lSolutions": [226]},
	{"iIndex": 1036, "sQuestion": "Sarah was given 388 Brown balls, and 978 Azure balls. How many more Azure balls are there than Brown balls?", "lEquations": ["X=978-388"], "lSolutions": [590]},
	{"iIndex": 1037, "sQuestion": "Sarah was given 870 Orange balls, 60 Black balls, 939 Magenta balls, and 415 Golden balls. How many more Golden balls are there than Magenta balls?", "lEquations": ["X=415-939"], "lSolutions": [-524]},
	{"iIndex": 1038, "sQuestion": "Sarah was given 629 Red balls, 92 Green balls, 872 Golden balls, 312 Blue balls, and 31 Magenta balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=312-629"], "lSolutions": [-317]},
	{"iIndex": 1039, "sQuestion": "Sarah was given 854 White balls, 488 Azure balls, 807 Blue balls, 263 Violet balls, and 849 Gray balls. How many more White balls are there than Gray balls?", "lEquations": ["X=854-849"], "lSolutions": [5]},
	{"iIndex": 1040, "sQuestion": "Sarah was given 976 Blue balls, 783 Golden balls, and 613 Red balls. How many more Red balls are there than Golden balls?", "lEquations": ["X=613-783"], "lSolutions": [-170]},
	{"iIndex": 1041, "sQuestion": "Sarah was given 37 Golden balls, 395 Green balls, and 297 Yellow balls. How many more Golden balls are there than Yellow balls?", "lEquations": ["X=37-297"], "lSolutions": [-260]},
	{"iIndex": 1042, "sQuestion": "Sarah was given 959 White balls, 679 Azure balls, 255 Black balls, 20 Pink balls, and 415 Red balls. How many more Red balls are there than Pink balls?", "lEquations": ["X=415-20"], "lSolutions": [395]},
	{"iIndex": 1043, "sQuestion": "Sarah was given 196 Magenta balls, 779 Black balls, and 850 Blue balls. How many more Black balls are there than Blue balls?", "lEquations": ["X=779-850"], "lSolutions": [-71]},
	{"iIndex": 1044, "sQuestion": "Sarah was given 803 Pink balls, 226 Yellow balls, 202 Black balls, and 97 Orange balls. How many more Yellow balls are there than Black balls?", "lEquations": ["X=226-202"], "lSolutions": [24]},
	{"iIndex": 1045, "sQuestion": "Sarah was given 423 Orange balls, 364 Yellow balls, 677 Azure balls, and 234 Green balls. How many more Orange balls are there than Green balls?", "lEquations": ["X=423-234"], "lSolutions": [189]},
	{"iIndex": 1046, "sQuestion": "Sarah was given 891 Golden balls, 522 Green balls, and 614 White balls. How many more Green balls are there than Golden balls?", "lEquations": ["X=522-891"], "lSolutions": [-369]},
	{"iIndex": 1047, "sQuestion": "Sarah was given 718 Gray balls, 202 Golden balls, 678 Green balls, and 1000 Yellow balls. How many more Green balls are there than Yellow balls?", "lEquations": ["X=678-1000"], "lSolutions": [-322]},
	{"iIndex": 1048, "sQuestion": "Sarah was given 755 Azure balls, and 460 Blue balls. How many more Azure balls are there than Blue balls?", "lEquations": ["X=755-460"], "lSolutions": [295]},
	{"iIndex": 1049, "sQuestion": "Sarah was given 523 Brown balls, 399 White balls, 73 Pink balls, 301 Green balls, and 568 Red balls. How many more Red balls are there than White balls?", "lEquations": ["X=568-399"], "lSolutions": [169]},
	{"iIndex": 1050, "sQuestion": "Sarah was given 686 Yellow balls, 578 Azure balls, 150 Brown balls, and 837 Golden balls. How many more Brown balls are there than Azure balls?", "lEquations": ["X=150-578"], "lSolutions": [-428]},
	{"iIndex": 1051, "sQuestion": "Sarah was given 378 Azure balls, 630 Orange balls, and 633 Gray balls. How many more Gray balls are there than Azure balls?", "lEquations": ["X=633-378"], "lSolutions": [255]},
	{"iIndex": 1052, "sQuestion": "Sarah was given 353 Brown balls, 661 Violet balls, 6 Pink balls, and 153 Orange balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=153-353"], "lSolutions": [-200]},
	{"iIndex": 1053, "sQuestion": "Sarah was given 710 Azure balls, and 948 Golden balls. How many more Golden balls are there than Azure balls?", "lEquations": ["X=948-710"], "lSolutions": [238]},
	{"iIndex": 1054, "sQuestion": "Sarah was given 737 Pink balls, 850 Golden balls, and 381 Azure balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=850-737"], "lSolutions": [113]},
	{"iIndex": 1055, "sQuestion": "Sarah was given 750 Red balls, 435 Violet balls, 805 Golden balls, 370 Blue balls, and 226 Black balls. How many more Violet balls are there than Blue balls?", "lEquations": ["X=435-370"], "lSolutions": [65]},
	{"iIndex": 1056, "sQuestion": "Sarah was given 551 Orange balls, 682 Gray balls, 164 Yellow balls, and 966 Red balls. How many more Gray balls are there than Yellow balls?", "lEquations": ["X=682-164"], "lSolutions": [518]},
	{"iIndex": 1057, "sQuestion": "Sarah was given 885 Golden balls, 840 Magenta balls, and 74 Pink balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=885-74"], "lSolutions": [811]},
	{"iIndex": 1058, "sQuestion": "Sarah was given 226 Brown balls, 966 Magenta balls, 77 Pink balls, 440 White balls, and 87 Yellow balls. How many more Pink balls are there than Magenta balls?", "lEquations": ["X=77-966"], "lSolutions": [-889]},
	{"iIndex": 1059, "sQuestion": "Sarah was given 587 Blue balls, 985 Yellow balls, 204 Orange balls, 831 Pink balls, and 291 Gray balls. How many more Yellow balls are there than Pink balls?", "lEquations": ["X=985-831"], "lSolutions": [154]},
	{"iIndex": 1060, "sQuestion": "Sarah was given 105 Golden balls, and 260 White balls. How many more White balls are there than Golden balls?", "lEquations": ["X=260-105"], "lSolutions": [155]},
	{"iIndex": 1061, "sQuestion": "Sarah was given 426 Blue balls, 798 Brown balls, 76 Orange balls, and 858 White balls. How many more Orange balls are there than White balls?", "lEquations": ["X=76-858"], "lSolutions": [-782]},
	{"iIndex": 1062, "sQuestion": "Sarah was given 283 Brown balls, 389 Violet balls, 614 Golden balls, 974 Blue balls, and 852 Azure balls. How many more Brown balls are there than Azure balls?", "lEquations": ["X=283-852"], "lSolutions": [-569]},
	{"iIndex": 1063, "sQuestion": "Sarah was given 842 Golden balls, 786 Azure balls, 907 Black balls, 362 Yellow balls, and 360 Pink balls. How many more Yellow balls are there than Azure balls?", "lEquations": ["X=362-786"], "lSolutions": [-424]},
	{"iIndex": 1064, "sQuestion": "Sarah was given 827 Pink balls, 212 Magenta balls, and 119 Red balls. How many more Red balls are there than Pink balls?", "lEquations": ["X=119-827"], "lSolutions": [-708]},
	{"iIndex": 1065, "sQuestion": "Sarah was given 900 Brown balls, 319 Yellow balls, and 92 Green balls. How many more Brown balls are there than Green balls?", "lEquations": ["X=900-92"], "lSolutions": [808]},
	{"iIndex": 1066, "sQuestion": "Sarah was given 993 Magenta balls, 729 Golden balls, and 245 Green balls. How many more Magenta balls are there than Green balls?", "lEquations": ["X=993-245"], "lSolutions": [748]},
	{"iIndex": 1067, "sQuestion": "Sarah was given 593 Violet balls, 569 Azure balls, 366 Yellow balls, and 159 Pink balls. How many more Pink balls are there than Azure balls?", "lEquations": ["X=159-569"], "lSolutions": [-410]},
	{"iIndex": 1068, "sQuestion": "Sarah was given 337 Blue balls, 132 Violet balls, 928 Pink balls, and 557 Orange balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=132-557"], "lSolutions": [-425]},
	{"iIndex": 1069, "sQuestion": "Sarah was given 971 White balls, 865 Orange balls, 376 Pink balls, and 872 Azure balls. How many more White balls are there than Azure balls?", "lEquations": ["X=971-872"], "lSolutions": [99]},
	{"iIndex": 1070, "sQuestion": "Sarah was given 339 Golden balls, 260 Violet balls, 499 Green balls, 82 Azure balls, and 21 Magenta balls. How many more Violet balls are there than Green balls?", "lEquations": ["X=260-499"], "lSolutions": [-239]},
	{"iIndex": 1071, "sQuestion": "Sarah was given 56 Golden balls, and 63 Yellow balls. How many more Yellow balls are there than Golden balls?", "lEquations": ["X=63-56"], "lSolutions": [7]},
	{"iIndex": 1072, "sQuestion": "Sarah was given 291 Azure balls, 349 Blue balls, and 5 Pink balls. How many more Azure balls are there than Blue balls?", "lEquations": ["X=291-349"], "lSolutions": [-58]},
	{"iIndex": 1073, "sQuestion": "Sarah was given 478 Green balls, 793 Brown balls, 271 Azure balls, 18 Magenta balls, and 478 Gray balls. How many more Magenta balls are there than Gray balls?", "lEquations": ["X=18-478"], "lSolutions": [-460]},
	{"iIndex": 1074, "sQuestion": "Sarah was given 652 Orange balls, 448 Magenta balls, 175 Gray balls, 973 Blue balls, and 179 Yellow balls. How many more Yellow balls are there than Blue balls?", "lEquations": ["X=179-973"], "lSolutions": [-794]},
	{"iIndex": 1075, "sQuestion": "Sarah was given 766 Gray balls, 114 Violet balls, 383 White balls, and 745 Blue balls. How many more Gray balls are there than Blue balls?", "lEquations": ["X=766-745"], "lSolutions": [21]},
	{"iIndex": 1076, "sQuestion": "Sarah was given 100 Yellow balls, and 94 Golden balls. How many more Golden balls are there than Yellow balls?", "lEquations": ["X=94-100"], "lSolutions": [-6]},
	{"iIndex": 1077, "sQuestion": "Sarah was given 250 Yellow balls, and 360 Red balls. How many more Yellow balls are there than Red balls?", "lEquations": ["X=250-360"], "lSolutions": [-110]},
	{"iIndex": 1078, "sQuestion": "Sarah was given 38 Violet balls, 15 Azure balls, and 267 Gray balls. How many more Gray balls are there than Azure balls?", "lEquations": ["X=267-15"], "lSolutions": [252]},
	{"iIndex": 1079, "sQuestion": "Sarah was given 100 Black balls, 859 Brown balls, 64 Golden balls, 936 Azure balls, and 353 Green balls. How many more Azure balls are there than Golden balls?", "lEquations": ["X=936-64"], "lSolutions": [872]},
	{"iIndex": 1080, "sQuestion": "Sarah was given 581 Blue balls, 770 Azure balls, 666 Orange balls, and 969 Red balls. How many more Orange balls are there than Blue balls?", "lEquations": ["X=666-581"], "lSolutions": [85]},
	{"iIndex": 1081, "sQuestion": "Sarah was given 338 Green balls, 394 Brown balls, 848 Orange balls, 792 Yellow balls, and 858 Blue balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=848-394"], "lSolutions": [454]},
	{"iIndex": 1082, "sQuestion": "Sarah was given 227 Yellow balls, 762 Green balls, 885 Violet balls, 164 Orange balls, and 341 Red balls. How many more Yellow balls are there than Green balls?", "lEquations": ["X=227-762"], "lSolutions": [-535]},
	{"iIndex": 1083, "sQuestion": "Sarah was given 392 Red balls, 776 Violet balls, and 144 White balls. How many more Red balls are there than Violet balls?", "lEquations": ["X=392-776"], "lSolutions": [-384]},
	{"iIndex": 1084, "sQuestion": "Sarah was given 389 Brown balls, 89 Black balls, 765 White balls, 916 Azure balls, and 619 Red balls. How many more Black balls are there than Brown balls?", "lEquations": ["X=89-389"], "lSolutions": [-300]},
	{"iIndex": 1085, "sQuestion": "Sarah was given 748 Green balls, 759 Red balls, 342 Gray balls, and 998 Pink balls. How many more Green balls are there than Pink balls?", "lEquations": ["X=748-998"], "lSolutions": [-250]},
	{"iIndex": 1086, "sQuestion": "Sarah was given 967 Violet balls, and 667 Magenta balls. How many more Violet balls are there than Magenta balls?", "lEquations": ["X=967-667"], "lSolutions": [300]},
	{"iIndex": 1087, "sQuestion": "Sarah was given 26 Black balls, 809 Blue balls, 701 White balls, 951 Gray balls, and 570 Magenta balls. How many more Black balls are there than White balls?", "lEquations": ["X=26-701"], "lSolutions": [-675]},
	{"iIndex": 1088, "sQuestion": "Sarah was given 564 Azure balls, and 177 Golden balls. How many more Golden balls are there than Azure balls?", "lEquations": ["X=177-564"], "lSolutions": [-387]},
	{"iIndex": 1089, "sQuestion": "Sarah was given 194 White balls, and 193 Gray balls. How many more White balls are there than Gray balls?", "lEquations": ["X=194-193"], "lSolutions": [1]},
	{"iIndex": 1090, "sQuestion": "Sarah was given 677 Golden balls, and 679 Orange balls. How many more Orange balls are there than Golden balls?", "lEquations": ["X=679-677"], "lSolutions": [2]},
	{"iIndex": 1091, "sQuestion": "Sarah was given 432 Blue balls, 585 White balls, and 240 Red balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=432-240"], "lSolutions": [192]},
	{"iIndex": 1092, "sQuestion": "Sarah was given 476 Brown balls, 575 White balls, 798 Pink balls, 712 Red balls, and 365 Green balls. How many more Green balls are there than Pink balls?", "lEquations": ["X=365-798"], "lSolutions": [-433]},
	{"iIndex": 1093, "sQuestion": "Sarah was given 478 Azure balls, 491 Blue balls, 507 Pink balls, 7 Orange balls, and 193 Yellow balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=507-491"], "lSolutions": [16]},
	{"iIndex": 1094, "sQuestion": "Sarah was given 478 Pink balls, and 47 Yellow balls. How many more Pink balls are there than Yellow balls?", "lEquations": ["X=478-47"], "lSolutions": [431]},
	{"iIndex": 1095, "sQuestion": "Sarah was given 132 Brown balls, 796 Orange balls, and 177 Azure balls. How many more Azure balls are there than Brown balls?", "lEquations": ["X=177-132"], "lSolutions": [45]},
	{"iIndex": 1096, "sQuestion": "Sarah was given 940 Pink balls, 720 Brown balls, 931 Orange balls, and 306 Golden balls. How many more Orange balls are there than Golden balls?", "lEquations": ["X=931-306"], "lSolutions": [625]},
	{"iIndex": 1097, "sQuestion": "Sarah was given 352 Violet balls, 876 Pink balls, and 316 Blue balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=876-316"], "lSolutions": [560]},
	{"iIndex": 1098, "sQuestion": "Sarah was given 614 Gray balls, 630 Azure balls, 86 Green balls, and 672 Blue balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=672-630"], "lSolutions": [42]},
	{"iIndex": 1099, "sQuestion": "Sarah was given 554 Violet balls, 896 Golden balls, 613 Gray balls, and 84 Red balls. How many more Red balls are there than Gray balls?", "lEquations": ["X=84-613"], "lSolutions": [-529]}
]
