[
	{"iIndex": 0, "sQuestion": "Sarah was given 783 Gray balls, 65 Pink balls, and 262 Magenta balls. How many more Gray balls are there than Pink balls?", "lEquations": ["X=783-65"], "lSolutions": [718]},
	{"iIndex": 1, "sQuestion": "Sarah was given 97 Brown balls, 500 Golden balls, 30 Azure balls, 915 Magenta balls, and 856 Blue balls. How many more Magenta balls are there than Blue balls?", "lEquations": ["X=915-856"], "lSolutions": [59]},
	{"iIndex": 2, "sQuestion": "Sarah was given 273 Orange balls, and 739 Brown balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=273-739"], "lSolutions": [-466]},
	{"iIndex": 3, "sQuestion": "Sarah was given 555 White balls, and 10 Golden balls. How many more Golden balls are there than White balls?", "lEquations": ["X=10-555"], "lSolutions": [-545]},
	{"iIndex": 4, "sQuestion": "Sarah was given 449 Orange balls, 962 White balls, 508 Violet balls, 567 Blue balls, and 239 Magenta balls. How many more Violet balls are there than White balls?", "lEquations": ["X=508-962"], "lSolutions": [-454]},
	{"iIndex": 5, "sQuestion": "Sarah was given 949 Magenta balls, 23 Brown balls, and 427 Green balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=427-949"], "lSolutions": [-522]},
	{"iIndex": 6, "sQuestion": "Sarah was given 304 Golden balls, 124 Orange balls, and 761 Pink balls. How many more Orange balls are there than Pink balls?", "lEquations": ["X=124-761"], "lSolutions": [-637]},
	{"iIndex": 7, "sQuestion": "Sarah was given 291 Violet balls, 602 Pink balls, 997 Golden balls, 904 Blue balls, and 512 Green balls. How many more Green balls are there than Blue balls?", "lEquations": ["X=512-904"], "lSolutions": [-392]},
	{"iIndex": 8, "sQuestion": "Sarah was given 762 Brown balls, and 817 Blue balls. How many more Blue balls are there than Brown balls?", "lEquations": ["X=817-762"], "lSolutions": [55]},
	{"iIndex": 9, "sQuestion": "Sarah was given 756 Violet balls, 384 Orange balls, 89 Magenta balls, and 450 Golden balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=756-384"], "lSolutions": [372]},
	{"iIndex": 10, "sQuestion": "Sarah was given 721 Yellow balls, 869 Brown balls, 630 Orange balls, 608 White balls, and 593 Green balls. How many more White balls are there than Brown balls?", "lEquations": ["X=608-869"], "lSolutions": [-261]},
	{"iIndex": 11, "sQuestion": "Sarah was given 790 Violet balls, 205 Blue balls, and 553 White balls. How many more White balls are there than Violet balls?", "lEquations": ["X=553-790"], "lSolutions": [-237]},
	{"iIndex": 12, "sQuestion": "Sarah was given 932 Violet balls, 276 Yellow balls, 676 Pink balls, 562 Gray balls, and 624 Brown balls. How many more Violet balls are there than Gray balls?", "lEquations": ["X=932-562"], "lSolutions": [370]},
	{"iIndex": 13, "sQuestion": "Sarah was given 437 Violet balls, 973 Magenta balls, and 58 Blue balls. How many more Magenta balls are there than Blue balls?", "lEquations": ["X=973-58"], "lSolutions": [915]},
	{"iIndex": 14, "sQuestion": "Sarah was given 833 Violet balls, 366 Azure balls, and 425 Brown balls. How many more Azure balls are there than Violet balls?", "lEquations": ["X=366-833"], "lSolutions": [-467]},
	{"iIndex": 15, "sQuestion": "Sarah was given 236 Brown balls, 651 Gray balls, 182 White balls, and 564 Magenta balls. How many more Gray balls are there than Brown balls?", "lEquations": ["X=651-236"], "lSolutions": [415]},
	{"iIndex": 16, "sQuestion": "Sarah was given 86 White balls, 889 Pink balls, 18 Golden balls, and 464 Black balls. How many more White balls are there than Golden balls?", "lEquations": ["X=86-18"], "lSolutions": [68]},
	{"iIndex": 17, "sQuestion": "Sarah was given 640 Green balls, 190 Black balls, and 353 Magenta balls. How many more Black balls are there than Green balls?", "lEquations": ["X=190-640"], "lSolutions": [-450]},
	{"iIndex": 18, "sQuestion": "Sarah was given 975 Red balls, 173 Green balls, and 673 Violet balls. How many more Green balls are there than Violet balls?", "lEquations": ["X=173-673"], "lSolutions": [-500]},
	{"iIndex": 19, "sQuestion": "Sarah was given 25 Brown balls, 320 Orange balls, 396 Yellow balls, and 352 Black balls. How many more Black balls are there than Orange balls?", "lEquations": ["X=352-320"], "lSolutions": [32]},
	{"iIndex": 20, "sQuestion": "Sarah was given 215 Black balls, 989 Green balls, 621 Orange balls, and 443 Violet balls. How many more Black balls are there than Green balls?", "lEquations": ["X=215-989"], "lSolutions": [-774]},
	{"iIndex": 21, "sQuestion": "Sarah was given 37 Azure balls, and 737 Red balls. How many more Azure balls are there than Red balls?", "lEquations": ["X=37-737"], "lSolutions": [-700]},
	{"iIndex": 22, "sQuestion": "Sarah was given 712 Violet balls, 529 Pink balls, 462 Blue balls, 229 Golden balls, and 537 Magenta balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=712-229"], "lSolutions": [483]},
	{"iIndex": 23, "sQuestion": "Sarah was given 306 Golden balls, 129 Azure balls, 992 White balls, and 218 Orange balls. How many more Golden balls are there than White balls?", "lEquations": ["X=306-992"], "lSolutions": [-686]},
	{"iIndex": 24, "sQuestion": "Sarah was given 318 Pink balls, and 940 Black balls. How many more Black balls are there than Pink balls?", "lEquations": ["X=940-318"], "lSolutions": [622]},
	{"iIndex": 25, "sQuestion": "Sarah was given 900 Gray balls, 871 Green balls, 39 Red balls, 605 White balls, and 840 Violet balls. How many more Green balls are there than Violet balls?", "lEquations": ["X=871-840"], "lSolutions": [31]},
	{"iIndex": 26, "sQuestion": "Sarah was given 522 Red balls, 39 Pink balls, 388 Magenta balls, 206 Orange balls, and 356 Gray balls. How many more Red balls are there than Pink balls?", "lEquations": ["X=522-39"], "lSolutions": [483]},
	{"iIndex": 27, "sQuestion": "Sarah was given 400 Gray balls, 304 Blue balls, 517 Brown balls, 512 Black balls, and 18 Golden balls. How many more Brown balls are there than Golden balls?", "lEquations": ["X=517-18"], "lSolutions": [499]},
	{"iIndex": 28, "sQuestion": "Sarah was given 336 Green balls, 831 White balls, 577 Red balls, 802 Blue balls, and 139 Pink balls. How many more Red balls are there than Blue balls?", "lEquations": ["X=577-802"], "lSolutions": [-225]},
	{"iIndex": 29, "sQuestion": "Sarah was given 858 Green balls, 389 Golden balls, and 955 Black balls. How many more Black balls are there than Golden balls?", "lEquations": ["X=955-389"], "lSolutions": [566]},
	{"iIndex": 30, "sQuestion": "Sarah was given 42 Magenta balls, 87 Violet balls, 137 Blue balls, 174 Black balls, and 171 Orange balls. How many more Orange balls are there than Violet balls?", "lEquations": ["X=171-87"], "lSolutions": [84]},
	{"iIndex": 31, "sQuestion": "Sarah was given 862 Magenta balls, 262 Yellow balls, 377 Gray balls, and 347 Violet balls. How many more Gray balls are there than Magenta balls?", "lEquations": ["X=377-862"], "lSolutions": [-485]},
	{"iIndex": 32, "sQuestion": "Sarah was given 978 Blue balls, 733 Pink balls, 909 Gray balls, and 501 Magenta balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=733-978"], "lSolutions": [-245]},
	{"iIndex": 33, "sQuestion": "Sarah was given 808 White balls, 151 Azure balls, 849 Black balls, and 129 Pink balls. How many more Black balls are there than White balls?", "lEquations": ["X=849-808"], "lSolutions": [41]},
	{"iIndex": 34, "sQuestion": "Sarah was given 374 Black balls, 913 Gray balls, 303 Violet balls, 578 Blue balls, and 548 Green balls. How many more Black balls are there than Blue balls?", "lEquations": ["X=374-578"], "lSolutions": [-204]},
	{"iIndex": 35, "sQuestion": "Sarah was given 303 Black balls, 13 Magenta balls, 629 White balls, and 687 Pink balls. How many more Black balls are there than Pink balls?", "lEquations": ["X=303-687"], "lSolutions": [-384]},
	{"iIndex": 36, "sQuestion": "Sarah was given 41 Pink balls, and 193 Magenta balls. How many more Pink balls are there than Magenta balls?", "lEquations": ["X=41-193"], "lSolutions": [-152]},
	{"iIndex": 37, "sQuestion": "Sarah was given 698 Black balls, 248 Brown balls, and 163 Red balls. How many more Red balls are there than Black balls?", "lEquations": ["X=163-698"], "lSolutions": [-535]},
	{"iIndex": 38, "sQuestion": "Sarah was given 564 Azure balls, 260 Magenta balls, 729 Violet balls, 489 Pink balls, and 323 Green balls. How many more Azure balls are there than Magenta balls?", "lEquations": ["X=564-260"], "lSolutions": [304]},
	{"iIndex": 39, "sQuestion": "Sarah was given 611 White balls, 328 Magenta balls, 461 Green balls, and 401 Orange balls. How many more Green balls are there than Orange balls?", "lEquations": ["X=461-401"], "lSolutions": [60]},
	{"iIndex": 40, "sQuestion": "Sarah was given 994 Black balls, and 616 Yellow balls. How many more Yellow balls are there than Black balls?", "lEquations": ["X=616-994"], "lSolutions": [-378]},
	{"iIndex": 41, "sQuestion": "Sarah was given 889 Blue balls, 705 Magenta balls, 481 Gray balls, and 678 Violet balls. How many more Gray balls are there than Magenta balls?", "lEquations": ["X=481-705"], "lSolutions": [-224]},
	{"iIndex": 42, "sQuestion": "Sarah was given 84 Green balls, 840 Blue balls, and 288 Yellow balls. How many more Green balls are there than Blue balls?", "lEquations": ["X=84-840"], "lSolutions": [-756]},
	{"iIndex": 43, "sQuestion": "Sarah was given 659 Golden balls, and 348 Gray balls. How many more Golden balls are there than Gray balls?", "lEquations": ["X=659-348"], "lSolutions": [311]},
	{"iIndex": 44, "sQuestion": "Sarah was given 868 White balls, 593 Yellow balls, 915 Red balls, and 944 Magenta balls. How many more Red balls are there than Yellow balls?", "lEquations": ["X=915-593"], "lSolutions": [322]},
	{"iIndex": 45, "sQuestion": "Sarah was given 611 Black balls, 95 Violet balls, 251 Gray balls, and 226 Magenta balls. How many more Black balls are there than Violet balls?", "lEquations": ["X=611-95"], "lSolutions": [516]},
	{"iIndex": 46, "sQuestion": "Sarah was given 77 Black balls, 23 Green balls, 651 Violet balls, 11 Pink balls, and 298 Orange balls. How many more Violet balls are there than Pink balls?", "lEquations": ["X=651-11"], "lSolutions": [640]},
	{"iIndex": 47, "sQuestion": "Sarah was given 815 Pink balls, 336 Red balls, 79 Black balls, 522 Violet balls, and 973 Magenta balls. How many more Red balls are there than Black balls?", "lEquations": ["X=336-79"], "lSolutions": [257]},
	{"iIndex": 48, "sQuestion": "Sarah was given 942 Black balls, 617 Orange balls, 301 Violet balls, and 130 Pink balls. How many more Orange balls are there than Black balls?", "lEquations": ["X=617-942"], "lSolutions": [-325]},
	{"iIndex": 49, "sQuestion": "Sarah was given 929 Pink balls, 567 Gray balls, 861 Magenta balls, and 967 Golden balls. How many more Gray balls are there than Magenta balls?", "lEquations": ["X=567-861"], "lSolutions": [-294]},
	{"iIndex": 50, "sQuestion": "Sarah was given 684 Violet balls, 254 Red balls, 259 White balls, 797 Orange balls, and 66 Pink balls. How many more Orange balls are there than Pink balls?", "lEquations": ["X=797-66"], "lSolutions": [731]},
	{"iIndex": 51, "sQuestion": "Sarah was given 406 Violet balls, 857 Brown balls, 347 Pink balls, and 176 White balls. How many more Pink balls are there than White balls?", "lEquations": ["X=347-176"], "lSolutions": [171]},
	{"iIndex": 52, "sQuestion": "Sarah was given 956 Magenta balls, and 427 Golden balls. How many more Magenta balls are there than Golden balls?", "lEquations": ["X=956-427"], "lSolutions": [529]},
	{"iIndex": 53, "sQuestion": "Sarah was given 849 Gray balls, 284 Red balls, and 408 Green balls. How many more Green balls are there than Red balls?", "lEquations": ["X=408-284"], "lSolutions": [124]},
	{"iIndex": 54, "sQuestion": "Sarah was given 498 Gray balls, 8 Black balls, and 182 Blue balls. How many more Blue balls are there than Black balls?", "lEquations": ["X=182-8"], "lSolutions": [174]},
	{"iIndex": 55, "sQuestion": "Sarah was given 704 Golden balls, 491 Orange balls, 980 Blue balls, 231 Yellow balls, and 730 Brown balls. How many more Yellow balls are there than Blue balls?", "lEquations": ["X=231-980"], "lSolutions": [-749]},
	{"iIndex": 56, "sQuestion": "Sarah was given 782 Golden balls, 524 Blue balls, 661 White balls, and 899 Black balls. How many more White balls are there than Blue balls?", "lEquations": ["X=661-524"], "lSolutions": [137]},
	{"iIndex": 57, "sQuestion": "Sarah was given 566 Green balls, 381 Orange balls, and 170 Pink balls. How many more Pink balls are there than Orange balls?", "lEquations": ["X=170-381"], "lSolutions": [-211]},
	{"iIndex": 58, "sQuestion": "Sarah was given 919 Pink balls, and 621 Black balls. How many more Black balls are there than Pink balls?", "lEquations": ["X=621-919"], "lSolutions": [-298]},
	{"iIndex": 59, "sQuestion": "Sarah was given 965 Green balls, 584 Azure balls, and 737 Blue balls. How many more Green balls are there than Azure balls?", "lEquations": ["X=965-584"], "lSolutions": [381]},
	{"iIndex": 60, "sQuestion": "Sarah was given 866 Orange balls, 169 Golden balls, 558 Yellow balls, 748 Azure balls, and 42 Violet balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=42-866"], "lSolutions": [-824]},
	{"iIndex": 61, "sQuestion": "Sarah was given 935 Golden balls, 86 Black balls, 983 Green balls, and 999 Orange balls. How many more Black balls are there than Golden balls?", "lEquations": ["X=86-935"], "lSolutions": [-849]},
	{"iIndex": 62, "sQuestion": "Sarah was given 932 Pink balls, 334 Blue balls, 449 Azure balls, 130 Magenta balls, and 638 Red balls. How many more Magenta balls are there than Blue balls?", "lEquations": ["X=130-334"], "lSolutions": [-204]},
	{"iIndex": 63, "sQuestion": "Sarah was given 547 Azure balls, and 419 Gray balls. How many more Azure balls are there than Gray balls?", "lEquations": ["X=547-419"], "lSolutions": [128]},
	{"iIndex": 64, "sQuestion": "Sarah was given 5 Blue balls, 983 Azure balls, 195 Orange balls, and 542 Violet balls. How many more Violet balls are there than Blue balls?", "lEquations": ["X=542-5"], "lSolutions": [537]},
	{"iIndex": 65, "sQuestion": "Sarah was given 249 Golden balls, and 856 Gray balls. How many more Gray balls are there than Golden balls?", "lEquations": ["X=856-249"], "lSolutions": [607]},
	{"iIndex": 66, "sQuestion": "Sarah was given 206 Green balls, 280 Red balls, and 319 Violet balls. How many more Violet balls are there than Red balls?", "lEquations": ["X=319-280"], "lSolutions": [39]},
	{"iIndex": 67, "sQuestion": "Sarah was given 503 Magenta balls, 431 Pink balls, 877 Red balls, 125 Violet balls, and 788 Yellow balls. How many more Pink balls are there than Yellow balls?", "lEquations": ["X=431-788"], "lSolutions": [-357]},
	{"iIndex": 68, "sQuestion": "Sarah was given 121 Blue balls, 583 Green balls, 766 Magenta balls, 14 Black balls, and 559 White balls. How many more Magenta balls are there than Green balls?", "lEquations": ["X=766-583"], "lSolutions": [183]},
	{"iIndex": 69, "sQuestion": "Sarah was given 587 Violet balls, and 825 Yellow balls. How many more Yellow balls are there than Violet balls?", "lEquations": ["X=825-587"], "lSolutions": [238]},
	{"iIndex": 70, "sQuestion": "Sarah was given 461 Brown balls, and 359 Orange balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=359-461"], "lSolutions": [-102]},
	{"iIndex": 71, "sQuestion": "Sarah was given 651 Azure balls, 613 Blue balls, 740 Violet balls, 903 White balls, and 757 Green balls. How many more Green balls are there than Blue balls?", "lEquations": ["X=757-613"], "lSolutions": [144]},
	{"iIndex": 72, "sQuestion": "Sarah was given 730 Gray balls, 313 Pink balls, 720 Violet balls, 175 Azure balls, and 461 Orange balls. How many more Orange balls are there than Pink balls?", "lEquations": ["X=461-313"], "lSolutions": [148]},
	{"iIndex": 73, "sQuestion": "Sarah was given 594 Violet balls, 437 White balls, 994 Golden balls, and 415 Azure balls. How many more Golden balls are there than Violet balls?", "lEquations": ["X=994-594"], "lSolutions": [400]},
	{"iIndex": 74, "sQuestion": "Sarah was given 417 Orange balls, 739 Blue balls, 645 Golden balls, 160 Green balls, and 649 White balls. How many more Green balls are there than Golden balls?", "lEquations": ["X=160-645"], "lSolutions": [-485]},
	{"iIndex": 75, "sQuestion": "Sarah was given 795 Magenta balls, 620 Black balls, and 11 Pink balls. How many more Black balls are there than Pink balls?", "lEquations": ["X=620-11"], "lSolutions": [609]},
	{"iIndex": 76, "sQuestion": "Sarah was given 474 Pink balls, 853 Golden balls, 266 Violet balls, 497 Green balls, and 174 Red balls. How many more Green balls are there than Red balls?", "lEquations": ["X=497-174"], "lSolutions": [323]},
	{"iIndex": 77, "sQuestion": "Sarah was given 101 Green balls, and 763 Violet balls. How many more Violet balls are there than Green balls?", "lEquations": ["X=763-101"], "lSolutions": [662]},
	{"iIndex": 78, "sQuestion": "Sarah was given 169 Black balls, 520 Golden balls, 728 Brown balls, and 969 White balls. How many more Golden balls are there than Black balls?", "lEquations": ["X=520-169"], "lSolutions": [351]},
	{"iIndex": 79, "sQuestion": "Sarah was given 541 Golden balls, 213 Orange balls, 243 Green balls, 908 Gray balls, and 342 Blue balls. How many more Green balls are there than Golden balls?", "lEquations": ["X=243-541"], "lSolutions": [-298]},
	{"iIndex": 80, "sQuestion": "Sarah was given 933 Orange balls, and 536 Pink balls. How many more Pink balls are there than Orange balls?", "lEquations": ["X=536-933"], "lSolutions": [-397]},
	{"iIndex": 81, "sQuestion": "Sarah was given 731 Green balls, 835 Golden balls, and 570 Orange balls. How many more Golden balls are there than Orange balls?", "lEquations": ["X=835-570"], "lSolutions": [265]},
	{"iIndex": 82, "sQuestion": "Sarah was given 496 Azure balls, 809 Violet balls, and 266 Red balls. How many more Red balls are there than Violet balls?", "lEquations": ["X=266-809"], "lSolutions": [-543]},
	{"iIndex": 83, "sQuestion": "Sarah was given 251 Green balls, 865 Gray balls, and 677 Orange balls. How many more Green balls are there than Orange balls?", "lEquations": ["X=251-677"], "lSolutions": [-426]},
	{"iIndex": 84, "sQuestion": "Sarah was given 195 Yellow balls, 75 Azure balls, 641 Magenta balls, 750 Blue balls, and 170 Green balls. How many more Green balls are there than Blue balls?", "lEquations": ["X=170-750"], "lSolutions": [-580]},
	{"iIndex": 85, "sQuestion": "Sarah was given 540 Gray balls, 167 Green balls, and 142 Brown balls. How many more Gray balls are there than Brown balls?", "lEquations": ["X=540-142"], "lSolutions": [398]},
	{"iIndex": 86, "sQuestion": "Sarah was given 119 Yellow balls, 736 Green balls, 212 Magenta balls, 736 Azure balls, and 698 Blue balls. How many more Magenta balls are there than Yellow balls?", "lEquations": ["X=212-119"], "lSolutions": [93]},
	{"iIndex": 87, "sQuestion": "Sarah was given 330 Blue balls, and 505 Azure balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=330-505"], "lSolutions": [-175]},
	{"iIndex": 88, "sQuestion": "Sarah was given 628 Yellow balls, 710 Golden balls, 177 Pink balls, 98 Green balls, and 228 Black balls. How many more Green balls are there than Golden balls?", "lEquations": ["X=98-710"], "lSolutions": [-612]},
	{"iIndex": 89, "sQuestion": "Sarah was given 242 Brown balls, 840 Azure balls, 291 Magenta balls, 474 Red balls, and 561 Blue balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=561-474"], "lSolutions": [87]},
	{"iIndex": 90, "sQuestion": "Sarah was given 339 Brown balls, 509 Orange balls, and 608 Green balls. How many more Brown balls are there than Orange balls?", "lEquations": ["X=339-509"], "lSolutions": [-170]},
	{"iIndex": 91, "sQuestion": "Sarah was given 941 Azure balls, 201 Pink balls, 410 Gray balls, and 164 Green balls. How many more Pink balls are there than Azure balls?", "lEquations": ["X=201-941"], "lSolutions": [-740]},
	{"iIndex": 92, "sQuestion": "Sarah was given 898 Azure balls, and 681 Red balls. How many more Azure balls are there than Red balls?", "lEquations": ["X=898-681"], "lSolutions": [217]},
	{"iIndex": 93, "sQuestion": "Sarah was given 861 Red balls, 311 Black balls, 928 Brown balls, and 15 Golden balls. How many more Red balls are there than Black balls?", "lEquations": ["X=861-311"], "lSolutions": [550]},
	{"iIndex": 94, "sQuestion": "Sarah was given 121 Green balls, and 443 Magenta balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=121-443"], "lSolutions": [-322]},
	{"iIndex": 95, "sQuestion": "Sarah was given 837 Orange balls, 866 Green balls, and 197 Golden balls. How many more Golden balls are there than Green balls?", "lEquations": ["X=197-866"], "lSolutions": [-669]},
	{"iIndex": 96, "sQuestion": "Sarah was given 603 Yellow balls, 958 Golden balls, 807 Green balls, 605 Blue balls, and 180 White balls. How many more Green balls are there than Blue balls?", "lEquations": ["X=807-605"], "lSolutions": [202]},
	{"iIndex": 97, "sQuestion": "Sarah was given 423 Yellow balls, and 552 Violet balls. How many more Yellow balls are there than Violet balls?", "lEquations": ["X=423-552"], "lSolutions": [-129]},
	{"iIndex": 98, "sQuestion": "Sarah was given 762 Orange balls, and 626 Green balls. How many more Orange balls are there than Green balls?", "lEquations": ["X=762-626"], "lSolutions": [136]},
	{"iIndex": 99, "sQuestion": "Sarah was given 941 Black balls, 209 Red balls, and 876 White balls. How many more Red balls are there than Black balls?", "lEquations": ["X=209-941"], "lSolutions": [-732]},
	{"iIndex": 100, "sQuestion": "Sarah was given 935 Golden balls, and 833 Black balls. How many more Black balls are there than Golden balls?", "lEquations": ["X=833-935"], "lSolutions": [-102]},
	{"iIndex": 101, "sQuestion": "Sarah was given 681 White balls, 132 Red balls, 917 Violet balls, and 405 Brown balls. How many more Brown balls are there than White balls?", "lEquations": ["X=405-681"], "lSolutions": [-276]},
	{"iIndex": 102, "sQuestion": "Sarah was given 88 Black balls, 310 Green balls, 36 Magenta balls, and 881 Yellow balls. How many more Yellow balls are there than Black balls?", "lEquations": ["X=881-88"], "lSolutions": [793]},
	{"iIndex": 103, "sQuestion": "Sarah was given 814 Yellow balls, 390 Orange balls, 827 Red balls, and 120 Green balls. How many more Red balls are there than Yellow balls?", "lEquations": ["X=827-814"], "lSolutions": [13]},
	{"iIndex": 104, "sQuestion": "Sarah was given 401 Pink balls, 980 Blue balls, 918 Violet balls, 599 Yellow balls, and 493 Magenta balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=401-980"], "lSolutions": [-579]},
	{"iIndex": 105, "sQuestion": "Sarah was given 919 Violet balls, 852 Orange balls, 299 Pink balls, 762 Gray balls, and 161 White balls. How many more Orange balls are there than Pink balls?", "lEquations": ["X=852-299"], "lSolutions": [553]},
	{"iIndex": 106, "sQuestion": "Sarah was given 589 Violet balls, 67 Yellow balls, 45 Black balls, 308 Azure balls, and 835 Red balls. How many more Red balls are there than Black balls?", "lEquations": ["X=835-45"], "lSolutions": [790]},
	{"iIndex": 107, "sQuestion": "Sarah was given 539 Green balls, 125 Yellow balls, 153 Orange balls, 325 Violet balls, and 937 White balls. How many more Orange balls are there than White balls?", "lEquations": ["X=153-937"], "lSolutions": [-784]},
	{"iIndex": 108, "sQuestion": "Sarah was given 492 Brown balls, and 466 Green balls. How many more Green balls are there than Brown balls?", "lEquations": ["X=466-492"], "lSolutions": [-26]},
	{"iIndex": 109, "sQuestion": "Sarah was given 537 Red balls, and 504 White balls. How many more White balls are there than Red balls?", "lEquations": ["X=504-537"], "lSolutions": [-33]},
	{"iIndex": 110, "sQuestion": "Sarah was given 315 Yellow balls, 476 Magenta balls, 613 Golden balls, and 349 Azure balls. How many more Magenta balls are there than Yellow balls?", "lEquations": ["X=476-315"], "lSolutions": [161]},
	{"iIndex": 111, "sQuestion": "Sarah was given 577 Green balls, 137 Golden balls, and 929 Blue balls. How many more Green balls are there than Golden balls?", "lEquations": ["X=577-137"], "lSolutions": [440]},
	{"iIndex": 112, "sQuestion": "Sarah was given 559 Magenta balls, and 698 Black balls. How many more Black balls are there than Magenta balls?", "lEquations": ["X=698-559"], "lSolutions": [139]},
	{"iIndex": 113, "sQuestion": "Sarah was given 585 Green balls, 540 Black balls, and 657 Golden balls. How many more Green balls are there than Golden balls?", "lEquations": ["X=585-657"], "lSolutions": [-72]},
	{"iIndex": 114, "sQuestion": "Sarah was given 23 Violet balls, 605 Pink balls, and 377 Azure balls. How many more Pink balls are there than Azure balls?", "lEquations": ["X=605-377"], "lSolutions": [228]},
	{"iIndex": 115, "sQuestion": "Sarah was given 921 Blue balls, 915 Gray balls, 241 Brown balls, and 436 Pink balls. How many more Pink balls are there than Brown balls?", "lEquations": ["X=436-241"], "lSolutions": [195]},
	{"iIndex": 116, "sQuestion": "Sarah was given 75 Magenta balls, 834 Brown balls, and 861 Orange balls. How many more Brown balls are there than Magenta balls?", "lEquations": ["X=834-75"], "lSolutions": [759]},
	{"iIndex": 117, "sQuestion": "Sarah was given 789 Orange balls, and 390 Violet balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=390-789"], "lSolutions": [-399]},
	{"iIndex": 118, "sQuestion": "Sarah was given 361 Gray balls, 872 Violet balls, 470 Magenta balls, 7 Azure balls, and 195 White balls. How many more Magenta balls are there than Gray balls?", "lEquations": ["X=470-361"], "lSolutions": [109]},
	{"iIndex": 119, "sQuestion": "Sarah was given 525 Pink balls, and 909 Green balls. How many more Green balls are there than Pink balls?", "lEquations": ["X=909-525"], "lSolutions": [384]},
	{"iIndex": 120, "sQuestion": "Sarah was given 652 Gray balls, 10 Red balls, 435 Violet balls, 754 Magenta balls, and 678 Green balls. How many more Green balls are there than Gray balls?", "lEquations": ["X=678-652"], "lSolutions": [26]},
	{"iIndex": 121, "sQuestion": "Sarah was given 686 Azure balls, 19 Green balls, 921 Golden balls, and 93 Magenta balls. How many more Azure balls are there than Magenta balls?", "lEquations": ["X=686-93"], "lSolutions": [593]},
	{"iIndex": 122, "sQuestion": "Sarah was given 652 Brown balls, 768 Green balls, 873 Magenta balls, and 493 Yellow balls. How many more Magenta balls are there than Yellow balls?", "lEquations": ["X=873-493"], "lSolutions": [380]},
	{"iIndex": 123, "sQuestion": "Sarah was given 426 Magenta balls, 152 Black balls, 19 Brown balls, 177 Yellow balls, and 834 Red balls. How many more Brown balls are there than Black balls?", "lEquations": ["X=19-152"], "lSolutions": [-133]},
	{"iIndex": 124, "sQuestion": "Sarah was given 431 Azure balls, 708 Green balls, 281 Violet balls, and 444 Orange balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=281-444"], "lSolutions": [-163]},
	{"iIndex": 125, "sQuestion": "Sarah was given 973 Orange balls, 995 Pink balls, and 412 Brown balls. How many more Brown balls are there than Pink balls?", "lEquations": ["X=412-995"], "lSolutions": [-583]},
	{"iIndex": 126, "sQuestion": "Sarah was given 212 Black balls, and 990 Red balls. How many more Black balls are there than Red balls?", "lEquations": ["X=212-990"], "lSolutions": [-778]},
	{"iIndex": 127, "sQuestion": "Sarah was given 409 Brown balls, 666 Magenta balls, and 741 Black balls. How many more Brown balls are there than Magenta balls?", "lEquations": ["X=409-666"], "lSolutions": [-257]},
	{"iIndex": 128, "sQuestion": "Sarah was given 548 Violet balls, and 433 Blue balls. How many more Blue balls are there than Violet balls?", "lEquations": ["X=433-548"], "lSolutions": [-115]},
	{"iIndex": 129, "sQuestion": "Sarah was given 696 Orange balls, and 430 Violet balls. How many more Orange balls are there than Violet balls?", "lEquations": ["X=696-430"], "lSolutions": [266]},
	{"iIndex": 130, "sQuestion": "Sarah was given 879 Red balls, 49 Brown balls, 806 Magenta balls, and 220 Orange balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=879-220"], "lSolutions": [659]},
	{"iIndex": 131, "sQuestion": "Sarah was given 302 Golden balls, and 699 Brown balls. How many more Brown balls are there than Golden balls?", "lEquations": ["X=699-302"], "lSolutions": [397]},
	{"iIndex": 132, "sQuestion": "Sarah was given 207 Black balls, 172 Red balls, 534 Azure balls, 264 Gray balls, and 427 Orange balls. How many more Orange balls are there than Azure balls?", "lEquations": ["X=427-534"], "lSolutions": [-107]},
	{"iIndex": 133, "sQuestion": "Sarah was given 346 Golden balls, 882 Magenta balls, 498 Violet balls, 106 Blue balls, and 9 Gray balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=498-346"], "lSolutions": [152]},
	{"iIndex": 134, "sQuestion": "Sarah was given 521 Green balls, 282 Magenta balls, 277 Pink balls, 724 Black balls, and 253 Blue balls. How many more Black balls are there than Magenta balls?", "lEquations": ["X=724-282"], "lSolutions": [442]},
	{"iIndex": 135, "sQuestion": "Sarah was given 575 Green balls, 646 Blue balls, and 613 Azure balls. How many more Green balls are there than Azure balls?", "lEquations": ["X=575-613"], "lSolutions": [-38]},
	{"iIndex": 136, "sQuestion": "Sarah was given 713 Azure balls, 314 Green balls, and 274 Brown balls. How many more Green balls are there than Azure balls?", "lEquations": ["X=314-713"], "lSolutions": [-399]},
	{"iIndex": 137, "sQuestion": "Sarah was given 621 Yellow balls, 778 Gray balls, 186 Brown balls, 757 Blue balls, and 902 Red balls. How many more Red balls are there than Blue balls?", "lEquations": ["X=902-757"], "lSolutions": [145]},
	{"iIndex": 138, "sQuestion": "Sarah was given 542 White balls, 707 Violet balls, and 139 Yellow balls. How many more Yellow balls are there than White balls?", "lEquations": ["X=139-542"], "lSolutions": [-403]},
	{"iIndex": 139, "sQuestion": "Sarah was given 131 Gray balls, 909 Brown balls, 144 Yellow balls, and 716 Black balls. How many more Yellow balls are there than Brown balls?", "lEquations": ["X=144-909"], "lSolutions": [-765]},
	{"iIndex": 140, "sQuestion": "Sarah was given 849 Golden balls, and 720 Violet balls. How many more Golden balls are there than Violet balls?", "lEquations": ["X=849-720"], "lSolutions": [129]},
	{"iIndex": 141, "sQuestion": "Sarah was given 842 Yellow balls, 631 White balls, 226 Magenta balls, 87 Pink balls, and 761 Green balls. How many more White balls are there than Magenta balls?", "lEquations": ["X=631-226"], "lSolutions": [405]},
	{"iIndex": 142, "sQuestion": "Sarah was given 389 Green balls, 24 Gray balls, 125 Orange balls, and 338 Violet balls. How many more Orange balls are there than Gray balls?", "lEquations": ["X=125-24"], "lSolutions": [101]},
	{"iIndex": 143, "sQuestion": "Sarah was given 147 Green balls, and 698 Magenta balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=147-698"], "lSolutions": [-551]},
	{"iIndex": 144, "sQuestion": "Sarah was given 106 Black balls, and 308 Orange balls. How many more Orange balls are there than Black balls?", "lEquations": ["X=308-106"], "lSolutions": [202]},
	{"iIndex": 145, "sQuestion": "Sarah was given 143 Violet balls, 948 White balls, 409 Yellow balls, and 381 Black balls. How many more White balls are there than Violet balls?", "lEquations": ["X=948-143"], "lSolutions": [805]},
	{"iIndex": 146, "sQuestion": "Sarah was given 982 Green balls, 972 White balls, 115 Violet balls, and 361 Yellow balls. How many more White balls are there than Violet balls?", "lEquations": ["X=972-115"], "lSolutions": [857]},
	{"iIndex": 147, "sQuestion": "Sarah was given 487 Black balls, 578 Golden balls, 429 Gray balls, 549 Orange balls, and 957 Violet balls. How many more Orange balls are there than Gray balls?", "lEquations": ["X=549-429"], "lSolutions": [120]},
	{"iIndex": 148, "sQuestion": "Sarah was given 137 Golden balls, 56 Green balls, and 615 Violet balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=615-137"], "lSolutions": [478]},
	{"iIndex": 149, "sQuestion": "Sarah was given 560 Blue balls, 21 Azure balls, and 257 Green balls. How many more Green balls are there than Azure balls?", "lEquations": ["X=257-21"], "lSolutions": [236]},
	{"iIndex": 150, "sQuestion": "Sarah was given 107 Brown balls, 763 Red balls, 383 Azure balls, and 71 Orange balls. How many more Azure balls are there than Brown balls?", "lEquations": ["X=383-107"], "lSolutions": [276]},
	{"iIndex": 151, "sQuestion": "Sarah was given 936 Brown balls, 594 Golden balls, 146 Red balls, and 693 Black balls. How many more Golden balls are there than Black balls?", "lEquations": ["X=594-693"], "lSolutions": [-99]},
	{"iIndex": 152, "sQuestion": "Sarah was given 815 Yellow balls, 391 Green balls, 854 Red balls, and 451 Pink balls. How many more Pink balls are there than Yellow balls?", "lEquations": ["X=451-815"], "lSolutions": [-364]},
	{"iIndex": 153, "sQuestion": "Sarah was given 655 Green balls, 619 Golden balls, and 976 Magenta balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=655-976"], "lSolutions": [-321]},
	{"iIndex": 154, "sQuestion": "Sarah was given 136 Pink balls, and 389 Golden balls. How many more Pink balls are there than Golden balls?", "lEquations": ["X=136-389"], "lSolutions": [-253]},
	{"iIndex": 155, "sQuestion": "Sarah was given 613 Magenta balls, and 696 Azure balls. How many more Azure balls are there than Magenta balls?", "lEquations": ["X=696-613"], "lSolutions": [83]},
	{"iIndex": 156, "sQuestion": "Sarah was given 39 Brown balls, and 662 Magenta balls. How many more Brown balls are there than Magenta balls?", "lEquations": ["X=39-662"], "lSolutions": [-623]},
	{"iIndex": 157, "sQuestion": "Sarah was given 822 Magenta balls, 486 Gray balls, 840 Golden balls, and 715 Yellow balls. How many more Gray balls are there than Magenta balls?", "lEquations": ["X=486-822"], "lSolutions": [-336]},
	{"iIndex": 158, "sQuestion": "Sarah was given 42 Pink balls, 939 Red balls, 721 Black balls, and 322 Magenta balls. How many more Magenta balls are there than Black balls?", "lEquations": ["X=322-721"], "lSolutions": [-399]},
	{"iIndex": 159, "sQuestion": "Sarah was given 446 Golden balls, 425 Magenta balls, 386 White balls, and 368 Gray balls. How many more White balls are there than Gray balls?", "lEquations": ["X=386-368"], "lSolutions": [18]},
	{"iIndex": 160, "sQuestion": "Sarah was given 148 Golden balls, 58 Gray balls, and 350 Violet balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=350-148"], "lSolutions": [202]},
	{"iIndex": 161, "sQuestion": "Sarah was given 916 Violet balls, 350 Golden balls, and 776 Brown balls. How many more Brown balls are there than Violet balls?", "lEquations": ["X=776-916"], "lSolutions": [-140]},
	{"iIndex": 162, "sQuestion": "Sarah was given 393 Brown balls, and 647 Blue balls. How many more Brown balls are there than Blue balls?", "lEquations": ["X=393-647"], "lSolutions": [-254]},
	{"iIndex": 163, "sQuestion": "Sarah was given 999 Black balls, 994 Blue balls, and 337 Yellow balls. How many more Yellow balls are there than Black balls?", "lEquations": ["X=337-999"], "lSolutions": [-662]},
	{"iIndex": 164, "sQuestion": "Sarah was given 680 Orange balls, 741 Brown balls, 960 Yellow balls, 199 Golden balls, and 443 Magenta balls. How many more Golden balls are there than Magenta balls?", "lEquations": ["X=199-443"], "lSolutions": [-244]},
	{"iIndex": 165, "sQuestion": "Sarah was given 950 Gray balls, and 273 Brown balls. How many more Gray balls are there than Brown balls?", "lEquations": ["X=950-273"], "lSolutions": [677]},
	{"iIndex": 166, "sQuestion": "Sarah was given 470 Black balls, 785 Magenta balls, 387 White balls, 684 Golden balls, and 515 Red balls. How many more White balls are there than Magenta balls?", "lEquations": ["X=387-785"], "lSolutions": [-398]},
	{"iIndex": 167, "sQuestion": "Sarah was given 970 Violet balls, 261 Pink balls, and 20 Black balls. How many more Pink balls are there than Black balls?", "lEquations": ["X=261-20"], "lSolutions": [241]},
	{"iIndex": 168, "sQuestion": "Sarah was given 6 Violet balls, 558 Orange balls, and 824 Azure balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=6-558"], "lSolutions": [-552]},
	{"iIndex": 169, "sQuestion": "Sarah was given 679 Golden balls, 245 Red balls, and 78 Yellow balls. How many more Yellow balls are there than Golden balls?", "lEquations": ["X=78-679"], "lSolutions": [-601]},
	{"iIndex": 170, "sQuestion": "Sarah was given 526 Azure balls, 223 Gray balls, and 438 White balls. How many more Azure balls are there than White balls?", "lEquations": ["X=526-438"], "lSolutions": [88]},
	{"iIndex": 171, "sQuestion": "Sarah was given 670 Orange balls, 550 Violet balls, and 80 Gray balls. How many more Orange balls are there than Violet balls?", "lEquations": ["X=670-550"], "lSolutions": [120]},
	{"iIndex": 172, "sQuestion": "Sarah was given 92 Black balls, 574 Gray balls, 97 Golden balls, 657 White balls, and 835 Azure balls. How many more White balls are there than Black balls?", "lEquations": ["X=657-92"], "lSolutions": [565]},
	{"iIndex": 173, "sQuestion": "Sarah was given 320 Magenta balls, 478 White balls, and 285 Pink balls. How many more Pink balls are there than White balls?", "lEquations": ["X=285-478"], "lSolutions": [-193]},
	{"iIndex": 174, "sQuestion": "Sarah was given 725 Gray balls, 847 Red balls, and 326 Violet balls. How many more Violet balls are there than Red balls?", "lEquations": ["X=326-847"], "lSolutions": [-521]},
	{"iIndex": 175, "sQuestion": "Sarah was given 206 Violet balls, 508 Red balls, 837 Orange balls, 286 Azure balls, and 369 Magenta balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=508-837"], "lSolutions": [-329]},
	{"iIndex": 176, "sQuestion": "Sarah was given 637 Pink balls, 86 Red balls, 749 Magenta balls, and 370 Orange balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=749-86"], "lSolutions": [663]},
	{"iIndex": 177, "sQuestion": "Sarah was given 479 Green balls, 14 Yellow balls, 153 Azure balls, and 977 Gray balls. How many more Yellow balls are there than Azure balls?", "lEquations": ["X=14-153"], "lSolutions": [-139]},
	{"iIndex": 178, "sQuestion": "Sarah was given 594 Blue balls, 551 Black balls, and 634 Magenta balls. How many more Blue balls are there than Magenta balls?", "lEquations": ["X=594-634"], "lSolutions": [-40]},
	{"iIndex": 179, "sQuestion": "Sarah was given 568 Orange balls, 472 Pink balls, 401 Blue balls, 729 Gray balls, and 201 Red balls. How many more Orange balls are there than Pink balls?", "lEquations": ["X=568-472"], "lSolutions": [96]},
	{"iIndex": 180, "sQuestion": "Sarah was given 416 White balls, and 392 Orange balls. How many more Orange balls are there than White balls?", "lEquations": ["X=392-416"], "lSolutions": [-24]},
	{"iIndex": 181, "sQuestion": "Sarah was given 950 Golden balls, 248 Violet balls, and 871 Black balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=248-950"], "lSolutions": [-702]},
	{"iIndex": 182, "sQuestion": "Sarah was given 366 Blue balls, 768 Golden balls, 859 Orange balls, and 183 Azure balls. How many more Golden balls are there than Orange balls?", "lEquations": ["X=768-859"], "lSolutions": [-91]},
	{"iIndex": 183, "sQuestion": "Sarah was given 299 Yellow balls, 91 Brown balls, and 527 Violet balls. How many more Brown balls are there than Yellow balls?", "lEquations": ["X=91-299"], "lSolutions": [-208]},
	{"iIndex": 184, "sQuestion": "Sarah was given 630 White balls, 382 Green balls, 773 Magenta balls, 455 Gray balls, and 262 Black balls. How many more Black balls are there than White balls?", "lEquations": ["X=262-630"], "lSolutions": [-368]},
	{"iIndex": 185, "sQuestion": "Sarah was given 324 Pink balls, and 164 Magenta balls. How many more Pink balls are there than Magenta balls?", "lEquations": ["X=324-164"], "lSolutions": [160]},
	{"iIndex": 186, "sQuestion": "Sarah was given 520 Orange balls, 407 Blue balls, and 125 Violet balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=125-520"], "lSolutions": [-395]},
	{"iIndex": 187, "sQuestion": "Sarah was given 593 Golden balls, 261 Violet balls, 743 Red balls, 4 Pink balls, and 735 Orange balls. How many more Golden balls are there than Violet balls?", "lEquations": ["X=593-261"], "lSolutions": [332]},
	{"iIndex": 188, "sQuestion": "Sarah was given 275 Golden balls, 39 Brown balls, 654 Violet balls, 172 Gray balls, and 688 Blue balls. How many more Blue balls are there than Brown balls?", "lEquations": ["X=688-39"], "lSolutions": [649]},
	{"iIndex": 189, "sQuestion": "Sarah was given 101 Green balls, 686 Magenta balls, 851 Golden balls, 854 Azure balls, and 133 Brown balls. How many more Magenta balls are there than Brown balls?", "lEquations": ["X=686-133"], "lSolutions": [553]},
	{"iIndex": 190, "sQuestion": "Sarah was given 46 Brown balls, and 501 Magenta balls. How many more Brown balls are there than Magenta balls?", "lEquations": ["X=46-501"], "lSolutions": [-455]},
	{"iIndex": 191, "sQuestion": "Sarah was given 44 Blue balls, 867 Black balls, 433 Golden balls, and 854 Orange balls. How many more Orange balls are there than Black balls?", "lEquations": ["X=854-867"], "lSolutions": [-13]},
	{"iIndex": 192, "sQuestion": "Sarah was given 868 Gray balls, 522 Violet balls, and 395 Blue balls. How many more Blue balls are there than Violet balls?", "lEquations": ["X=395-522"], "lSolutions": [-127]},
	{"iIndex": 193, "sQuestion": "Sarah was given 899 Blue balls, 601 Yellow balls, and 776 Golden balls. How many more Blue balls are there than Yellow balls?", "lEquations": ["X=899-601"], "lSolutions": [298]},
	{"iIndex": 194, "sQuestion": "Sarah was given 855 Brown balls, and 626 White balls. How many more Brown balls are there than White balls?", "lEquations": ["X=855-626"], "lSolutions": [229]},
	{"iIndex": 195, "sQuestion": "Sarah was given 856 White balls, 580 Gray balls, 406 Violet balls, 95 Black balls, and 410 Pink balls. How many more Pink balls are there than Violet balls?", "lEquations": ["X=410-406"], "lSolutions": [4]},
	{"iIndex": 196, "sQuestion": "Sarah was given 971 Green balls, 932 Yellow balls, 893 Brown balls, 489 White balls, and 18 Violet balls. How many more White balls are there than Brown balls?", "lEquations": ["X=489-893"], "lSolutions": [-404]},
	{"iIndex": 197, "sQuestion": "Sarah was given 872 Magenta balls, 285 Red balls, 68 Gray balls, and 886 Violet balls. How many more Gray balls are there than Violet balls?", "lEquations": ["X=68-886"], "lSolutions": [-818]},
	{"iIndex": 198, "sQuestion": "Sarah was given 38 Violet balls, 588 Magenta balls, 543 White balls, 15 Gray balls, and 104 Black balls. How many more White balls are there than Black balls?", "lEquations": ["X=543-104"], "lSolutions": [439]},
	{"iIndex": 199, "sQuestion": "Sarah was given 597 Golden balls, and 76 Yellow balls. How many more Yellow balls are there than Golden balls?", "lEquations": ["X=76-597"], "lSolutions": [-521]},
	{"iIndex": 200, "sQuestion": "Sarah was given 932 Yellow balls, 333 Violet balls, 370 Magenta balls, 220 White balls, and 150 Red balls. How many more Red balls are there than Violet balls?", "lEquations": ["X=150-333"], "lSolutions": [-183]},
	{"iIndex": 201, "sQuestion": "Sarah was given 888 Azure balls, and 521 Yellow balls. How many more Yellow balls are there than Azure balls?", "lEquations": ["X=521-888"], "lSolutions": [-367]},
	{"iIndex": 202, "sQuestion": "Sarah was given 253 Magenta balls, and 840 Golden balls. How many more Golden balls are there than Magenta balls?", "lEquations": ["X=840-253"], "lSolutions": [587]},
	{"iIndex": 203, "sQuestion": "Sarah was given 927 Orange balls, and 959 Red balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=959-927"], "lSolutions": [32]},
	{"iIndex": 204, "sQuestion": "Sarah was given 657 Green balls, 270 Violet balls, and 241 Orange balls. How many more Green balls are there than Violet balls?", "lEquations": ["X=657-270"], "lSolutions": [387]},
	{"iIndex": 205, "sQuestion": "Sarah was given 895 White balls, 831 Orange balls, 1000 Violet balls, 209 Green balls, and 842 Magenta balls. How many more Magenta balls are there than White balls?", "lEquations": ["X=842-895"], "lSolutions": [-53]},
	{"iIndex": 206, "sQuestion": "Sarah was given 137 Yellow balls, 37 Green balls, 453 Pink balls, and 834 Violet balls. How many more Pink balls are there than Yellow balls?", "lEquations": ["X=453-137"], "lSolutions": [316]},
	{"iIndex": 207, "sQuestion": "Sarah was given 768 Yellow balls, and 168 Azure balls. How many more Yellow balls are there than Azure balls?", "lEquations": ["X=768-168"], "lSolutions": [600]},
	{"iIndex": 208, "sQuestion": "Sarah was given 134 Blue balls, 998 Black balls, and 601 Gray balls. How many more Gray balls are there than Blue balls?", "lEquations": ["X=601-134"], "lSolutions": [467]},
	{"iIndex": 209, "sQuestion": "Sarah was given 370 Brown balls, 986 Blue balls, 468 Magenta balls, and 343 White balls. How many more Magenta balls are there than Blue balls?", "lEquations": ["X=468-986"], "lSolutions": [-518]},
	{"iIndex": 210, "sQuestion": "Sarah was given 34 White balls, and 169 Brown balls. How many more Brown balls are there than White balls?", "lEquations": ["X=169-34"], "lSolutions": [135]},
	{"iIndex": 211, "sQuestion": "Sarah was given 909 Blue balls, and 87 Magenta balls. How many more Blue balls are there than Magenta balls?", "lEquations": ["X=909-87"], "lSolutions": [822]},
	{"iIndex": 212, "sQuestion": "Sarah was given 333 Blue balls, 402 Brown balls, 968 Violet balls, and 670 Yellow balls. How many more Blue balls are there than Brown balls?", "lEquations": ["X=333-402"], "lSolutions": [-69]},
	{"iIndex": 213, "sQuestion": "Sarah was given 305 Blue balls, 979 Golden balls, and 956 Gray balls. How many more Gray balls are there than Golden balls?", "lEquations": ["X=956-979"], "lSolutions": [-23]},
	{"iIndex": 214, "sQuestion": "Sarah was given 641 Yellow balls, 592 White balls, 681 Brown balls, 635 Black balls, and 976 Golden balls. How many more Black balls are there than Golden balls?", "lEquations": ["X=635-976"], "lSolutions": [-341]},
	{"iIndex": 215, "sQuestion": "Sarah was given 200 Yellow balls, 719 Black balls, 527 Golden balls, and 824 Azure balls. How many more Azure balls are there than Black balls?", "lEquations": ["X=824-719"], "lSolutions": [105]},
	{"iIndex": 216, "sQuestion": "Sarah was given 577 Golden balls, 784 Pink balls, 826 Violet balls, and 406 Green balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=826-577"], "lSolutions": [249]},
	{"iIndex": 217, "sQuestion": "Sarah was given 469 Magenta balls, and 914 Brown balls. How many more Brown balls are there than Magenta balls?", "lEquations": ["X=914-469"], "lSolutions": [445]},
	{"iIndex": 218, "sQuestion": "Sarah was given 149 Blue balls, 394 Orange balls, 884 Brown balls, 448 Yellow balls, and 56 Golden balls. How many more Blue balls are there than Brown balls?", "lEquations": ["X=149-884"], "lSolutions": [-735]},
	{"iIndex": 219, "sQuestion": "Sarah was given 555 Green balls, and 760 Magenta balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=555-760"], "lSolutions": [-205]},
	{"iIndex": 220, "sQuestion": "Sarah was given 844 White balls, 892 Yellow balls, 51 Green balls, 214 Gray balls, and 734 Magenta balls. How many more White balls are there than Green balls?", "lEquations": ["X=844-51"], "lSolutions": [793]},
	{"iIndex": 221, "sQuestion": "Sarah was given 661 Golden balls, and 68 Pink balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=661-68"], "lSolutions": [593]},
	{"iIndex": 222, "sQuestion": "Sarah was given 718 Gray balls, 707 Yellow balls, 188 Blue balls, 774 White balls, and 785 Golden balls. How many more Golden balls are there than Blue balls?", "lEquations": ["X=785-188"], "lSolutions": [597]},
	{"iIndex": 223, "sQuestion": "Sarah was given 831 Green balls, 888 Azure balls, 879 Violet balls, and 76 Brown balls. How many more Azure balls are there than Brown balls?", "lEquations": ["X=888-76"], "lSolutions": [812]},
	{"iIndex": 224, "sQuestion": "Sarah was given 645 Gray balls, 230 White balls, and 250 Blue balls. How many more Blue balls are there than White balls?", "lEquations": ["X=250-230"], "lSolutions": [20]},
	{"iIndex": 225, "sQuestion": "Sarah was given 762 Blue balls, 737 Gray balls, 901 Red balls, 369 Orange balls, and 2 Green balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=901-369"], "lSolutions": [532]},
	{"iIndex": 226, "sQuestion": "Sarah was given 568 Red balls, 351 Golden balls, 896 White balls, 821 Yellow balls, and 526 Azure balls. How many more Yellow balls are there than White balls?", "lEquations": ["X=821-896"], "lSolutions": [-75]},
	{"iIndex": 227, "sQuestion": "Sarah was given 300 Gray balls, and 830 Golden balls. How many more Golden balls are there than Gray balls?", "lEquations": ["X=830-300"], "lSolutions": [530]},
	{"iIndex": 228, "sQuestion": "Sarah was given 118 Magenta balls, 514 Black balls, 226 Golden balls, and 892 Brown balls. How many more Golden balls are there than Brown balls?", "lEquations": ["X=226-892"], "lSolutions": [-666]},
	{"iIndex": 229, "sQuestion": "Sarah was given 612 Magenta balls, 528 Blue balls, 527 White balls, and 524 Black balls. How many more Blue balls are there than White balls?", "lEquations": ["X=528-527"], "lSolutions": [1]},
	{"iIndex": 230, "sQuestion": "Sarah was given 4 Black balls, and 689 Blue balls. How many more Black balls are there than Blue balls?", "lEquations": ["X=4-689"], "lSolutions": [-685]},
	{"iIndex": 231, "sQuestion": "Sarah was given 10 Black balls, and 36 White balls. How many more White balls are there than Black balls?", "lEquations": ["X=36-10"], "lSolutions": [26]},
	{"iIndex": 232, "sQuestion": "Sarah was given 481 Violet balls, and 205 Blue balls. How many more Blue balls are there than Violet balls?", "lEquations": ["X=205-481"], "lSolutions": [-276]},
	{"iIndex": 233, "sQuestion": "Sarah was given 245 Blue balls, 994 Azure balls, and 569 White balls. How many more White balls are there than Azure balls?", "lEquations": ["X=569-994"], "lSolutions": [-425]},
	{"iIndex": 234, "sQuestion": "Sarah was given 123 Yellow balls, and 17 Azure balls. How many more Yellow balls are there than Azure balls?", "lEquations": ["X=123-17"], "lSolutions": [106]},
	{"iIndex": 235, "sQuestion": "Sarah was given 322 White balls, and 900 Magenta balls. How many more White balls are there than Magenta balls?", "lEquations": ["X=322-900"], "lSolutions": [-578]},
	{"iIndex": 236, "sQuestion": "Sarah was given 294 Blue balls, 985 White balls, and 353 Orange balls. How many more Blue balls are there than Orange balls?", "lEquations": ["X=294-353"], "lSolutions": [-59]},
	{"iIndex": 237, "sQuestion": "Sarah was given 813 Brown balls, and 234 Blue balls. How many more Brown balls are there than Blue balls?", "lEquations": ["X=813-234"], "lSolutions": [579]},
	{"iIndex": 238, "sQuestion": "Sarah was given 740 Violet balls, 34 Azure balls, 742 Pink balls, and 258 Blue balls. How many more Azure balls are there than Pink balls?", "lEquations": ["X=34-742"], "lSolutions": [-708]},
	{"iIndex": 239, "sQuestion": "Sarah was given 945 Yellow balls, 676 Brown balls, 889 Magenta balls, and 631 Pink balls. How many more Pink balls are there than Yellow balls?", "lEquations": ["X=631-945"], "lSolutions": [-314]},
	{"iIndex": 240, "sQuestion": "Sarah was given 620 Blue balls, 665 Pink balls, 117 Brown balls, 246 Yellow balls, and 75 Red balls. How many more Yellow balls are there than Brown balls?", "lEquations": ["X=246-117"], "lSolutions": [129]},
	{"iIndex": 241, "sQuestion": "Sarah was given 468 Yellow balls, 374 Magenta balls, 361 Pink balls, and 324 Azure balls. How many more Azure balls are there than Yellow balls?", "lEquations": ["X=324-468"], "lSolutions": [-144]},
	{"iIndex": 242, "sQuestion": "Sarah was given 562 Red balls, 729 Green balls, 745 Gray balls, and 154 Pink balls. How many more Green balls are there than Pink balls?", "lEquations": ["X=729-154"], "lSolutions": [575]},
	{"iIndex": 243, "sQuestion": "Sarah was given 627 Red balls, 260 Black balls, and 242 Pink balls. How many more Black balls are there than Pink balls?", "lEquations": ["X=260-242"], "lSolutions": [18]},
	{"iIndex": 244, "sQuestion": "Sarah was given 318 Red balls, 80 Green balls, 439 Pink balls, and 158 Brown balls. How many more Pink balls are there than Brown balls?", "lEquations": ["X=439-158"], "lSolutions": [281]},
	{"iIndex": 245, "sQuestion": "Sarah was given 701 Pink balls, and 324 Red balls. How many more Pink balls are there than Red balls?", "lEquations": ["X=701-324"], "lSolutions": [377]},
	{"iIndex": 246, "sQuestion": "Sarah was given 978 White balls, and 197 Orange balls. How many more Orange balls are there than White balls?", "lEquations": ["X=197-978"], "lSolutions": [-781]},
	{"iIndex": 247, "sQuestion": "Sarah was given 907 Azure balls, 629 White balls, and 729 Green balls. How many more Azure balls are there than White balls?", "lEquations": ["X=907-629"], "lSolutions": [278]},
	{"iIndex": 248, "sQuestion": "Sarah was given 791 Gray balls, 51 Azure balls, 238 Blue balls, and 965 Yellow balls. How many more Blue balls are there than Gray balls?", "lEquations": ["X=238-791"], "lSolutions": [-553]},
	{"iIndex": 249, "sQuestion": "Sarah was given 378 Black balls, 519 Red balls, and 912 Blue balls. How many more Red balls are there than Black balls?", "lEquations": ["X=519-378"], "lSolutions": [141]},
	{"iIndex": 250, "sQuestion": "Sarah was given 588 Blue balls, 523 Black balls, and 522 Green balls. How many more Green balls are there than Black balls?", "lEquations": ["X=522-523"], "lSolutions": [-1]},
	{"iIndex": 251, "sQuestion": "Sarah was given 365 Gray balls, 201 Violet balls, 444 Brown balls, 824 Red balls, and 76 Pink balls. How many more Brown balls are there than Violet balls?", "lEquations": ["X=444-201"], "lSolutions": [243]},
	{"iIndex": 252, "sQuestion": "Sarah was given 22 Magenta balls, 168 Red balls, and 498 Blue balls. How many more Red balls are there than Magenta balls?", "lEquations": ["X=168-22"], "lSolutions": [146]},
	{"iIndex": 253, "sQuestion": "Sarah was given 85 Magenta balls, and 625 Yellow balls. How many more Magenta balls are there than Yellow balls?", "lEquations": ["X=85-625"], "lSolutions": [-540]},
	{"iIndex": 254, "sQuestion": "Sarah was given 589 Gray balls, 708 Yellow balls, and 859 Red balls. How many more Red balls are there than Gray balls?", "lEquations": ["X=859-589"], "lSolutions": [270]},
	{"iIndex": 255, "sQuestion": "Sarah was given 38 Yellow balls, 923 Brown balls, and 54 Violet balls. How many more Brown balls are there than Violet balls?", "lEquations": ["X=923-54"], "lSolutions": [869]},
	{"iIndex": 256, "sQuestion": "Sarah was given 327 Red balls, 681 Brown balls, 760 Black balls, and 956 Violet balls. How many more Black balls are there than Red balls?", "lEquations": ["X=760-327"], "lSolutions": [433]},
	{"iIndex": 257, "sQuestion": "Sarah was given 65 Yellow balls, 675 Azure balls, 662 Pink balls, 880 Black balls, and 331 Green balls. How many more Yellow balls are there than Azure balls?", "lEquations": ["X=65-675"], "lSolutions": [-610]},
	{"iIndex": 258, "sQuestion": "Sarah was given 838 Blue balls, 259 Yellow balls, 891 Green balls, and 314 Pink balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=314-838"], "lSolutions": [-524]},
	{"iIndex": 259, "sQuestion": "Sarah was given 119 Red balls, 442 Golden balls, 441 Green balls, and 950 White balls. How many more Golden balls are there than Green balls?", "lEquations": ["X=442-441"], "lSolutions": [1]},
	{"iIndex": 260, "sQuestion": "Sarah was given 507 Magenta balls, 590 Golden balls, 289 Orange balls, and 624 Gray balls. How many more Orange balls are there than Golden balls?", "lEquations": ["X=289-590"], "lSolutions": [-301]},
	{"iIndex": 261, "sQuestion": "Sarah was given 366 Red balls, 535 Yellow balls, 763 Black balls, and 581 Azure balls. How many more Yellow balls are there than Azure balls?", "lEquations": ["X=535-581"], "lSolutions": [-46]},
	{"iIndex": 262, "sQuestion": "Sarah was given 39 Red balls, 748 Pink balls, 656 Brown balls, 254 Orange balls, and 81 Blue balls. How many more Red balls are there than Blue balls?", "lEquations": ["X=39-81"], "lSolutions": [-42]},
	{"iIndex": 263, "sQuestion": "Sarah was given 815 Gray balls, 175 Brown balls, 577 Orange balls, 726 Yellow balls, and 510 Violet balls. How many more Yellow balls are there than Gray balls?", "lEquations": ["X=726-815"], "lSolutions": [-89]},
	{"iIndex": 264, "sQuestion": "Sarah was given 608 Violet balls, 603 Orange balls, 383 Pink balls, 53 Brown balls, and 861 Red balls. How many more Pink balls are there than Brown balls?", "lEquations": ["X=383-53"], "lSolutions": [330]},
	{"iIndex": 265, "sQuestion": "Sarah was given 311 Orange balls, 872 Golden balls, and 91 Violet balls. How many more Golden balls are there than Orange balls?", "lEquations": ["X=872-311"], "lSolutions": [561]},
	{"iIndex": 266, "sQuestion": "Sarah was given 47 Red balls, 978 Brown balls, and 373 Pink balls. How many more Pink balls are there than Brown balls?", "lEquations": ["X=373-978"], "lSolutions": [-605]},
	{"iIndex": 267, "sQuestion": "Sarah was given 590 Gray balls, 240 Brown balls, and 906 White balls. How many more White balls are there than Gray balls?", "lEquations": ["X=906-590"], "lSolutions": [316]},
	{"iIndex": 268, "sQuestion": "Sarah was given 478 Golden balls, 127 Red balls, 323 Violet balls, 269 Blue balls, and 142 Azure balls. How many more Red balls are there than Violet balls?", "lEquations": ["X=127-323"], "lSolutions": [-196]},
	{"iIndex": 269, "sQuestion": "Sarah was given 633 Red balls, 543 Magenta balls, and 316 Orange balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=633-316"], "lSolutions": [317]},
	{"iIndex": 270, "sQuestion": "Sarah was given 520 Brown balls, 979 Violet balls, 317 Green balls, 607 Red balls, and 863 Gray balls. How many more Violet balls are there than Green balls?", "lEquations": ["X=979-317"], "lSolutions": [662]},
	{"iIndex": 271, "sQuestion": "Sarah was given 349 Golden balls, 122 White balls, and 436 Pink balls. How many more White balls are there than Pink balls?", "lEquations": ["X=122-436"], "lSolutions": [-314]},
	{"iIndex": 272, "sQuestion": "Sarah was given 547 Gray balls, 453 Brown balls, and 373 Pink balls. How many more Gray balls are there than Pink balls?", "lEquations": ["X=547-373"], "lSolutions": [174]},
	{"iIndex": 273, "sQuestion": "Sarah was given 397 Black balls, and 141 Violet balls. How many more Violet balls are there than Black balls?", "lEquations": ["X=141-397"], "lSolutions": [-256]},
	{"iIndex": 274, "sQuestion": "Sarah was given 602 Brown balls, 199 Violet balls, 970 Pink balls, 1000 Gray balls, and 605 White balls. How many more Gray balls are there than Pink balls?", "lEquations": ["X=1000-970"], "lSolutions": [30]},
	{"iIndex": 275, "sQuestion": "Sarah was given 280 Magenta balls, 185 Red balls, 899 Pink balls, and 795 Gray balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=280-185"], "lSolutions": [95]},
	{"iIndex": 276, "sQuestion": "Sarah was given 398 Pink balls, 56 Yellow balls, 766 Brown balls, 480 Orange balls, and 285 Black balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=480-766"], "lSolutions": [-286]},
	{"iIndex": 277, "sQuestion": "Sarah was given 555 Red balls, and 887 Azure balls. How many more Azure balls are there than Red balls?", "lEquations": ["X=887-555"], "lSolutions": [332]},
	{"iIndex": 278, "sQuestion": "Sarah was given 231 Red balls, 806 Yellow balls, 831 Gray balls, and 222 Blue balls. How many more Blue balls are there than Yellow balls?", "lEquations": ["X=222-806"], "lSolutions": [-584]},
	{"iIndex": 279, "sQuestion": "Sarah was given 436 Orange balls, and 54 Black balls. How many more Black balls are there than Orange balls?", "lEquations": ["X=54-436"], "lSolutions": [-382]},
	{"iIndex": 280, "sQuestion": "Sarah was given 15 Violet balls, 397 Yellow balls, 499 Green balls, and 734 Azure balls. How many more Azure balls are there than Green balls?", "lEquations": ["X=734-499"], "lSolutions": [235]},
	{"iIndex": 281, "sQuestion": "Sarah was given 870 Golden balls, 772 Gray balls, 297 Azure balls, and 179 Yellow balls. How many more Golden balls are there than Yellow balls?", "lEquations": ["X=870-179"], "lSolutions": [691]},
	{"iIndex": 282, "sQuestion": "Sarah was given 552 Brown balls, 127 Red balls, and 550 Black balls. How many more Red balls are there than Black balls?", "lEquations": ["X=127-550"], "lSolutions": [-423]},
	{"iIndex": 283, "sQuestion": "Sarah was given 607 Orange balls, 819 Gray balls, 474 Yellow balls, and 332 Violet balls. How many more Violet balls are there than Gray balls?", "lEquations": ["X=332-819"], "lSolutions": [-487]},
	{"iIndex": 284, "sQuestion": "Sarah was given 609 Blue balls, 956 Violet balls, and 252 Pink balls. How many more Blue balls are there than Violet balls?", "lEquations": ["X=609-956"], "lSolutions": [-347]},
	{"iIndex": 285, "sQuestion": "Sarah was given 966 Yellow balls, and 31 Azure balls. How many more Azure balls are there than Yellow balls?", "lEquations": ["X=31-966"], "lSolutions": [-935]},
	{"iIndex": 286, "sQuestion": "Sarah was given 394 Blue balls, 686 Yellow balls, 793 Azure balls, and 180 Orange balls. How many more Blue balls are there than Orange balls?", "lEquations": ["X=394-180"], "lSolutions": [214]},
	{"iIndex": 287, "sQuestion": "Sarah was given 240 Gray balls, 68 Magenta balls, 843 Pink balls, and 627 Blue balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=843-627"], "lSolutions": [216]},
	{"iIndex": 288, "sQuestion": "Sarah was given 99 Orange balls, 445 Pink balls, and 5 Green balls. How many more Pink balls are there than Orange balls?", "lEquations": ["X=445-99"], "lSolutions": [346]},
	{"iIndex": 289, "sQuestion": "Sarah was given 838 Red balls, 184 Black balls, 772 Violet balls, 349 Magenta balls, and 148 Orange balls. How many more Magenta balls are there than Violet balls?", "lEquations": ["X=349-772"], "lSolutions": [-423]},
	{"iIndex": 290, "sQuestion": "Sarah was given 453 Blue balls, 599 Red balls, 535 Violet balls, and 134 Black balls. How many more Black balls are there than Red balls?", "lEquations": ["X=134-599"], "lSolutions": [-465]},
	{"iIndex": 291, "sQuestion": "Sarah was given 325 Gray balls, 609 Magenta balls, 141 Orange balls, and 22 Golden balls. How many more Orange balls are there than Magenta balls?", "lEquations": ["X=141-609"], "lSolutions": [-468]},
	{"iIndex": 292, "sQuestion": "Sarah was given 607 Blue balls, 501 Orange balls, and 36 Brown balls. How many more Brown balls are there than Blue balls?", "lEquations": ["X=36-607"], "lSolutions": [-571]},
	{"iIndex": 293, "sQuestion": "Sarah was given 147 Violet balls, 215 Brown balls, and 370 Gray balls. How many more Gray balls are there than Violet balls?", "lEquations": ["X=370-147"], "lSolutions": [223]},
	{"iIndex": 294, "sQuestion": "Sarah was given 487 Orange balls, 31 Yellow balls, 542 Black balls, and 473 Azure balls. How many more Yellow balls are there than Orange balls?", "lEquations": ["X=31-487"], "lSolutions": [-456]},
	{"iIndex": 295, "sQuestion": "Sarah was given 194 White balls, 74 Green balls, 817 Pink balls, and 109 Violet balls. How many more White balls are there than Violet balls?", "lEquations": ["X=194-109"], "lSolutions": [85]},
	{"iIndex": 296, "sQuestion": "Sarah was given 536 Black balls, 728 Brown balls, 668 Orange balls, and 495 Gray balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=668-728"], "lSolutions": [-60]},
	{"iIndex": 297, "sQuestion": "Sarah was given 946 Yellow balls, 211 Golden balls, 201 Magenta balls, 67 Azure balls, and 149 Violet balls. How many more Golden balls are there than Yellow balls?", "lEquations": ["X=211-946"], "lSolutions": [-735]},
	{"iIndex": 298, "sQuestion": "Sarah was given 804 Golden balls, 632 Azure balls, and 452 Brown balls. How many more Brown balls are there than Golden balls?", "lEquations": ["X=452-804"], "lSolutions": [-352]},
	{"iIndex": 299, "sQuestion": "Sarah was given 841 Red balls, and 839 Pink balls. How many more Red balls are there than Pink balls?", "lEquations": ["X=841-839"], "lSolutions": [2]},
	{"iIndex": 300, "sQuestion": "Sarah was given 712 Azure balls, 791 Red balls, 677 Pink balls, and 384 Blue balls. How many more Blue balls are there than Pink balls?", "lEquations": ["X=384-677"], "lSolutions": [-293]},
	{"iIndex": 301, "sQuestion": "Sarah was given 133 Violet balls, and 706 Brown balls. How many more Brown balls are there than Violet balls?", "lEquations": ["X=706-133"], "lSolutions": [573]},
	{"iIndex": 302, "sQuestion": "Sarah was given 655 Black balls, 128 Pink balls, 448 Blue balls, and 974 Golden balls. How many more Pink balls are there than Black balls?", "lEquations": ["X=128-655"], "lSolutions": [-527]},
	{"iIndex": 303, "sQuestion": "Sarah was given 654 Red balls, 28 Green balls, 495 White balls, and 69 Brown balls. How many more Brown balls are there than Red balls?", "lEquations": ["X=69-654"], "lSolutions": [-585]},
	{"iIndex": 304, "sQuestion": "Sarah was given 691 Violet balls, 724 Gray balls, 967 Black balls, 404 Red balls, and 659 Pink balls. How many more Pink balls are there than Red balls?", "lEquations": ["X=659-404"], "lSolutions": [255]},
	{"iIndex": 305, "sQuestion": "Sarah was given 853 Violet balls, 752 Azure balls, and 325 Brown balls. How many more Azure balls are there than Violet balls?", "lEquations": ["X=752-853"], "lSolutions": [-101]},
	{"iIndex": 306, "sQuestion": "Sarah was given 626 Blue balls, and 887 Gray balls. How many more Gray balls are there than Blue balls?", "lEquations": ["X=887-626"], "lSolutions": [261]},
	{"iIndex": 307, "sQuestion": "Sarah was given 905 Yellow balls, and 929 Black balls. How many more Yellow balls are there than Black balls?", "lEquations": ["X=905-929"], "lSolutions": [-24]},
	{"iIndex": 308, "sQuestion": "Sarah was given 627 Black balls, 64 Green balls, and 588 Brown balls. How many more Green balls are there than Brown balls?", "lEquations": ["X=64-588"], "lSolutions": [-524]},
	{"iIndex": 309, "sQuestion": "Sarah was given 30 Azure balls, 284 Golden balls, 931 White balls, and 636 Gray balls. How many more Gray balls are there than Golden balls?", "lEquations": ["X=636-284"], "lSolutions": [352]},
	{"iIndex": 310, "sQuestion": "Sarah was given 453 Pink balls, 547 Yellow balls, 57 Magenta balls, and 276 Brown balls. How many more Yellow balls are there than Brown balls?", "lEquations": ["X=547-276"], "lSolutions": [271]},
	{"iIndex": 311, "sQuestion": "Sarah was given 997 Green balls, 675 Gray balls, 408 Red balls, 778 Yellow balls, and 991 Violet balls. How many more Yellow balls are there than Violet balls?", "lEquations": ["X=778-991"], "lSolutions": [-213]},
	{"iIndex": 312, "sQuestion": "Sarah was given 18 Brown balls, 65 Magenta balls, 152 Golden balls, 506 Blue balls, and 997 Green balls. How many more Brown balls are there than Golden balls?", "lEquations": ["X=18-152"], "lSolutions": [-134]},
	{"iIndex": 313, "sQuestion": "Sarah was given 901 Pink balls, 311 Green balls, 142 Magenta balls, and 110 Violet balls. How many more Green balls are there than Violet balls?", "lEquations": ["X=311-110"], "lSolutions": [201]},
	{"iIndex": 314, "sQuestion": "Sarah was given 584 Brown balls, and 933 Orange balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=933-584"], "lSolutions": [349]},
	{"iIndex": 315, "sQuestion": "Sarah was given 789 Violet balls, and 276 Blue balls. How many more Violet balls are there than Blue balls?", "lEquations": ["X=789-276"], "lSolutions": [513]},
	{"iIndex": 316, "sQuestion": "Sarah was given 985 White balls, 514 Golden balls, 709 Green balls, and 23 Orange balls. How many more Orange balls are there than White balls?", "lEquations": ["X=23-985"], "lSolutions": [-962]},
	{"iIndex": 317, "sQuestion": "Sarah was given 620 Golden balls, and 635 Yellow balls. How many more Yellow balls are there than Golden balls?", "lEquations": ["X=635-620"], "lSolutions": [15]},
	{"iIndex": 318, "sQuestion": "Sarah was given 45 Violet balls, 193 Yellow balls, 174 Gray balls, 57 Pink balls, and 632 Golden balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=45-632"], "lSolutions": [-587]},
	{"iIndex": 319, "sQuestion": "Sarah was given 154 Magenta balls, 234 Blue balls, 887 Red balls, and 223 Violet balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=154-887"], "lSolutions": [-733]},
	{"iIndex": 320, "sQuestion": "Sarah was given 72 Green balls, 877 Gray balls, 611 Red balls, 272 Magenta balls, and 59 Blue balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=72-272"], "lSolutions": [-200]},
	{"iIndex": 321, "sQuestion": "Sarah was given 70 Pink balls, 190 Brown balls, 220 Azure balls, and 787 Magenta balls. How many more Pink balls are there than Magenta balls?", "lEquations": ["X=70-787"], "lSolutions": [-717]},
	{"iIndex": 322, "sQuestion": "Sarah was given 235 Yellow balls, 830 Violet balls, 965 Red balls, 61 Magenta balls, and 375 Blue balls. How many more Yellow balls are there than Magenta balls?", "lEquations": ["X=235-61"], "lSolutions": [174]},
	{"iIndex": 323, "sQuestion": "Sarah was given 708 Pink balls, 913 Blue balls, 722 Green balls, and 534 Red balls. How many more Red balls are there than Pink balls?", "lEquations": ["X=534-708"], "lSolutions": [-174]},
	{"iIndex": 324, "sQuestion": "Sarah was given 484 Golden balls, 320 Orange balls, 269 Magenta balls, 796 Gray balls, and 813 White balls. How many more Magenta balls are there than Orange balls?", "lEquations": ["X=269-320"], "lSolutions": [-51]},
	{"iIndex": 325, "sQuestion": "Sarah was given 679 Orange balls, 36 Golden balls, and 807 Azure balls. How many more Golden balls are there than Azure balls?", "lEquations": ["X=36-807"], "lSolutions": [-771]},
	{"iIndex": 326, "sQuestion": "Sarah was given 878 Red balls, and 506 Blue balls. How many more Red balls are there than Blue balls?", "lEquations": ["X=878-506"], "lSolutions": [372]},
	{"iIndex": 327, "sQuestion": "Sarah was given 589 Blue balls, 119 Violet balls, 183 Yellow balls, 509 Black balls, and 368 Brown balls. How many more Brown balls are there than Black balls?", "lEquations": ["X=368-509"], "lSolutions": [-141]},
	{"iIndex": 328, "sQuestion": "Sarah was given 641 Violet balls, 409 Azure balls, 969 Pink balls, 890 Magenta balls, and 145 White balls. How many more Magenta balls are there than Azure balls?", "lEquations": ["X=890-409"], "lSolutions": [481]},
	{"iIndex": 329, "sQuestion": "Sarah was given 632 Green balls, and 441 Azure balls. How many more Green balls are there than Azure balls?", "lEquations": ["X=632-441"], "lSolutions": [191]},
	{"iIndex": 330, "sQuestion": "Sarah was given 786 Gray balls, 110 Azure balls, 334 Green balls, 802 Violet balls, and 967 Pink balls. How many more Azure balls are there than Pink balls?", "lEquations": ["X=110-967"], "lSolutions": [-857]},
	{"iIndex": 331, "sQuestion": "Sarah was given 933 Golden balls, 100 White balls, 789 Violet balls, and 380 Orange balls. How many more Orange balls are there than Violet balls?", "lEquations": ["X=380-789"], "lSolutions": [-409]},
	{"iIndex": 332, "sQuestion": "Sarah was given 823 Green balls, and 87 Red balls. How many more Red balls are there than Green balls?", "lEquations": ["X=87-823"], "lSolutions": [-736]},
	{"iIndex": 333, "sQuestion": "Sarah was given 994 Gray balls, 401 Orange balls, 504 Red balls, 821 Magenta balls, and 862 Violet balls. How many more Orange balls are there than Violet balls?", "lEquations": ["X=401-862"], "lSolutions": [-461]},
	{"iIndex": 334, "sQuestion": "Sarah was given 64 Azure balls, and 421 Magenta balls. How many more Azure balls are there than Magenta balls?", "lEquations": ["X=64-421"], "lSolutions": [-357]},
	{"iIndex": 335, "sQuestion": "Sarah was given 41 Green balls, and 356 Gray balls. How many more Green balls are there than Gray balls?", "lEquations": ["X=41-356"], "lSolutions": [-315]},
	{"iIndex": 336, "sQuestion": "Sarah was given 636 Green balls, 367 Black balls, 871 Violet balls, and 335 Brown balls. How many more Black balls are there than Violet balls?", "lEquations": ["X=367-871"], "lSolutions": [-504]},
	{"iIndex": 337, "sQuestion": "Sarah was given 255 Yellow balls, 650 Gray balls, and 791 Blue balls. How many more Blue balls are there than Yellow balls?", "lEquations": ["X=791-255"], "lSolutions": [536]},
	{"iIndex": 338, "sQuestion": "Sarah was given 732 Green balls, 310 Pink balls, 602 Violet balls, and 5 Yellow balls. How many more Yellow balls are there than Violet balls?", "lEquations": ["X=5-602"], "lSolutions": [-597]},
	{"iIndex": 339, "sQuestion": "Sarah was given 166 Red balls, 87 Blue balls, and 266 Pink balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=87-166"], "lSolutions": [-79]},
	{"iIndex": 340, "sQuestion": "Sarah was given 989 Red balls, 937 Pink balls, and 815 Violet balls. How many more Violet balls are there than Red balls?", "lEquations": ["X=815-989"], "lSolutions": [-174]},
	{"iIndex": 341, "sQuestion": "Sarah was given 40 Azure balls, 457 Orange balls, 222 Blue balls, and 411 Red balls. How many more Azure balls are there than Blue balls?", "lEquations": ["X=40-222"], "lSolutions": [-182]},
	{"iIndex": 342, "sQuestion": "Sarah was given 524 Orange balls, 814 Golden balls, and 668 Green balls. How many more Golden balls are there than Orange balls?", "lEquations": ["X=814-524"], "lSolutions": [290]},
	{"iIndex": 343, "sQuestion": "Sarah was given 237 Black balls, and 123 Pink balls. How many more Pink balls are there than Black balls?", "lEquations": ["X=123-237"], "lSolutions": [-114]},
	{"iIndex": 344, "sQuestion": "Sarah was given 113 Brown balls, 197 Azure balls, and 16 Violet balls. How many more Brown balls are there than Azure balls?", "lEquations": ["X=113-197"], "lSolutions": [-84]},
	{"iIndex": 345, "sQuestion": "Sarah was given 931 Violet balls, 316 Gray balls, and 271 Green balls. How many more Gray balls are there than Violet balls?", "lEquations": ["X=316-931"], "lSolutions": [-615]},
	{"iIndex": 346, "sQuestion": "Sarah was given 642 Pink balls, and 800 White balls. How many more White balls are there than Pink balls?", "lEquations": ["X=800-642"], "lSolutions": [158]},
	{"iIndex": 347, "sQuestion": "Sarah was given 678 Black balls, 312 Yellow balls, and 118 Brown balls. How many more Black balls are there than Brown balls?", "lEquations": ["X=678-118"], "lSolutions": [560]},
	{"iIndex": 348, "sQuestion": "Sarah was given 200 Blue balls, and 652 White balls. How many more Blue balls are there than White balls?", "lEquations": ["X=200-652"], "lSolutions": [-452]},
	{"iIndex": 349, "sQuestion": "Sarah was given 851 Violet balls, and 487 Blue balls. How many more Violet balls are there than Blue balls?", "lEquations": ["X=851-487"], "lSolutions": [364]},
	{"iIndex": 350, "sQuestion": "Sarah was given 200 Violet balls, and 408 Green balls. How many more Violet balls are there than Green balls?", "lEquations": ["X=200-408"], "lSolutions": [-208]},
	{"iIndex": 351, "sQuestion": "Sarah was given 414 Green balls, 543 Violet balls, 542 Azure balls, and 547 Pink balls. How many more Pink balls are there than Azure balls?", "lEquations": ["X=547-542"], "lSolutions": [5]},
	{"iIndex": 352, "sQuestion": "Sarah was given 491 Red balls, and 577 Magenta balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=577-491"], "lSolutions": [86]},
	{"iIndex": 353, "sQuestion": "Sarah was given 325 Violet balls, 149 White balls, and 225 Pink balls. How many more White balls are there than Violet balls?", "lEquations": ["X=149-325"], "lSolutions": [-176]},
	{"iIndex": 354, "sQuestion": "Sarah was given 901 Orange balls, 804 Pink balls, 67 Gray balls, 818 Brown balls, and 706 Violet balls. How many more Orange balls are there than Pink balls?", "lEquations": ["X=901-804"], "lSolutions": [97]},
	{"iIndex": 355, "sQuestion": "Sarah was given 223 Violet balls, 199 Azure balls, 312 Green balls, 724 Gray balls, and 390 White balls. How many more Green balls are there than White balls?", "lEquations": ["X=312-390"], "lSolutions": [-78]},
	{"iIndex": 356, "sQuestion": "Sarah was given 196 Gray balls, and 549 Green balls. How many more Gray balls are there than Green balls?", "lEquations": ["X=196-549"], "lSolutions": [-353]},
	{"iIndex": 357, "sQuestion": "Sarah was given 413 White balls, 911 Golden balls, and 290 Pink balls. How many more White balls are there than Pink balls?", "lEquations": ["X=413-290"], "lSolutions": [123]},
	{"iIndex": 358, "sQuestion": "Sarah was given 480 Brown balls, 832 Red balls, 677 Pink balls, 958 Blue balls, and 111 Gray balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=958-832"], "lSolutions": [126]},
	{"iIndex": 359, "sQuestion": "Sarah was given 519 Red balls, and 487 Yellow balls. How many more Yellow balls are there than Red balls?", "lEquations": ["X=487-519"], "lSolutions": [-32]},
	{"iIndex": 360, "sQuestion": "Sarah was given 235 Green balls, 387 Azure balls, 924 Yellow balls, 636 Magenta balls, and 887 Gray balls. How many more Green balls are there than Azure balls?", "lEquations": ["X=235-387"], "lSolutions": [-152]},
	{"iIndex": 361, "sQuestion": "Sarah was given 506 Black balls, 63 White balls, 781 Azure balls, and 472 Gray balls. How many more Black balls are there than White balls?", "lEquations": ["X=506-63"], "lSolutions": [443]},
	{"iIndex": 362, "sQuestion": "Sarah was given 284 Yellow balls, 863 Violet balls, 604 Black balls, 537 Golden balls, and 786 White balls. How many more White balls are there than Black balls?", "lEquations": ["X=786-604"], "lSolutions": [182]},
	{"iIndex": 363, "sQuestion": "Sarah was given 704 Gray balls, 320 Red balls, and 734 Azure balls. How many more Red balls are there than Azure balls?", "lEquations": ["X=320-734"], "lSolutions": [-414]},
	{"iIndex": 364, "sQuestion": "Sarah was given 29 Brown balls, 984 Orange balls, and 514 Azure balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=984-29"], "lSolutions": [955]},
	{"iIndex": 365, "sQuestion": "Sarah was given 333 Green balls, 641 White balls, 527 Gray balls, and 679 Black balls. How many more White balls are there than Gray balls?", "lEquations": ["X=641-527"], "lSolutions": [114]},
	{"iIndex": 366, "sQuestion": "Sarah was given 381 Red balls, and 409 Brown balls. How many more Brown balls are there than Red balls?", "lEquations": ["X=409-381"], "lSolutions": [28]},
	{"iIndex": 367, "sQuestion": "Sarah was given 38 Gray balls, 276 Black balls, 319 Golden balls, 181 White balls, and 551 Green balls. How many more White balls are there than Green balls?", "lEquations": ["X=181-551"], "lSolutions": [-370]},
	{"iIndex": 368, "sQuestion": "Sarah was given 244 White balls, 869 Brown balls, 991 Pink balls, and 232 Yellow balls. How many more Pink balls are there than White balls?", "lEquations": ["X=991-244"], "lSolutions": [747]},
	{"iIndex": 369, "sQuestion": "Sarah was given 203 Brown balls, and 404 Violet balls. How many more Brown balls are there than Violet balls?", "lEquations": ["X=203-404"], "lSolutions": [-201]},
	{"iIndex": 370, "sQuestion": "Sarah was given 5 Red balls, and 466 Yellow balls. How many more Red balls are there than Yellow balls?", "lEquations": ["X=5-466"], "lSolutions": [-461]},
	{"iIndex": 371, "sQuestion": "Sarah was given 532 Pink balls, 995 Green balls, and 982 Golden balls. How many more Green balls are there than Pink balls?", "lEquations": ["X=995-532"], "lSolutions": [463]},
	{"iIndex": 372, "sQuestion": "Sarah was given 733 Gray balls, and 387 Pink balls. How many more Pink balls are there than Gray balls?", "lEquations": ["X=387-733"], "lSolutions": [-346]},
	{"iIndex": 373, "sQuestion": "Sarah was given 750 Brown balls, and 768 Pink balls. How many more Pink balls are there than Brown balls?", "lEquations": ["X=768-750"], "lSolutions": [18]},
	{"iIndex": 374, "sQuestion": "Sarah was given 516 Red balls, 638 Pink balls, 177 Violet balls, 274 Magenta balls, and 423 Orange balls. How many more Magenta balls are there than Violet balls?", "lEquations": ["X=274-177"], "lSolutions": [97]},
	{"iIndex": 375, "sQuestion": "Sarah was given 565 Orange balls, 386 Brown balls, 294 Pink balls, and 246 Azure balls. How many more Pink balls are there than Brown balls?", "lEquations": ["X=294-386"], "lSolutions": [-92]},
	{"iIndex": 376, "sQuestion": "Sarah was given 270 White balls, 727 Pink balls, 898 Golden balls, and 400 Black balls. How many more Pink balls are there than Golden balls?", "lEquations": ["X=727-898"], "lSolutions": [-171]},
	{"iIndex": 377, "sQuestion": "Sarah was given 496 Brown balls, 114 White balls, 225 Red balls, and 156 Pink balls. How many more Brown balls are there than Pink balls?", "lEquations": ["X=496-156"], "lSolutions": [340]},
	{"iIndex": 378, "sQuestion": "Sarah was given 98 Red balls, and 480 Black balls. How many more Black balls are there than Red balls?", "lEquations": ["X=480-98"], "lSolutions": [382]},
	{"iIndex": 379, "sQuestion": "Sarah was given 542 Green balls, and 484 White balls. How many more Green balls are there than White balls?", "lEquations": ["X=542-484"], "lSolutions": [58]},
	{"iIndex": 380, "sQuestion": "Sarah was given 399 Black balls, 298 Yellow balls, 85 Pink balls, 235 Azure balls, and 838 Golden balls. How many more Azure balls are there than Golden balls?", "lEquations": ["X=235-838"], "lSolutions": [-603]},
	{"iIndex": 381, "sQuestion": "Sarah was given 192 Azure balls, 155 Orange balls, 878 Gray balls, and 55 Green balls. How many more Gray balls are there than Green balls?", "lEquations": ["X=878-55"], "lSolutions": [823]},
	{"iIndex": 382, "sQuestion": "Sarah was given 813 Golden balls, and 997 Gray balls. How many more Gray balls are there than Golden balls?", "lEquations": ["X=997-813"], "lSolutions": [184]},
	{"iIndex": 383, "sQuestion": "Sarah was given 641 Magenta balls, 118 Orange balls, and 545 Pink balls. How many more Magenta balls are there than Orange balls?", "lEquations": ["X=641-118"], "lSolutions": [523]},
	{"iIndex": 384, "sQuestion": "Sarah was given 934 Yellow balls, 642 Gray balls, and 729 Violet balls. How many more Yellow balls are there than Gray balls?", "lEquations": ["X=934-642"], "lSolutions": [292]},
	{"iIndex": 385, "sQuestion": "Sarah was given 663 Pink balls, 410 Orange balls, and 436 Red balls. How many more Orange balls are there than Red balls?", "lEquations": ["X=410-436"], "lSolutions": [-26]},
	{"iIndex": 386, "sQuestion": "Sarah was given 25 Violet balls, and 377 Black balls. How many more Violet balls are there than Black balls?", "lEquations": ["X=25-377"], "lSolutions": [-352]},
	{"iIndex": 387, "sQuestion": "Sarah was given 347 Violet balls, 948 Gray balls, 494 Green balls, 922 Azure balls, and 349 Pink balls. How many more Violet balls are there than Pink balls?", "lEquations": ["X=347-349"], "lSolutions": [-2]},
	{"iIndex": 388, "sQuestion": "Sarah was given 940 Magenta balls, and 869 Red balls. How many more Red balls are there than Magenta balls?", "lEquations": ["X=869-940"], "lSolutions": [-71]},
	{"iIndex": 389, "sQuestion": "Sarah was given 25 White balls, and 188 Black balls. How many more Black balls are there than White balls?", "lEquations": ["X=188-25"], "lSolutions": [163]},
	{"iIndex": 390, "sQuestion": "Sarah was given 943 Azure balls, 698 Orange balls, 271 Violet balls, 571 Green balls, and 394 Pink balls. How many more Azure balls are there than Green balls?", "lEquations": ["X=943-571"], "lSolutions": [372]},
	{"iIndex": 391, "sQuestion": "Sarah was given 703 Blue balls, 619 Black balls, 28 Orange balls, 645 Yellow balls, and 724 Red balls. How many more Yellow balls are there than Blue balls?", "lEquations": ["X=645-703"], "lSolutions": [-58]},
	{"iIndex": 392, "sQuestion": "Sarah was given 954 Yellow balls, 928 Magenta balls, 18 Golden balls, and 712 Pink balls. How many more Pink balls are there than Golden balls?", "lEquations": ["X=712-18"], "lSolutions": [694]},
	{"iIndex": 393, "sQuestion": "Sarah was given 324 Magenta balls, and 942 Violet balls. How many more Violet balls are there than Magenta balls?", "lEquations": ["X=942-324"], "lSolutions": [618]},
	{"iIndex": 394, "sQuestion": "Sarah was given 416 Pink balls, 754 Golden balls, 127 Orange balls, 879 Black balls, and 580 Azure balls. How many more Pink balls are there than Azure balls?", "lEquations": ["X=416-580"], "lSolutions": [-164]},
	{"iIndex": 395, "sQuestion": "Sarah was given 42 Magenta balls, 147 Yellow balls, 951 Red balls, 963 Azure balls, and 827 Orange balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=951-827"], "lSolutions": [124]},
	{"iIndex": 396, "sQuestion": "Sarah was given 481 Pink balls, 741 Golden balls, 301 Red balls, 597 Magenta balls, and 831 Gray balls. How many more Gray balls are there than Red balls?", "lEquations": ["X=831-301"], "lSolutions": [530]},
	{"iIndex": 397, "sQuestion": "Sarah was given 553 Magenta balls, and 963 Azure balls. How many more Azure balls are there than Magenta balls?", "lEquations": ["X=963-553"], "lSolutions": [410]},
	{"iIndex": 398, "sQuestion": "Sarah was given 949 Red balls, 937 Brown balls, 570 Azure balls, and 922 Gray balls. How many more Brown balls are there than Red balls?", "lEquations": ["X=937-949"], "lSolutions": [-12]},
	{"iIndex": 399, "sQuestion": "Sarah was given 824 Green balls, 642 Azure balls, 758 Brown balls, 298 Orange balls, and 164 White balls. How many more Brown balls are there than Orange balls?", "lEquations": ["X=758-298"], "lSolutions": [460]},
	{"iIndex": 400, "sQuestion": "Sarah was given 688 Black balls, 947 Green balls, 816 White balls, and 863 Pink balls. How many more Black balls are there than Pink balls?", "lEquations": ["X=688-863"], "lSolutions": [-175]},
	{"iIndex": 401, "sQuestion": "Sarah was given 244 Brown balls, 43 Blue balls, and 231 Magenta balls. How many more Brown balls are there than Magenta balls?", "lEquations": ["X=244-231"], "lSolutions": [13]},
	{"iIndex": 402, "sQuestion": "Sarah was given 117 Gray balls, and 45 Golden balls. How many more Golden balls are there than Gray balls?", "lEquations": ["X=45-117"], "lSolutions": [-72]},
	{"iIndex": 403, "sQuestion": "Sarah was given 932 Black balls, 399 White balls, 999 Pink balls, and 814 Magenta balls. How many more White balls are there than Magenta balls?", "lEquations": ["X=399-814"], "lSolutions": [-415]},
	{"iIndex": 404, "sQuestion": "Sarah was given 408 Yellow balls, 847 Pink balls, and 525 Gray balls. How many more Gray balls are there than Yellow balls?", "lEquations": ["X=525-408"], "lSolutions": [117]},
	{"iIndex": 405, "sQuestion": "Sarah was given 828 Violet balls, 770 Pink balls, 51 Black balls, and 980 Golden balls. How many more Violet balls are there than Black balls?", "lEquations": ["X=828-51"], "lSolutions": [777]},
	{"iIndex": 406, "sQuestion": "Sarah was given 1 Brown balls, and 893 Black balls. How many more Brown balls are there than Black balls?", "lEquations": ["X=1-893"], "lSolutions": [-892]},
	{"iIndex": 407, "sQuestion": "Sarah was given 393 Gray balls, 121 Magenta balls, 832 Green balls, and 987 Brown balls. How many more Magenta balls are there than Green balls?", "lEquations": ["X=121-832"], "lSolutions": [-711]},
	{"iIndex": 408, "sQuestion": "Sarah was given 375 Violet balls, 893 Orange balls, and 727 White balls. How many more Orange balls are there than Violet balls?", "lEquations": ["X=893-375"], "lSolutions": [518]},
	{"iIndex": 409, "sQuestion": "Sarah was given 383 Magenta balls, 259 Golden balls, 778 Red balls, 842 Green balls, and 217 Black balls. How many more Red balls are there than Black balls?", "lEquations": ["X=778-217"], "lSolutions": [561]},
	{"iIndex": 410, "sQuestion": "Sarah was given 8 Violet balls, 236 Blue balls, and 725 Gray balls. How many more Blue balls are there than Gray balls?", "lEquations": ["X=236-725"], "lSolutions": [-489]},
	{"iIndex": 411, "sQuestion": "Sarah was given 438 Azure balls, 922 Golden balls, and 639 Yellow balls. How many more Golden balls are there than Azure balls?", "lEquations": ["X=922-438"], "lSolutions": [484]},
	{"iIndex": 412, "sQuestion": "Sarah was given 528 White balls, 327 Violet balls, 204 Green balls, and 214 Orange balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=327-214"], "lSolutions": [113]},
	{"iIndex": 413, "sQuestion": "Sarah was given 791 Green balls, 519 Pink balls, 144 White balls, and 438 Brown balls. How many more Brown balls are there than Green balls?", "lEquations": ["X=438-791"], "lSolutions": [-353]},
	{"iIndex": 414, "sQuestion": "Sarah was given 118 Black balls, 683 Blue balls, 451 Azure balls, and 843 Red balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=683-451"], "lSolutions": [232]},
	{"iIndex": 415, "sQuestion": "Sarah was given 581 Pink balls, 773 Orange balls, 153 Yellow balls, and 32 Green balls. How many more Orange balls are there than Yellow balls?", "lEquations": ["X=773-153"], "lSolutions": [620]},
	{"iIndex": 416, "sQuestion": "Sarah was given 18 Magenta balls, 932 Gray balls, 961 Violet balls, 858 White balls, and 818 Yellow balls. How many more Gray balls are there than Violet balls?", "lEquations": ["X=932-961"], "lSolutions": [-29]},
	{"iIndex": 417, "sQuestion": "Sarah was given 378 Black balls, 705 Azure balls, and 380 Orange balls. How many more Black balls are there than Azure balls?", "lEquations": ["X=378-705"], "lSolutions": [-327]},
	{"iIndex": 418, "sQuestion": "Sarah was given 421 Gray balls, 352 Yellow balls, 603 Golden balls, and 809 Magenta balls. How many more Golden balls are there than Magenta balls?", "lEquations": ["X=603-809"], "lSolutions": [-206]},
	{"iIndex": 419, "sQuestion": "Sarah was given 952 Magenta balls, 824 Yellow balls, 946 Gray balls, and 865 Black balls. How many more Black balls are there than Yellow balls?", "lEquations": ["X=865-824"], "lSolutions": [41]},
	{"iIndex": 420, "sQuestion": "Sarah was given 109 Yellow balls, 609 Magenta balls, 544 Green balls, 974 Orange balls, and 56 White balls. How many more Magenta balls are there than White balls?", "lEquations": ["X=609-56"], "lSolutions": [553]},
	{"iIndex": 421, "sQuestion": "Sarah was given 869 Magenta balls, 301 Violet balls, and 434 Brown balls. How many more Violet balls are there than Brown balls?", "lEquations": ["X=301-434"], "lSolutions": [-133]},
	{"iIndex": 422, "sQuestion": "Sarah was given 157 Black balls, and 749 Azure balls. How many more Black balls are there than Azure balls?", "lEquations": ["X=157-749"], "lSolutions": [-592]},
	{"iIndex": 423, "sQuestion": "Sarah was given 943 Brown balls, 169 Black balls, 923 Azure balls, 732 Magenta balls, and 676 Golden balls. How many more Magenta balls are there than Black balls?", "lEquations": ["X=732-169"], "lSolutions": [563]},
	{"iIndex": 424, "sQuestion": "Sarah was given 306 Violet balls, 301 Magenta balls, 807 White balls, and 143 Pink balls. How many more White balls are there than Pink balls?", "lEquations": ["X=807-143"], "lSolutions": [664]},
	{"iIndex": 425, "sQuestion": "Sarah was given 329 Azure balls, 216 Yellow balls, and 285 Violet balls. How many more Azure balls are there than Yellow balls?", "lEquations": ["X=329-216"], "lSolutions": [113]},
	{"iIndex": 426, "sQuestion": "Sarah was given 918 Brown balls, 343 Green balls, 998 Red balls, and 153 Magenta balls. How many more Red balls are there than Magenta balls?", "lEquations": ["X=998-153"], "lSolutions": [845]},
	{"iIndex": 427, "sQuestion": "Sarah was given 917 Golden balls, 908 Pink balls, 393 Brown balls, 41 Orange balls, and 95 Red balls. How many more Red balls are there than Pink balls?", "lEquations": ["X=95-908"], "lSolutions": [-813]},
	{"iIndex": 428, "sQuestion": "Sarah was given 42 White balls, 426 Violet balls, 815 Orange balls, and 112 Green balls. How many more Orange balls are there than Violet balls?", "lEquations": ["X=815-426"], "lSolutions": [389]},
	{"iIndex": 429, "sQuestion": "Sarah was given 640 Yellow balls, and 363 Blue balls. How many more Blue balls are there than Yellow balls?", "lEquations": ["X=363-640"], "lSolutions": [-277]},
	{"iIndex": 430, "sQuestion": "Sarah was given 20 White balls, and 669 Yellow balls. How many more Yellow balls are there than White balls?", "lEquations": ["X=669-20"], "lSolutions": [649]},
	{"iIndex": 431, "sQuestion": "Sarah was given 824 Magenta balls, 687 Orange balls, and 632 Green balls. How many more Magenta balls are there than Orange balls?", "lEquations": ["X=824-687"], "lSolutions": [137]},
	{"iIndex": 432, "sQuestion": "Sarah was given 400 Golden balls, 892 Red balls, 978 White balls, and 555 Brown balls. How many more Golden balls are there than Brown balls?", "lEquations": ["X=400-555"], "lSolutions": [-155]},
	{"iIndex": 433, "sQuestion": "Sarah was given 430 Azure balls, 602 White balls, 590 Blue balls, and 499 Yellow balls. How many more White balls are there than Azure balls?", "lEquations": ["X=602-430"], "lSolutions": [172]},
	{"iIndex": 434, "sQuestion": "Sarah was given 671 Magenta balls, 184 Golden balls, 800 Azure balls, and 967 Pink balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=184-967"], "lSolutions": [-783]},
	{"iIndex": 435, "sQuestion": "Sarah was given 430 Magenta balls, and 695 Golden balls. How many more Golden balls are there than Magenta balls?", "lEquations": ["X=695-430"], "lSolutions": [265]},
	{"iIndex": 436, "sQuestion": "Sarah was given 185 Magenta balls, 634 White balls, 259 Green balls, and 775 Black balls. How many more Black balls are there than Green balls?", "lEquations": ["X=775-259"], "lSolutions": [516]},
	{"iIndex": 437, "sQuestion": "Sarah was given 56 Green balls, and 489 Magenta balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=56-489"], "lSolutions": [-433]},
	{"iIndex": 438, "sQuestion": "Sarah was given 409 Red balls, 565 White balls, and 11 Golden balls. How many more Golden balls are there than White balls?", "lEquations": ["X=11-565"], "lSolutions": [-554]},
	{"iIndex": 439, "sQuestion": "Sarah was given 349 Orange balls, and 100 Azure balls. How many more Azure balls are there than Orange balls?", "lEquations": ["X=100-349"], "lSolutions": [-249]},
	{"iIndex": 440, "sQuestion": "Sarah was given 719 Black balls, 697 Red balls, and 592 Magenta balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=592-697"], "lSolutions": [-105]},
	{"iIndex": 441, "sQuestion": "Sarah was given 699 Blue balls, and 19 Azure balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=699-19"], "lSolutions": [680]},
	{"iIndex": 442, "sQuestion": "Sarah was given 406 White balls, 669 Orange balls, and 425 Magenta balls. How many more White balls are there than Magenta balls?", "lEquations": ["X=406-425"], "lSolutions": [-19]},
	{"iIndex": 443, "sQuestion": "Sarah was given 197 Violet balls, 520 Yellow balls, 611 Pink balls, 262 Golden balls, and 841 Green balls. How many more Golden balls are there than Yellow balls?", "lEquations": ["X=262-520"], "lSolutions": [-258]},
	{"iIndex": 444, "sQuestion": "Sarah was given 730 Gray balls, 648 Green balls, 273 Orange balls, and 371 Red balls. How many more Orange balls are there than Green balls?", "lEquations": ["X=273-648"], "lSolutions": [-375]},
	{"iIndex": 445, "sQuestion": "Sarah was given 108 Violet balls, 224 Golden balls, and 283 White balls. How many more Violet balls are there than White balls?", "lEquations": ["X=108-283"], "lSolutions": [-175]},
	{"iIndex": 446, "sQuestion": "Sarah was given 624 Blue balls, 225 Red balls, 398 Golden balls, and 269 White balls. How many more Golden balls are there than Red balls?", "lEquations": ["X=398-225"], "lSolutions": [173]},
	{"iIndex": 447, "sQuestion": "Sarah was given 158 Azure balls, 737 White balls, 509 Magenta balls, and 962 Pink balls. How many more Pink balls are there than Magenta balls?", "lEquations": ["X=962-509"], "lSolutions": [453]},
	{"iIndex": 448, "sQuestion": "Sarah was given 633 Azure balls, 203 Magenta balls, 294 Pink balls, and 937 Yellow balls. How many more Pink balls are there than Yellow balls?", "lEquations": ["X=294-937"], "lSolutions": [-643]},
	{"iIndex": 449, "sQuestion": "Sarah was given 145 Magenta balls, 400 Gray balls, and 63 Yellow balls. How many more Magenta balls are there than Gray balls?", "lEquations": ["X=145-400"], "lSolutions": [-255]},
	{"iIndex": 450, "sQuestion": "Sarah was given 214 Magenta balls, and 465 Brown balls. How many more Brown balls are there than Magenta balls?", "lEquations": ["X=465-214"], "lSolutions": [251]},
	{"iIndex": 451, "sQuestion": "Sarah was given 695 Yellow balls, 630 Pink balls, 508 White balls, and 804 Orange balls. How many more Orange balls are there than White balls?", "lEquations": ["X=804-508"], "lSolutions": [296]},
	{"iIndex": 452, "sQuestion": "Sarah was given 401 Magenta balls, 297 Blue balls, 911 Orange balls, 99 Azure balls, and 83 Pink balls. How many more Blue balls are there than Orange balls?", "lEquations": ["X=297-911"], "lSolutions": [-614]},
	{"iIndex": 453, "sQuestion": "Sarah was given 860 Gray balls, 895 Azure balls, 386 Orange balls, and 54 Black balls. How many more Black balls are there than Azure balls?", "lEquations": ["X=54-895"], "lSolutions": [-841]},
	{"iIndex": 454, "sQuestion": "Sarah was given 705 Blue balls, and 490 Pink balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=490-705"], "lSolutions": [-215]},
	{"iIndex": 455, "sQuestion": "Sarah was given 710 Blue balls, 356 Gray balls, and 331 Black balls. How many more Black balls are there than Gray balls?", "lEquations": ["X=331-356"], "lSolutions": [-25]},
	{"iIndex": 456, "sQuestion": "Sarah was given 577 Azure balls, 984 Golden balls, and 189 Brown balls. How many more Azure balls are there than Brown balls?", "lEquations": ["X=577-189"], "lSolutions": [388]},
	{"iIndex": 457, "sQuestion": "Sarah was given 135 Golden balls, 123 Blue balls, and 281 Magenta balls. How many more Magenta balls are there than Golden balls?", "lEquations": ["X=281-135"], "lSolutions": [146]},
	{"iIndex": 458, "sQuestion": "Sarah was given 852 Yellow balls, and 853 Green balls. How many more Yellow balls are there than Green balls?", "lEquations": ["X=852-853"], "lSolutions": [-1]},
	{"iIndex": 459, "sQuestion": "Sarah was given 161 Red balls, 604 Black balls, and 429 Orange balls. How many more Black balls are there than Red balls?", "lEquations": ["X=604-161"], "lSolutions": [443]},
	{"iIndex": 460, "sQuestion": "Sarah was given 165 Blue balls, and 617 Magenta balls. How many more Magenta balls are there than Blue balls?", "lEquations": ["X=617-165"], "lSolutions": [452]},
	{"iIndex": 461, "sQuestion": "Sarah was given 66 Violet balls, 823 Pink balls, 511 Brown balls, 249 Red balls, and 209 Gray balls. How many more Violet balls are there than Pink balls?", "lEquations": ["X=66-823"], "lSolutions": [-757]},
	{"iIndex": 462, "sQuestion": "Sarah was given 983 Blue balls, 151 Gray balls, and 562 Orange balls. How many more Gray balls are there than Blue balls?", "lEquations": ["X=151-983"], "lSolutions": [-832]},
	{"iIndex": 463, "sQuestion": "Sarah was given 184 Black balls, 673 Yellow balls, 581 Violet balls, and 481 Green balls. How many more Green balls are there than Yellow balls?", "lEquations": ["X=481-673"], "lSolutions": [-192]},
	{"iIndex": 464, "sQuestion": "Sarah was given 815 Violet balls, 906 Gray balls, and 446 Black balls. How many more Black balls are there than Gray balls?", "lEquations": ["X=446-906"], "lSolutions": [-460]},
	{"iIndex": 465, "sQuestion": "Sarah was given 974 Blue balls, 402 Brown balls, 341 Golden balls, and 686 Violet balls. How many more Brown balls are there than Blue balls?", "lEquations": ["X=402-974"], "lSolutions": [-572]},
	{"iIndex": 466, "sQuestion": "Sarah was given 634 Yellow balls, and 475 Pink balls. How many more Yellow balls are there than Pink balls?", "lEquations": ["X=634-475"], "lSolutions": [159]},
	{"iIndex": 467, "sQuestion": "Sarah was given 560 Yellow balls, 489 Red balls, 549 Brown balls, and 289 Blue balls. How many more Red balls are there than Brown balls?", "lEquations": ["X=489-549"], "lSolutions": [-60]},
	{"iIndex": 468, "sQuestion": "Sarah was given 91 Pink balls, and 672 Golden balls. How many more Pink balls are there than Golden balls?", "lEquations": ["X=91-672"], "lSolutions": [-581]},
	{"iIndex": 469, "sQuestion": "Sarah was given 505 Golden balls, 735 Pink balls, and 64 Green balls. How many more Pink balls are there than Golden balls?", "lEquations": ["X=735-505"], "lSolutions": [230]},
	{"iIndex": 470, "sQuestion": "Sarah was given 307 Green balls, and 637 Orange balls. How many more Green balls are there than Orange balls?", "lEquations": ["X=307-637"], "lSolutions": [-330]},
	{"iIndex": 471, "sQuestion": "Sarah was given 334 Magenta balls, and 430 Brown balls. How many more Magenta balls are there than Brown balls?", "lEquations": ["X=334-430"], "lSolutions": [-96]},
	{"iIndex": 472, "sQuestion": "Sarah was given 508 Pink balls, 950 White balls, and 497 Violet balls. How many more White balls are there than Violet balls?", "lEquations": ["X=950-497"], "lSolutions": [453]},
	{"iIndex": 473, "sQuestion": "Sarah was given 531 White balls, 9 Golden balls, 574 Gray balls, 643 Azure balls, and 45 Blue balls. How many more Golden balls are there than Gray balls?", "lEquations": ["X=9-574"], "lSolutions": [-565]},
	{"iIndex": 474, "sQuestion": "Sarah was given 450 Pink balls, and 862 Red balls. How many more Pink balls are there than Red balls?", "lEquations": ["X=450-862"], "lSolutions": [-412]},
	{"iIndex": 475, "sQuestion": "Sarah was given 392 Red balls, 709 Green balls, and 96 Violet balls. How many more Violet balls are there than Red balls?", "lEquations": ["X=96-392"], "lSolutions": [-296]},
	{"iIndex": 476, "sQuestion": "Sarah was given 859 Orange balls, and 496 Azure balls. How many more Azure balls are there than Orange balls?", "lEquations": ["X=496-859"], "lSolutions": [-363]},
	{"iIndex": 477, "sQuestion": "Sarah was given 226 Violet balls, and 987 Azure balls. How many more Azure balls are there than Violet balls?", "lEquations": ["X=987-226"], "lSolutions": [761]},
	{"iIndex": 478, "sQuestion": "Sarah was given 347 Blue balls, 658 Violet balls, and 713 Golden balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=658-713"], "lSolutions": [-55]},
	{"iIndex": 479, "sQuestion": "Sarah was given 127 Magenta balls, 993 Blue balls, and 789 Green balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=789-127"], "lSolutions": [662]},
	{"iIndex": 480, "sQuestion": "Sarah was given 92 Gray balls, and 813 Yellow balls. How many more Gray balls are there than Yellow balls?", "lEquations": ["X=92-813"], "lSolutions": [-721]},
	{"iIndex": 481, "sQuestion": "Sarah was given 144 Azure balls, and 839 Orange balls. How many more Azure balls are there than Orange balls?", "lEquations": ["X=144-839"], "lSolutions": [-695]},
	{"iIndex": 482, "sQuestion": "Sarah was given 475 Brown balls, 862 Orange balls, 823 Blue balls, and 88 Azure balls. How many more Azure balls are there than Blue balls?", "lEquations": ["X=88-823"], "lSolutions": [-735]},
	{"iIndex": 483, "sQuestion": "Sarah was given 599 Green balls, and 365 Blue balls. How many more Blue balls are there than Green balls?", "lEquations": ["X=365-599"], "lSolutions": [-234]},
	{"iIndex": 484, "sQuestion": "Sarah was given 863 Brown balls, and 778 Magenta balls. How many more Magenta balls are there than Brown balls?", "lEquations": ["X=778-863"], "lSolutions": [-85]},
	{"iIndex": 485, "sQuestion": "Sarah was given 934 Orange balls, 341 Golden balls, 217 Blue balls, and 991 Yellow balls. How many more Orange balls are there than Golden balls?", "lEquations": ["X=934-341"], "lSolutions": [593]},
	{"iIndex": 486, "sQuestion": "Sarah was given 608 Yellow balls, 539 Orange balls, 925 White balls, 912 Green balls, and 279 Magenta balls. How many more Yellow balls are there than Orange balls?", "lEquations": ["X=608-539"], "lSolutions": [69]},
	{"iIndex": 487, "sQuestion": "Sarah was given 424 Red balls, and 356 Magenta balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=356-424"], "lSolutions": [-68]},
	{"iIndex": 488, "sQuestion": "Sarah was given 255 Black balls, 235 Green balls, 531 Orange balls, 598 Azure balls, and 447 Magenta balls. How many more Magenta balls are there than Orange balls?", "lEquations": ["X=447-531"], "lSolutions": [-84]},
	{"iIndex": 489, "sQuestion": "Sarah was given 156 White balls, and 800 Magenta balls. How many more Magenta balls are there than White balls?", "lEquations": ["X=800-156"], "lSolutions": [644]},
	{"iIndex": 490, "sQuestion": "Sarah was given 571 Black balls, 660 Gray balls, 892 Pink balls, and 564 Blue balls. How many more Gray balls are there than Blue balls?", "lEquations": ["X=660-564"], "lSolutions": [96]},
	{"iIndex": 491, "sQuestion": "Sarah was given 199 Gray balls, 133 Orange balls, and 141 Yellow balls. How many more Yellow balls are there than Gray balls?", "lEquations": ["X=141-199"], "lSolutions": [-58]},
	{"iIndex": 492, "sQuestion": "Sarah was given 285 Magenta balls, 280 White balls, and 361 Gray balls. How many more Magenta balls are there than Gray balls?", "lEquations": ["X=285-361"], "lSolutions": [-76]},
	{"iIndex": 493, "sQuestion": "Sarah was given 468 Black balls, and 965 Magenta balls. How many more Magenta balls are there than Black balls?", "lEquations": ["X=965-468"], "lSolutions": [497]},
	{"iIndex": 494, "sQuestion": "Sarah was given 906 Azure balls, 487 Magenta balls, 191 Yellow balls, 998 Brown balls, and 276 Green balls. How many more Azure balls are there than Yellow balls?", "lEquations": ["X=906-191"], "lSolutions": [715]},
	{"iIndex": 495, "sQuestion": "Sarah was given 512 Orange balls, 62 Pink balls, and 803 White balls. How many more Orange balls are there than White balls?", "lEquations": ["X=512-803"], "lSolutions": [-291]},
	{"iIndex": 496, "sQuestion": "Sarah was given 729 White balls, 402 Magenta balls, 825 Golden balls, 753 Blue balls, and 632 Red balls. How many more Blue balls are there than Magenta balls?", "lEquations": ["X=753-402"], "lSolutions": [351]},
	{"iIndex": 497, "sQuestion": "Sarah was given 907 Red balls, 925 Orange balls, 940 Blue balls, and 339 Black balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=940-907"], "lSolutions": [33]},
	{"iIndex": 498, "sQuestion": "Sarah was given 237 Magenta balls, and 210 Violet balls. How many more Violet balls are there than Magenta balls?", "lEquations": ["X=210-237"], "lSolutions": [-27]},
	{"iIndex": 499, "sQuestion": "Sarah was given 190 Gray balls, 704 Yellow balls, 896 Red balls, 948 Black balls, and 506 Pink balls. How many more Pink balls are there than Gray balls?", "lEquations": ["X=506-190"], "lSolutions": [316]},
	{"iIndex": 500, "sQuestion": "Sarah was given 337 Azure balls, 402 Blue balls, 860 Black balls, 378 Golden balls, and 596 Green balls. How many more Black balls are there than Golden balls?", "lEquations": ["X=860-378"], "lSolutions": [482]},
	{"iIndex": 501, "sQuestion": "Sarah was given 356 Blue balls, and 540 Azure balls. How many more Azure balls are there than Blue balls?", "lEquations": ["X=540-356"], "lSolutions": [184]},
	{"iIndex": 502, "sQuestion": "Sarah was given 685 Yellow balls, 975 White balls, 695 Blue balls, 144 Green balls, and 197 Azure balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=695-197"], "lSolutions": [498]},
	{"iIndex": 503, "sQuestion": "Sarah was given 594 Red balls, and 318 Pink balls. How many more Red balls are there than Pink balls?", "lEquations": ["X=594-318"], "lSolutions": [276]},
	{"iIndex": 504, "sQuestion": "Sarah was given 656 Red balls, and 572 Orange balls. How many more Orange balls are there than Red balls?", "lEquations": ["X=572-656"], "lSolutions": [-84]},
	{"iIndex": 505, "sQuestion": "Sarah was given 992 Azure balls, 369 White balls, 516 Red balls, 299 Brown balls, and 763 Magenta balls. How many more Brown balls are there than Azure balls?", "lEquations": ["X=299-992"], "lSolutions": [-693]},
	{"iIndex": 506, "sQuestion": "Sarah was given 439 Red balls, 499 Golden balls, 65 Orange balls, 605 Violet balls, and 741 Blue balls. How many more Orange balls are there than Blue balls?", "lEquations": ["X=65-741"], "lSolutions": [-676]},
	{"iIndex": 507, "sQuestion": "Sarah was given 195 White balls, 20 Orange balls, and 356 Blue balls. How many more White balls are there than Blue balls?", "lEquations": ["X=195-356"], "lSolutions": [-161]},
	{"iIndex": 508, "sQuestion": "Sarah was given 1 Violet balls, 225 Azure balls, 967 Red balls, 523 Magenta balls, and 546 Blue balls. How many more Violet balls are there than Azure balls?", "lEquations": ["X=1-225"], "lSolutions": [-224]},
	{"iIndex": 509, "sQuestion": "Sarah was given 146 Magenta balls, and 558 White balls. How many more White balls are there than Magenta balls?", "lEquations": ["X=558-146"], "lSolutions": [412]},
	{"iIndex": 510, "sQuestion": "Sarah was given 262 Yellow balls, 900 Orange balls, 996 Red balls, and 423 Black balls. How many more Red balls are there than Yellow balls?", "lEquations": ["X=996-262"], "lSolutions": [734]},
	{"iIndex": 511, "sQuestion": "Sarah was given 470 Pink balls, and 39 Golden balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=39-470"], "lSolutions": [-431]},
	{"iIndex": 512, "sQuestion": "Sarah was given 435 Orange balls, and 76 Black balls. How many more Orange balls are there than Black balls?", "lEquations": ["X=435-76"], "lSolutions": [359]},
	{"iIndex": 513, "sQuestion": "Sarah was given 220 Blue balls, and 931 Yellow balls. How many more Yellow balls are there than Blue balls?", "lEquations": ["X=931-220"], "lSolutions": [711]},
	{"iIndex": 514, "sQuestion": "Sarah was given 740 Azure balls, 637 Black balls, 461 Orange balls, 210 White balls, and 738 Green balls. How many more Orange balls are there than White balls?", "lEquations": ["X=461-210"], "lSolutions": [251]},
	{"iIndex": 515, "sQuestion": "Sarah was given 385 Golden balls, 865 Gray balls, and 873 Azure balls. How many more Azure balls are there than Gray balls?", "lEquations": ["X=873-865"], "lSolutions": [8]},
	{"iIndex": 516, "sQuestion": "Sarah was given 300 Blue balls, 275 Brown balls, and 486 White balls. How many more Brown balls are there than Blue balls?", "lEquations": ["X=275-300"], "lSolutions": [-25]},
	{"iIndex": 517, "sQuestion": "Sarah was given 458 Blue balls, and 398 Orange balls. How many more Blue balls are there than Orange balls?", "lEquations": ["X=458-398"], "lSolutions": [60]},
	{"iIndex": 518, "sQuestion": "Sarah was given 181 Orange balls, and 780 Pink balls. How many more Pink balls are there than Orange balls?", "lEquations": ["X=780-181"], "lSolutions": [599]},
	{"iIndex": 519, "sQuestion": "Sarah was given 164 Violet balls, and 47 Orange balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=164-47"], "lSolutions": [117]},
	{"iIndex": 520, "sQuestion": "Sarah was given 725 Green balls, 463 Brown balls, 445 Red balls, and 685 White balls. How many more Red balls are there than White balls?", "lEquations": ["X=445-685"], "lSolutions": [-240]},
	{"iIndex": 521, "sQuestion": "Sarah was given 209 Pink balls, 685 Blue balls, 473 Magenta balls, and 592 Green balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=592-473"], "lSolutions": [119]},
	{"iIndex": 522, "sQuestion": "Sarah was given 459 Green balls, 933 Pink balls, 699 Brown balls, 694 Black balls, and 916 Yellow balls. How many more Brown balls are there than Yellow balls?", "lEquations": ["X=699-916"], "lSolutions": [-217]},
	{"iIndex": 523, "sQuestion": "Sarah was given 159 Violet balls, 161 Yellow balls, and 261 Blue balls. How many more Blue balls are there than Violet balls?", "lEquations": ["X=261-159"], "lSolutions": [102]},
	{"iIndex": 524, "sQuestion": "Sarah was given 140 Pink balls, 74 White balls, 87 Golden balls, 170 Azure balls, and 480 Blue balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=480-170"], "lSolutions": [310]},
	{"iIndex": 525, "sQuestion": "Sarah was given 275 Green balls, 9 Gray balls, and 291 Azure balls. How many more Green balls are there than Azure balls?", "lEquations": ["X=275-291"], "lSolutions": [-16]},
	{"iIndex": 526, "sQuestion": "Sarah was given 63 Green balls, 679 Orange balls, 764 Golden balls, 699 Azure balls, and 153 Violet balls. How many more Green balls are there than Orange balls?", "lEquations": ["X=63-679"], "lSolutions": [-616]},
	{"iIndex": 527, "sQuestion": "Sarah was given 663 Pink balls, 326 Azure balls, 315 Black balls, 37 White balls, and 314 Yellow balls. How many more White balls are there than Pink balls?", "lEquations": ["X=37-663"], "lSolutions": [-626]},
	{"iIndex": 528, "sQuestion": "Sarah was given 270 Green balls, 984 Violet balls, 768 Golden balls, and 281 Blue balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=984-768"], "lSolutions": [216]},
	{"iIndex": 529, "sQuestion": "Sarah was given 37 Violet balls, 132 Pink balls, 995 Black balls, and 135 Orange balls. How many more Orange balls are there than Black balls?", "lEquations": ["X=135-995"], "lSolutions": [-860]},
	{"iIndex": 530, "sQuestion": "Sarah was given 300 Pink balls, 28 Magenta balls, 773 Brown balls, and 992 Red balls. How many more Brown balls are there than Pink balls?", "lEquations": ["X=773-300"], "lSolutions": [473]},
	{"iIndex": 531, "sQuestion": "Sarah was given 847 Azure balls, and 476 Violet balls. How many more Azure balls are there than Violet balls?", "lEquations": ["X=847-476"], "lSolutions": [371]},
	{"iIndex": 532, "sQuestion": "Sarah was given 589 Black balls, and 584 Pink balls. How many more Black balls are there than Pink balls?", "lEquations": ["X=589-584"], "lSolutions": [5]},
	{"iIndex": 533, "sQuestion": "Sarah was given 220 Brown balls, and 363 Pink balls. How many more Brown balls are there than Pink balls?", "lEquations": ["X=220-363"], "lSolutions": [-143]},
	{"iIndex": 534, "sQuestion": "Sarah was given 131 Pink balls, 484 Violet balls, 483 Yellow balls, 257 Blue balls, and 443 White balls. How many more White balls are there than Pink balls?", "lEquations": ["X=443-131"], "lSolutions": [312]},
	{"iIndex": 535, "sQuestion": "Sarah was given 54 Brown balls, 921 Violet balls, 911 Green balls, 434 Magenta balls, and 158 Black balls. How many more Green balls are there than Violet balls?", "lEquations": ["X=911-921"], "lSolutions": [-10]},
	{"iIndex": 536, "sQuestion": "Sarah was given 114 Brown balls, and 607 Yellow balls. How many more Yellow balls are there than Brown balls?", "lEquations": ["X=607-114"], "lSolutions": [493]},
	{"iIndex": 537, "sQuestion": "Sarah was given 893 Gray balls, 165 Yellow balls, and 339 Red balls. How many more Gray balls are there than Red balls?", "lEquations": ["X=893-339"], "lSolutions": [554]},
	{"iIndex": 538, "sQuestion": "Sarah was given 579 Violet balls, 473 Gray balls, 834 Black balls, and 513 Brown balls. How many more Brown balls are there than Black balls?", "lEquations": ["X=513-834"], "lSolutions": [-321]},
	{"iIndex": 539, "sQuestion": "Sarah was given 180 Magenta balls, 316 Red balls, 182 Pink balls, 668 Golden balls, and 655 White balls. How many more Red balls are there than Golden balls?", "lEquations": ["X=316-668"], "lSolutions": [-352]},
	{"iIndex": 540, "sQuestion": "Sarah was given 562 Black balls, 399 Brown balls, and 404 Violet balls. How many more Violet balls are there than Brown balls?", "lEquations": ["X=404-399"], "lSolutions": [5]},
	{"iIndex": 541, "sQuestion": "Sarah was given 388 Brown balls, 37 Green balls, 977 Red balls, 956 Golden balls, and 281 Blue balls. How many more Blue balls are there than Green balls?", "lEquations": ["X=281-37"], "lSolutions": [244]},
	{"iIndex": 542, "sQuestion": "Sarah was given 690 Blue balls, 64 Red balls, 356 Azure balls, 726 Brown balls, and 232 Golden balls. How many more Red balls are there than Azure balls?", "lEquations": ["X=64-356"], "lSolutions": [-292]},
	{"iIndex": 543, "sQuestion": "Sarah was given 913 Yellow balls, 743 Red balls, 900 Magenta balls, 67 Gray balls, and 677 Golden balls. How many more Golden balls are there than Gray balls?", "lEquations": ["X=677-67"], "lSolutions": [610]},
	{"iIndex": 544, "sQuestion": "Sarah was given 877 Black balls, and 31 White balls. How many more Black balls are there than White balls?", "lEquations": ["X=877-31"], "lSolutions": [846]},
	{"iIndex": 545, "sQuestion": "Sarah was given 442 Blue balls, and 346 Pink balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=346-442"], "lSolutions": [-96]},
	{"iIndex": 546, "sQuestion": "Sarah was given 119 Azure balls, 433 Black balls, and 462 Yellow balls. How many more Black balls are there than Yellow balls?", "lEquations": ["X=433-462"], "lSolutions": [-29]},
	{"iIndex": 547, "sQuestion": "Sarah was given 58 White balls, and 152 Golden balls. How many more Golden balls are there than White balls?", "lEquations": ["X=152-58"], "lSolutions": [94]},
	{"iIndex": 548, "sQuestion": "Sarah was given 925 Black balls, 165 Pink balls, and 467 Golden balls. How many more Golden balls are there than Black balls?", "lEquations": ["X=467-925"], "lSolutions": [-458]},
	{"iIndex": 549, "sQuestion": "Sarah was given 675 Orange balls, 318 Magenta balls, 808 Gray balls, and 158 Green balls. How many more Green balls are there than Orange balls?", "lEquations": ["X=158-675"], "lSolutions": [-517]},
	{"iIndex": 550, "sQuestion": "Sarah was given 783 Green balls, and 25 Red balls. How many more Red balls are there than Green balls?", "lEquations": ["X=25-783"], "lSolutions": [-758]},
	{"iIndex": 551, "sQuestion": "Sarah was given 263 Green balls, 804 Black balls, and 670 Blue balls. How many more Blue balls are there than Black balls?", "lEquations": ["X=670-804"], "lSolutions": [-134]},
	{"iIndex": 552, "sQuestion": "Sarah was given 659 Blue balls, 864 Black balls, 242 Red balls, 162 Green balls, and 787 White balls. How many more Black balls are there than White balls?", "lEquations": ["X=864-787"], "lSolutions": [77]},
	{"iIndex": 553, "sQuestion": "Sarah was given 375 Black balls, 668 White balls, 653 Pink balls, 175 Blue balls, and 277 Gray balls. How many more Black balls are there than Pink balls?", "lEquations": ["X=375-653"], "lSolutions": [-278]},
	{"iIndex": 554, "sQuestion": "Sarah was given 305 Azure balls, 559 Pink balls, and 139 Magenta balls. How many more Pink balls are there than Azure balls?", "lEquations": ["X=559-305"], "lSolutions": [254]},
	{"iIndex": 555, "sQuestion": "Sarah was given 536 Pink balls, 103 Violet balls, 791 Black balls, and 783 Green balls. How many more Violet balls are there than Green balls?", "lEquations": ["X=103-783"], "lSolutions": [-680]},
	{"iIndex": 556, "sQuestion": "Sarah was given 489 Golden balls, 989 Magenta balls, 658 Black balls, 8 White balls, and 898 Azure balls. How many more Black balls are there than White balls?", "lEquations": ["X=658-8"], "lSolutions": [650]},
	{"iIndex": 557, "sQuestion": "Sarah was given 562 Yellow balls, 880 Red balls, 960 Blue balls, 205 Brown balls, and 532 Pink balls. How many more Pink balls are there than Red balls?", "lEquations": ["X=532-880"], "lSolutions": [-348]},
	{"iIndex": 558, "sQuestion": "Sarah was given 735 Azure balls, 374 Orange balls, and 504 Blue balls. How many more Azure balls are there than Orange balls?", "lEquations": ["X=735-374"], "lSolutions": [361]},
	{"iIndex": 559, "sQuestion": "Sarah was given 218 Orange balls, and 443 White balls. How many more White balls are there than Orange balls?", "lEquations": ["X=443-218"], "lSolutions": [225]},
	{"iIndex": 560, "sQuestion": "Sarah was given 847 Golden balls, 954 Green balls, and 531 Red balls. How many more Red balls are there than Golden balls?", "lEquations": ["X=531-847"], "lSolutions": [-316]},
	{"iIndex": 561, "sQuestion": "Sarah was given 891 Pink balls, 756 Blue balls, 658 Yellow balls, 229 Black balls, and 204 White balls. How many more Black balls are there than Blue balls?", "lEquations": ["X=229-756"], "lSolutions": [-527]},
	{"iIndex": 562, "sQuestion": "Sarah was given 384 Pink balls, 1000 Green balls, 929 Golden balls, and 239 Magenta balls. How many more Pink balls are there than Green balls?", "lEquations": ["X=384-1000"], "lSolutions": [-616]},
	{"iIndex": 563, "sQuestion": "Sarah was given 718 Green balls, 118 Red balls, 903 Magenta balls, and 16 Golden balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=903-118"], "lSolutions": [785]},
	{"iIndex": 564, "sQuestion": "Sarah was given 995 Pink balls, 232 Brown balls, 614 Magenta balls, 360 Golden balls, and 64 Black balls. How many more Pink balls are there than Brown balls?", "lEquations": ["X=995-232"], "lSolutions": [763]},
	{"iIndex": 565, "sQuestion": "Sarah was given 765 Blue balls, 388 Azure balls, and 411 Red balls. How many more Red balls are there than Azure balls?", "lEquations": ["X=411-388"], "lSolutions": [23]},
	{"iIndex": 566, "sQuestion": "Sarah was given 561 White balls, and 467 Pink balls. How many more Pink balls are there than White balls?", "lEquations": ["X=467-561"], "lSolutions": [-94]},
	{"iIndex": 567, "sQuestion": "Sarah was given 981 Azure balls, and 280 Green balls. How many more Azure balls are there than Green balls?", "lEquations": ["X=981-280"], "lSolutions": [701]},
	{"iIndex": 568, "sQuestion": "Sarah was given 722 White balls, 439 Brown balls, 756 Yellow balls, and 467 Pink balls. How many more Brown balls are there than White balls?", "lEquations": ["X=439-722"], "lSolutions": [-283]},
	{"iIndex": 569, "sQuestion": "Sarah was given 628 Green balls, 172 Blue balls, 431 Yellow balls, 432 Orange balls, and 580 Black balls. How many more Yellow balls are there than Black balls?", "lEquations": ["X=431-580"], "lSolutions": [-149]},
	{"iIndex": 570, "sQuestion": "Sarah was given 720 Black balls, 985 Green balls, and 287 Blue balls. How many more Blue balls are there than Black balls?", "lEquations": ["X=287-720"], "lSolutions": [-433]},
	{"iIndex": 571, "sQuestion": "Sarah was given 523 Pink balls, 142 Azure balls, 146 White balls, 422 Red balls, and 38 Green balls. How many more Red balls are there than Green balls?", "lEquations": ["X=422-38"], "lSolutions": [384]},
	{"iIndex": 572, "sQuestion": "Sarah was given 109 Pink balls, 706 Violet balls, 830 Orange balls, 751 White balls, and 302 Azure balls. How many more White balls are there than Pink balls?", "lEquations": ["X=751-109"], "lSolutions": [642]},
	{"iIndex": 573, "sQuestion": "Sarah was given 616 Magenta balls, 64 Pink balls, 299 Azure balls, 266 White balls, and 334 Green balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=334-616"], "lSolutions": [-282]},
	{"iIndex": 574, "sQuestion": "Sarah was given 324 Violet balls, 760 White balls, and 100 Blue balls. How many more Violet balls are there than White balls?", "lEquations": ["X=324-760"], "lSolutions": [-436]},
	{"iIndex": 575, "sQuestion": "Sarah was given 933 Violet balls, 997 Magenta balls, 534 Red balls, 65 Black balls, and 437 Brown balls. How many more Red balls are there than Magenta balls?", "lEquations": ["X=534-997"], "lSolutions": [-463]},
	{"iIndex": 576, "sQuestion": "Sarah was given 511 Azure balls, 998 Gray balls, 569 Yellow balls, 80 Golden balls, and 543 Green balls. How many more Gray balls are there than Azure balls?", "lEquations": ["X=998-511"], "lSolutions": [487]},
	{"iIndex": 577, "sQuestion": "Sarah was given 610 Blue balls, and 881 Gray balls. How many more Gray balls are there than Blue balls?", "lEquations": ["X=881-610"], "lSolutions": [271]},
	{"iIndex": 578, "sQuestion": "Sarah was given 778 Orange balls, 47 Red balls, and 77 Azure balls. How many more Red balls are there than Azure balls?", "lEquations": ["X=47-77"], "lSolutions": [-30]},
	{"iIndex": 579, "sQuestion": "Sarah was given 379 Golden balls, 955 Green balls, 318 Orange balls, and 417 Yellow balls. How many more Yellow balls are there than Orange balls?", "lEquations": ["X=417-318"], "lSolutions": [99]},
	{"iIndex": 580, "sQuestion": "Sarah was given 819 Gray balls, 136 Orange balls, 718 Azure balls, and 490 Red balls. How many more Azure balls are there than Red balls?", "lEquations": ["X=718-490"], "lSolutions": [228]},
	{"iIndex": 581, "sQuestion": "Sarah was given 506 Gray balls, 353 White balls, 507 Green balls, 135 Violet balls, and 458 Magenta balls. How many more White balls are there than Violet balls?", "lEquations": ["X=353-135"], "lSolutions": [218]},
	{"iIndex": 582, "sQuestion": "Sarah was given 72 Blue balls, 700 Yellow balls, and 567 Magenta balls. How many more Magenta balls are there than Yellow balls?", "lEquations": ["X=567-700"], "lSolutions": [-133]},
	{"iIndex": 583, "sQuestion": "Sarah was given 420 Magenta balls, 312 Azure balls, and 277 Golden balls. How many more Magenta balls are there than Golden balls?", "lEquations": ["X=420-277"], "lSolutions": [143]},
	{"iIndex": 584, "sQuestion": "Sarah was given 492 Pink balls, and 367 Golden balls. How many more Pink balls are there than Golden balls?", "lEquations": ["X=492-367"], "lSolutions": [125]},
	{"iIndex": 585, "sQuestion": "Sarah was given 438 Orange balls, 260 Azure balls, 500 Brown balls, 543 Pink balls, and 154 White balls. How many more Brown balls are there than Azure balls?", "lEquations": ["X=500-260"], "lSolutions": [240]},
	{"iIndex": 586, "sQuestion": "Sarah was given 114 Orange balls, 804 Azure balls, and 909 Black balls. How many more Azure balls are there than Orange balls?", "lEquations": ["X=804-114"], "lSolutions": [690]},
	{"iIndex": 587, "sQuestion": "Sarah was given 944 Golden balls, 539 Violet balls, 159 Magenta balls, 964 Brown balls, and 506 Pink balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=539-944"], "lSolutions": [-405]},
	{"iIndex": 588, "sQuestion": "Sarah was given 660 Orange balls, 759 Azure balls, and 265 Yellow balls. How many more Azure balls are there than Orange balls?", "lEquations": ["X=759-660"], "lSolutions": [99]},
	{"iIndex": 589, "sQuestion": "Sarah was given 415 Black balls, 832 Blue balls, 299 White balls, 253 Gray balls, and 308 Yellow balls. How many more Gray balls are there than White balls?", "lEquations": ["X=253-299"], "lSolutions": [-46]},
	{"iIndex": 590, "sQuestion": "Sarah was given 124 Yellow balls, 692 Pink balls, 381 Golden balls, 35 Orange balls, and 842 Green balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=381-692"], "lSolutions": [-311]},
	{"iIndex": 591, "sQuestion": "Sarah was given 751 Gray balls, and 265 Pink balls. How many more Gray balls are there than Pink balls?", "lEquations": ["X=751-265"], "lSolutions": [486]},
	{"iIndex": 592, "sQuestion": "Sarah was given 560 Black balls, 287 Azure balls, 382 Brown balls, and 148 Green balls. How many more Green balls are there than Black balls?", "lEquations": ["X=148-560"], "lSolutions": [-412]},
	{"iIndex": 593, "sQuestion": "Sarah was given 942 Azure balls, and 321 Brown balls. How many more Azure balls are there than Brown balls?", "lEquations": ["X=942-321"], "lSolutions": [621]},
	{"iIndex": 594, "sQuestion": "Sarah was given 497 Red balls, 887 Yellow balls, and 176 Blue balls. How many more Yellow balls are there than Red balls?", "lEquations": ["X=887-497"], "lSolutions": [390]},
	{"iIndex": 595, "sQuestion": "Sarah was given 813 Gray balls, 283 White balls, and 688 Brown balls. How many more Brown balls are there than White balls?", "lEquations": ["X=688-283"], "lSolutions": [405]},
	{"iIndex": 596, "sQuestion": "Sarah was given 353 Brown balls, 964 Yellow balls, 57 Azure balls, 333 Black balls, and 107 Blue balls. How many more Black balls are there than Blue balls?", "lEquations": ["X=333-107"], "lSolutions": [226]},
	{"iIndex": 597, "sQuestion": "Sarah was given 275 Yellow balls, 509 Red balls, 906 Blue balls, 499 Black balls, and 480 Magenta balls. How many more Blue balls are there than Black balls?", "lEquations": ["X=906-499"], "lSolutions": [407]},
	{"iIndex": 598, "sQuestion": "Sarah was given 287 Brown balls, and 746 Gray balls. How many more Brown balls are there than Gray balls?", "lEquations": ["X=287-746"], "lSolutions": [-459]},
	{"iIndex": 599, "sQuestion": "Sarah was given 936 Orange balls, and 928 Red balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=928-936"], "lSolutions": [-8]},
	{"iIndex": 600, "sQuestion": "Sarah was given 574 Orange balls, 696 Violet balls, 633 Blue balls, 116 Red balls, and 958 White balls. How many more Orange balls are there than Blue balls?", "lEquations": ["X=574-633"], "lSolutions": [-59]},
	{"iIndex": 601, "sQuestion": "Sarah was given 573 Golden balls, and 659 Gray balls. How many more Gray balls are there than Golden balls?", "lEquations": ["X=659-573"], "lSolutions": [86]},
	{"iIndex": 602, "sQuestion": "Sarah was given 798 Pink balls, 447 Golden balls, 956 Brown balls, 452 Green balls, and 408 Orange balls. How many more Orange balls are there than Golden balls?", "lEquations": ["X=408-447"], "lSolutions": [-39]},
	{"iIndex": 603, "sQuestion": "Sarah was given 341 Gray balls, 285 Brown balls, 642 Azure balls, 851 Pink balls, and 145 Black balls. How many more Azure balls are there than Gray balls?", "lEquations": ["X=642-341"], "lSolutions": [301]},
	{"iIndex": 604, "sQuestion": "Sarah was given 750 Magenta balls, and 675 Red balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=750-675"], "lSolutions": [75]},
	{"iIndex": 605, "sQuestion": "Sarah was given 634 White balls, 18 Red balls, 442 Azure balls, and 563 Brown balls. How many more Brown balls are there than White balls?", "lEquations": ["X=563-634"], "lSolutions": [-71]},
	{"iIndex": 606, "sQuestion": "Sarah was given 498 White balls, 665 Red balls, 400 Blue balls, 967 Pink balls, and 322 Violet balls. How many more Red balls are there than Blue balls?", "lEquations": ["X=665-400"], "lSolutions": [265]},
	{"iIndex": 607, "sQuestion": "Sarah was given 568 Gray balls, 145 Pink balls, and 778 Red balls. How many more Gray balls are there than Red balls?", "lEquations": ["X=568-778"], "lSolutions": [-210]},
	{"iIndex": 608, "sQuestion": "Sarah was given 948 Orange balls, 32 Pink balls, and 853 Blue balls. How many more Orange balls are there than Pink balls?", "lEquations": ["X=948-32"], "lSolutions": [916]},
	{"iIndex": 609, "sQuestion": "Sarah was given 544 Magenta balls, 1 Yellow balls, 431 Brown balls, 917 Golden balls, and 245 Azure balls. How many more Golden balls are there than Brown balls?", "lEquations": ["X=917-431"], "lSolutions": [486]},
	{"iIndex": 610, "sQuestion": "Sarah was given 874 Magenta balls, and 332 Violet balls. How many more Magenta balls are there than Violet balls?", "lEquations": ["X=874-332"], "lSolutions": [542]},
	{"iIndex": 611, "sQuestion": "Sarah was given 888 Red balls, 781 Violet balls, 561 Brown balls, and 377 Gray balls. How many more Brown balls are there than Red balls?", "lEquations": ["X=561-888"], "lSolutions": [-327]},
	{"iIndex": 612, "sQuestion": "Sarah was given 415 Orange balls, and 453 Yellow balls. How many more Yellow balls are there than Orange balls?", "lEquations": ["X=453-415"], "lSolutions": [38]},
	{"iIndex": 613, "sQuestion": "Sarah was given 870 Pink balls, and 331 Brown balls. How many more Pink balls are there than Brown balls?", "lEquations": ["X=870-331"], "lSolutions": [539]},
	{"iIndex": 614, "sQuestion": "Sarah was given 710 Orange balls, and 487 Red balls. How many more Orange balls are there than Red balls?", "lEquations": ["X=710-487"], "lSolutions": [223]},
	{"iIndex": 615, "sQuestion": "Sarah was given 286 Red balls, and 775 Golden balls. How many more Golden balls are there than Red balls?", "lEquations": ["X=775-286"], "lSolutions": [489]},
	{"iIndex": 616, "sQuestion": "Sarah was given 455 White balls, 557 Green balls, and 568 Golden balls. How many more Green balls are there than Golden balls?", "lEquations": ["X=557-568"], "lSolutions": [-11]},
	{"iIndex": 617, "sQuestion": "Sarah was given 482 Pink balls, 153 Blue balls, 204 White balls, and 202 Green balls. How many more Blue balls are there than White balls?", "lEquations": ["X=153-204"], "lSolutions": [-51]},
	{"iIndex": 618, "sQuestion": "Sarah was given 402 Green balls, and 643 Red balls. How many more Red balls are there than Green balls?", "lEquations": ["X=643-402"], "lSolutions": [241]},
	{"iIndex": 619, "sQuestion": "Sarah was given 366 Azure balls, 619 Golden balls, 366 Black balls, 237 Pink balls, and 3 Magenta balls. How many more Magenta balls are there than Golden balls?", "lEquations": ["X=3-619"], "lSolutions": [-616]},
	{"iIndex": 620, "sQuestion": "Sarah was given 352 Gray balls, 257 Red balls, 855 Green balls, 4 Azure balls, and 897 Yellow balls. How many more Red balls are there than Green balls?", "lEquations": ["X=257-855"], "lSolutions": [-598]},
	{"iIndex": 621, "sQuestion": "Sarah was given 471 Golden balls, 292 White balls, and 228 Pink balls. How many more Pink balls are there than Golden balls?", "lEquations": ["X=228-471"], "lSolutions": [-243]},
	{"iIndex": 622, "sQuestion": "Sarah was given 874 Gray balls, and 208 Red balls. How many more Gray balls are there than Red balls?", "lEquations": ["X=874-208"], "lSolutions": [666]},
	{"iIndex": 623, "sQuestion": "Sarah was given 54 Red balls, 458 Brown balls, and 634 Yellow balls. How many more Yellow balls are there than Brown balls?", "lEquations": ["X=634-458"], "lSolutions": [176]},
	{"iIndex": 624, "sQuestion": "Sarah was given 250 Gray balls, 117 Red balls, 464 Violet balls, and 956 White balls. How many more White balls are there than Red balls?", "lEquations": ["X=956-117"], "lSolutions": [839]},
	{"iIndex": 625, "sQuestion": "Sarah was given 155 Black balls, 273 Golden balls, 656 Green balls, and 430 Pink balls. How many more Green balls are there than Black balls?", "lEquations": ["X=656-155"], "lSolutions": [501]},
	{"iIndex": 626, "sQuestion": "Sarah was given 514 White balls, and 189 Yellow balls. How many more White balls are there than Yellow balls?", "lEquations": ["X=514-189"], "lSolutions": [325]},
	{"iIndex": 627, "sQuestion": "Sarah was given 32 White balls, 743 Green balls, and 299 Blue balls. How many more Green balls are there than Blue balls?", "lEquations": ["X=743-299"], "lSolutions": [444]},
	{"iIndex": 628, "sQuestion": "Sarah was given 360 Yellow balls, 736 Gray balls, 767 Black balls, 92 Blue balls, and 805 Red balls. How many more Black balls are there than Gray balls?", "lEquations": ["X=767-736"], "lSolutions": [31]},
	{"iIndex": 629, "sQuestion": "Sarah was given 630 Blue balls, 602 Brown balls, 888 Azure balls, and 81 Yellow balls. How many more Brown balls are there than Blue balls?", "lEquations": ["X=602-630"], "lSolutions": [-28]},
	{"iIndex": 630, "sQuestion": "Sarah was given 536 Black balls, 379 Orange balls, and 84 Green balls. How many more Black balls are there than Green balls?", "lEquations": ["X=536-84"], "lSolutions": [452]},
	{"iIndex": 631, "sQuestion": "Sarah was given 905 Blue balls, 936 Violet balls, 645 Green balls, and 318 Magenta balls. How many more Blue balls are there than Violet balls?", "lEquations": ["X=905-936"], "lSolutions": [-31]},
	{"iIndex": 632, "sQuestion": "Sarah was given 82 Blue balls, 445 Brown balls, 75 Red balls, 391 Magenta balls, and 158 Pink balls. How many more Pink balls are there than Brown balls?", "lEquations": ["X=158-445"], "lSolutions": [-287]},
	{"iIndex": 633, "sQuestion": "Sarah was given 588 Green balls, 912 Gray balls, 491 Violet balls, and 880 Orange balls. How many more Orange balls are there than Green balls?", "lEquations": ["X=880-588"], "lSolutions": [292]},
	{"iIndex": 634, "sQuestion": "Sarah was given 466 Golden balls, and 494 Yellow balls. How many more Yellow balls are there than Golden balls?", "lEquations": ["X=494-466"], "lSolutions": [28]},
	{"iIndex": 635, "sQuestion": "Sarah was given 976 Red balls, 653 Golden balls, 201 Green balls, and 907 Yellow balls. How many more Red balls are there than Yellow balls?", "lEquations": ["X=976-907"], "lSolutions": [69]},
	{"iIndex": 636, "sQuestion": "Sarah was given 136 Yellow balls, 209 Magenta balls, 951 Black balls, and 383 Golden balls. How many more Golden balls are there than Black balls?", "lEquations": ["X=383-951"], "lSolutions": [-568]},
	{"iIndex": 637, "sQuestion": "Sarah was given 470 White balls, and 138 Orange balls. How many more Orange balls are there than White balls?", "lEquations": ["X=138-470"], "lSolutions": [-332]},
	{"iIndex": 638, "sQuestion": "Sarah was given 996 Green balls, 326 Gray balls, 229 Red balls, and 350 Black balls. How many more Red balls are there than Gray balls?", "lEquations": ["X=229-326"], "lSolutions": [-97]},
	{"iIndex": 639, "sQuestion": "Sarah was given 217 Pink balls, and 431 Azure balls. How many more Pink balls are there than Azure balls?", "lEquations": ["X=217-431"], "lSolutions": [-214]},
	{"iIndex": 640, "sQuestion": "Sarah was given 404 Azure balls, and 355 Red balls. How many more Red balls are there than Azure balls?", "lEquations": ["X=355-404"], "lSolutions": [-49]},
	{"iIndex": 641, "sQuestion": "Sarah was given 536 Magenta balls, and 237 Golden balls. How many more Magenta balls are there than Golden balls?", "lEquations": ["X=536-237"], "lSolutions": [299]},
	{"iIndex": 642, "sQuestion": "Sarah was given 571 Azure balls, 993 Magenta balls, 894 Orange balls, 10 Yellow balls, and 542 Green balls. How many more Green balls are there than Orange balls?", "lEquations": ["X=542-894"], "lSolutions": [-352]},
	{"iIndex": 643, "sQuestion": "Sarah was given 535 Azure balls, and 403 Orange balls. How many more Azure balls are there than Orange balls?", "lEquations": ["X=535-403"], "lSolutions": [132]},
	{"iIndex": 644, "sQuestion": "Sarah was given 724 Azure balls, and 490 Black balls. How many more Black balls are there than Azure balls?", "lEquations": ["X=490-724"], "lSolutions": [-234]},
	{"iIndex": 645, "sQuestion": "Sarah was given 626 Black balls, 696 Gray balls, 676 Blue balls, 849 Yellow balls, and 875 Azure balls. How many more Blue balls are there than Gray balls?", "lEquations": ["X=676-696"], "lSolutions": [-20]},
	{"iIndex": 646, "sQuestion": "Sarah was given 640 Red balls, 745 Magenta balls, 48 Blue balls, 253 Golden balls, and 193 Azure balls. How many more Azure balls are there than Magenta balls?", "lEquations": ["X=193-745"], "lSolutions": [-552]},
	{"iIndex": 647, "sQuestion": "Sarah was given 431 Red balls, 54 Black balls, 952 Magenta balls, and 526 Blue balls. How many more Magenta balls are there than Blue balls?", "lEquations": ["X=952-526"], "lSolutions": [426]},
	{"iIndex": 648, "sQuestion": "Sarah was given 74 Yellow balls, 231 Magenta balls, and 930 Azure balls. How many more Magenta balls are there than Yellow balls?", "lEquations": ["X=231-74"], "lSolutions": [157]},
	{"iIndex": 649, "sQuestion": "Sarah was given 528 Golden balls, 820 Yellow balls, 978 Black balls, and 429 Brown balls. How many more Brown balls are there than Black balls?", "lEquations": ["X=429-978"], "lSolutions": [-549]},
	{"iIndex": 650, "sQuestion": "Sarah was given 153 Brown balls, and 270 Golden balls. How many more Brown balls are there than Golden balls?", "lEquations": ["X=153-270"], "lSolutions": [-117]},
	{"iIndex": 651, "sQuestion": "Sarah was given 824 Blue balls, 340 Pink balls, 452 Yellow balls, 533 Orange balls, and 771 Brown balls. How many more Blue balls are there than Pink balls?", "lEquations": ["X=824-340"], "lSolutions": [484]},
	{"iIndex": 652, "sQuestion": "Sarah was given 231 Magenta balls, 280 Orange balls, and 374 Black balls. How many more Magenta balls are there than Black balls?", "lEquations": ["X=231-374"], "lSolutions": [-143]},
	{"iIndex": 653, "sQuestion": "Sarah was given 716 Brown balls, 40 Yellow balls, and 720 Pink balls. How many more Pink balls are there than Brown balls?", "lEquations": ["X=720-716"], "lSolutions": [4]},
	{"iIndex": 654, "sQuestion": "Sarah was given 419 Violet balls, 310 Yellow balls, 522 Golden balls, 267 Pink balls, and 470 Gray balls. How many more Violet balls are there than Gray balls?", "lEquations": ["X=419-470"], "lSolutions": [-51]},
	{"iIndex": 655, "sQuestion": "Sarah was given 438 Orange balls, 571 Green balls, 600 Magenta balls, and 815 Blue balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=571-600"], "lSolutions": [-29]},
	{"iIndex": 656, "sQuestion": "Sarah was given 519 Azure balls, and 869 Golden balls. How many more Golden balls are there than Azure balls?", "lEquations": ["X=869-519"], "lSolutions": [350]},
	{"iIndex": 657, "sQuestion": "Sarah was given 995 Blue balls, 368 Orange balls, 867 Brown balls, 583 Black balls, and 769 Violet balls. How many more Violet balls are there than Blue balls?", "lEquations": ["X=769-995"], "lSolutions": [-226]},
	{"iIndex": 658, "sQuestion": "Sarah was given 251 Black balls, and 881 Yellow balls. How many more Yellow balls are there than Black balls?", "lEquations": ["X=881-251"], "lSolutions": [630]},
	{"iIndex": 659, "sQuestion": "Sarah was given 88 White balls, 703 Brown balls, and 483 Red balls. How many more White balls are there than Brown balls?", "lEquations": ["X=88-703"], "lSolutions": [-615]},
	{"iIndex": 660, "sQuestion": "Sarah was given 491 Orange balls, 302 Brown balls, and 12 Azure balls. How many more Azure balls are there than Brown balls?", "lEquations": ["X=12-302"], "lSolutions": [-290]},
	{"iIndex": 661, "sQuestion": "Sarah was given 875 Gray balls, and 642 Black balls. How many more Black balls are there than Gray balls?", "lEquations": ["X=642-875"], "lSolutions": [-233]},
	{"iIndex": 662, "sQuestion": "Sarah was given 877 Violet balls, 23 Golden balls, and 770 Red balls. How many more Golden balls are there than Violet balls?", "lEquations": ["X=23-877"], "lSolutions": [-854]},
	{"iIndex": 663, "sQuestion": "Sarah was given 569 Yellow balls, 824 Golden balls, and 846 Azure balls. How many more Yellow balls are there than Azure balls?", "lEquations": ["X=569-846"], "lSolutions": [-277]},
	{"iIndex": 664, "sQuestion": "Sarah was given 66 Green balls, 390 Yellow balls, 931 Blue balls, 779 Azure balls, and 917 Brown balls. How many more Blue balls are there than Green balls?", "lEquations": ["X=931-66"], "lSolutions": [865]},
	{"iIndex": 665, "sQuestion": "Sarah was given 837 Green balls, and 226 Orange balls. How many more Orange balls are there than Green balls?", "lEquations": ["X=226-837"], "lSolutions": [-611]},
	{"iIndex": 666, "sQuestion": "Sarah was given 65 Black balls, 430 Golden balls, 881 Gray balls, 871 Pink balls, and 540 Blue balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=871-540"], "lSolutions": [331]},
	{"iIndex": 667, "sQuestion": "Sarah was given 506 Violet balls, 497 Magenta balls, 638 White balls, and 377 Red balls. How many more Magenta balls are there than Violet balls?", "lEquations": ["X=497-506"], "lSolutions": [-9]},
	{"iIndex": 668, "sQuestion": "Sarah was given 15 Green balls, 509 Violet balls, and 641 Magenta balls. How many more Magenta balls are there than Violet balls?", "lEquations": ["X=641-509"], "lSolutions": [132]},
	{"iIndex": 669, "sQuestion": "Sarah was given 453 Red balls, 280 Yellow balls, and 855 Azure balls. How many more Azure balls are there than Yellow balls?", "lEquations": ["X=855-280"], "lSolutions": [575]},
	{"iIndex": 670, "sQuestion": "Sarah was given 633 Orange balls, 590 Azure balls, 86 Magenta balls, and 23 Golden balls. How many more Azure balls are there than Magenta balls?", "lEquations": ["X=590-86"], "lSolutions": [504]},
	{"iIndex": 671, "sQuestion": "Sarah was given 878 Violet balls, 662 Magenta balls, 340 Black balls, 246 White balls, and 744 Blue balls. How many more Magenta balls are there than Blue balls?", "lEquations": ["X=662-744"], "lSolutions": [-82]},
	{"iIndex": 672, "sQuestion": "Sarah was given 63 Violet balls, 308 Black balls, and 653 Red balls. How many more Black balls are there than Red balls?", "lEquations": ["X=308-653"], "lSolutions": [-345]},
	{"iIndex": 673, "sQuestion": "Sarah was given 211 Pink balls, 2 Yellow balls, 628 Azure balls, and 596 Magenta balls. How many more Magenta balls are there than Yellow balls?", "lEquations": ["X=596-2"], "lSolutions": [594]},
	{"iIndex": 674, "sQuestion": "Sarah was given 18 Azure balls, 272 White balls, and 375 Red balls. How many more Azure balls are there than White balls?", "lEquations": ["X=18-272"], "lSolutions": [-254]},
	{"iIndex": 675, "sQuestion": "Sarah was given 914 Magenta balls, 678 Blue balls, and 601 Azure balls. How many more Magenta balls are there than Blue balls?", "lEquations": ["X=914-678"], "lSolutions": [236]},
	{"iIndex": 676, "sQuestion": "Sarah was given 213 White balls, 103 Red balls, 59 Gray balls, 299 Pink balls, and 151 Golden balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=151-299"], "lSolutions": [-148]},
	{"iIndex": 677, "sQuestion": "Sarah was given 173 Red balls, 168 Gray balls, 915 Magenta balls, and 525 Golden balls. How many more Gray balls are there than Golden balls?", "lEquations": ["X=168-525"], "lSolutions": [-357]},
	{"iIndex": 678, "sQuestion": "Sarah was given 809 Brown balls, and 800 Red balls. How many more Red balls are there than Brown balls?", "lEquations": ["X=800-809"], "lSolutions": [-9]},
	{"iIndex": 679, "sQuestion": "Sarah was given 667 Orange balls, and 223 Blue balls. How many more Blue balls are there than Orange balls?", "lEquations": ["X=223-667"], "lSolutions": [-444]},
	{"iIndex": 680, "sQuestion": "Sarah was given 864 Pink balls, 802 Orange balls, 910 Green balls, 502 Blue balls, and 901 Yellow balls. How many more Blue balls are there than Orange balls?", "lEquations": ["X=502-802"], "lSolutions": [-300]},
	{"iIndex": 681, "sQuestion": "Sarah was given 239 Violet balls, 228 Golden balls, 553 Magenta balls, 159 Yellow balls, and 434 White balls. How many more Violet balls are there than White balls?", "lEquations": ["X=239-434"], "lSolutions": [-195]},
	{"iIndex": 682, "sQuestion": "Sarah was given 953 Magenta balls, and 437 Azure balls. How many more Azure balls are there than Magenta balls?", "lEquations": ["X=437-953"], "lSolutions": [-516]},
	{"iIndex": 683, "sQuestion": "Sarah was given 559 White balls, 718 Azure balls, and 217 Blue balls. How many more Azure balls are there than Blue balls?", "lEquations": ["X=718-217"], "lSolutions": [501]},
	{"iIndex": 684, "sQuestion": "Sarah was given 652 Magenta balls, 961 Yellow balls, 695 Golden balls, 781 Black balls, and 302 Azure balls. How many more Azure balls are there than Golden balls?", "lEquations": ["X=302-695"], "lSolutions": [-393]},
	{"iIndex": 685, "sQuestion": "Sarah was given 815 Pink balls, 556 Red balls, 253 Azure balls, and 979 Golden balls. How many more Red balls are there than Pink balls?", "lEquations": ["X=556-815"], "lSolutions": [-259]},
	{"iIndex": 686, "sQuestion": "Sarah was given 431 Black balls, 759 Green balls, and 229 Golden balls. How many more Green balls are there than Golden balls?", "lEquations": ["X=759-229"], "lSolutions": [530]},
	{"iIndex": 687, "sQuestion": "Sarah was given 412 Pink balls, 945 White balls, 476 Azure balls, and 427 Yellow balls. How many more White balls are there than Pink balls?", "lEquations": ["X=945-412"], "lSolutions": [533]},
	{"iIndex": 688, "sQuestion": "Sarah was given 896 Blue balls, 675 Red balls, 894 Yellow balls, and 763 Golden balls. How many more Yellow balls are there than Golden balls?", "lEquations": ["X=894-763"], "lSolutions": [131]},
	{"iIndex": 689, "sQuestion": "Sarah was given 465 Golden balls, 404 Green balls, 984 Yellow balls, 763 Orange balls, and 338 Blue balls. How many more Golden balls are there than Blue balls?", "lEquations": ["X=465-338"], "lSolutions": [127]},
	{"iIndex": 690, "sQuestion": "Sarah was given 676 Magenta balls, 641 Golden balls, and 140 Black balls. How many more Magenta balls are there than Golden balls?", "lEquations": ["X=676-641"], "lSolutions": [35]},
	{"iIndex": 691, "sQuestion": "Sarah was given 458 Orange balls, 773 Violet balls, and 409 Pink balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=773-458"], "lSolutions": [315]},
	{"iIndex": 692, "sQuestion": "Sarah was given 966 Yellow balls, 396 Pink balls, 216 Red balls, 410 Black balls, and 630 Blue balls. How many more Blue balls are there than Yellow balls?", "lEquations": ["X=630-966"], "lSolutions": [-336]},
	{"iIndex": 693, "sQuestion": "Sarah was given 940 Blue balls, 115 Black balls, 396 Red balls, 790 Magenta balls, and 530 Azure balls. How many more Azure balls are there than Black balls?", "lEquations": ["X=530-115"], "lSolutions": [415]},
	{"iIndex": 694, "sQuestion": "Sarah was given 773 Magenta balls, 6 Brown balls, 929 Violet balls, 362 Black balls, and 977 Red balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=773-977"], "lSolutions": [-204]},
	{"iIndex": 695, "sQuestion": "Sarah was given 871 Red balls, 745 Magenta balls, 194 Brown balls, 618 Azure balls, and 63 Blue balls. How many more Brown balls are there than Magenta balls?", "lEquations": ["X=194-745"], "lSolutions": [-551]},
	{"iIndex": 696, "sQuestion": "Sarah was given 518 Green balls, 761 Orange balls, 870 Red balls, 541 Violet balls, and 428 Brown balls. How many more Green balls are there than Orange balls?", "lEquations": ["X=518-761"], "lSolutions": [-243]},
	{"iIndex": 697, "sQuestion": "Sarah was given 429 White balls, 711 Pink balls, and 74 Green balls. How many more White balls are there than Green balls?", "lEquations": ["X=429-74"], "lSolutions": [355]},
	{"iIndex": 698, "sQuestion": "Sarah was given 523 Azure balls, and 919 Green balls. How many more Azure balls are there than Green balls?", "lEquations": ["X=523-919"], "lSolutions": [-396]},
	{"iIndex": 699, "sQuestion": "Sarah was given 240 Red balls, 814 Green balls, and 826 Violet balls. How many more Violet balls are there than Green balls?", "lEquations": ["X=826-814"], "lSolutions": [12]},
	{"iIndex": 700, "sQuestion": "Sarah was given 211 Gray balls, 621 Blue balls, 386 Violet balls, 336 Orange balls, and 994 White balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=386-336"], "lSolutions": [50]},
	{"iIndex": 701, "sQuestion": "Sarah was given 91 Golden balls, and 162 Azure balls. How many more Azure balls are there than Golden balls?", "lEquations": ["X=162-91"], "lSolutions": [71]},
	{"iIndex": 702, "sQuestion": "Sarah was given 494 Green balls, 473 Red balls, 365 White balls, and 354 Orange balls. How many more White balls are there than Red balls?", "lEquations": ["X=365-473"], "lSolutions": [-108]},
	{"iIndex": 703, "sQuestion": "Sarah was given 685 Blue balls, 65 Azure balls, and 971 Magenta balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=685-65"], "lSolutions": [620]},
	{"iIndex": 704, "sQuestion": "Sarah was given 454 Violet balls, 997 Brown balls, 17 Yellow balls, and 504 Golden balls. How many more Golden balls are there than Brown balls?", "lEquations": ["X=504-997"], "lSolutions": [-493]},
	{"iIndex": 705, "sQuestion": "Sarah was given 293 Azure balls, and 575 Red balls. How many more Red balls are there than Azure balls?", "lEquations": ["X=575-293"], "lSolutions": [282]},
	{"iIndex": 706, "sQuestion": "Sarah was given 496 Magenta balls, 903 Orange balls, 349 White balls, 372 Blue balls, and 456 Golden balls. How many more White balls are there than Magenta balls?", "lEquations": ["X=349-496"], "lSolutions": [-147]},
	{"iIndex": 707, "sQuestion": "Sarah was given 162 Violet balls, and 140 Yellow balls. How many more Violet balls are there than Yellow balls?", "lEquations": ["X=162-140"], "lSolutions": [22]},
	{"iIndex": 708, "sQuestion": "Sarah was given 44 Blue balls, 846 Pink balls, 36 Gray balls, 15 Golden balls, and 958 Orange balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=15-846"], "lSolutions": [-831]},
	{"iIndex": 709, "sQuestion": "Sarah was given 109 Red balls, 211 Black balls, 440 Blue balls, 944 Green balls, and 681 White balls. How many more Blue balls are there than Green balls?", "lEquations": ["X=440-944"], "lSolutions": [-504]},
	{"iIndex": 710, "sQuestion": "Sarah was given 478 Magenta balls, 143 Green balls, 288 Black balls, and 321 Golden balls. How many more Black balls are there than Magenta balls?", "lEquations": ["X=288-478"], "lSolutions": [-190]},
	{"iIndex": 711, "sQuestion": "Sarah was given 741 Blue balls, 983 Green balls, 861 Brown balls, and 544 Violet balls. How many more Green balls are there than Blue balls?", "lEquations": ["X=983-741"], "lSolutions": [242]},
	{"iIndex": 712, "sQuestion": "Sarah was given 259 Brown balls, 44 Black balls, 144 Azure balls, and 710 Yellow balls. How many more Azure balls are there than Yellow balls?", "lEquations": ["X=144-710"], "lSolutions": [-566]},
	{"iIndex": 713, "sQuestion": "Sarah was given 480 Pink balls, 861 Magenta balls, and 335 White balls. How many more Pink balls are there than White balls?", "lEquations": ["X=480-335"], "lSolutions": [145]},
	{"iIndex": 714, "sQuestion": "Sarah was given 637 Pink balls, 437 Brown balls, and 560 Red balls. How many more Brown balls are there than Pink balls?", "lEquations": ["X=437-637"], "lSolutions": [-200]},
	{"iIndex": 715, "sQuestion": "Sarah was given 997 Magenta balls, 885 Black balls, 167 Gray balls, and 604 Brown balls. How many more Brown balls are there than Black balls?", "lEquations": ["X=604-885"], "lSolutions": [-281]},
	{"iIndex": 716, "sQuestion": "Sarah was given 717 White balls, and 547 Violet balls. How many more Violet balls are there than White balls?", "lEquations": ["X=547-717"], "lSolutions": [-170]},
	{"iIndex": 717, "sQuestion": "Sarah was given 309 White balls, 424 Violet balls, and 827 Magenta balls. How many more Magenta balls are there than Violet balls?", "lEquations": ["X=827-424"], "lSolutions": [403]},
	{"iIndex": 718, "sQuestion": "Sarah was given 185 Gray balls, 438 Yellow balls, 228 Violet balls, and 509 White balls. How many more Violet balls are there than Yellow balls?", "lEquations": ["X=228-438"], "lSolutions": [-210]},
	{"iIndex": 719, "sQuestion": "Sarah was given 867 Gray balls, and 300 Green balls. How many more Gray balls are there than Green balls?", "lEquations": ["X=867-300"], "lSolutions": [567]},
	{"iIndex": 720, "sQuestion": "Sarah was given 690 Brown balls, 602 Orange balls, 544 Pink balls, 932 Red balls, and 561 Black balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=602-690"], "lSolutions": [-88]},
	{"iIndex": 721, "sQuestion": "Sarah was given 232 Green balls, 607 Black balls, 672 Violet balls, and 174 Gray balls. How many more Black balls are there than Gray balls?", "lEquations": ["X=607-174"], "lSolutions": [433]},
	{"iIndex": 722, "sQuestion": "Sarah was given 961 Golden balls, 797 Orange balls, 477 Blue balls, and 683 Gray balls. How many more Orange balls are there than Golden balls?", "lEquations": ["X=797-961"], "lSolutions": [-164]},
	{"iIndex": 723, "sQuestion": "Sarah was given 804 White balls, 371 Black balls, and 922 Azure balls. How many more Black balls are there than White balls?", "lEquations": ["X=371-804"], "lSolutions": [-433]},
	{"iIndex": 724, "sQuestion": "Sarah was given 33 White balls, 252 Pink balls, and 64 Azure balls. How many more Pink balls are there than White balls?", "lEquations": ["X=252-33"], "lSolutions": [219]},
	{"iIndex": 725, "sQuestion": "Sarah was given 137 Yellow balls, 876 Violet balls, 390 Pink balls, and 536 Gray balls. How many more Yellow balls are there than Pink balls?", "lEquations": ["X=137-390"], "lSolutions": [-253]},
	{"iIndex": 726, "sQuestion": "Sarah was given 576 Golden balls, 82 White balls, 444 Brown balls, 869 Blue balls, and 616 Azure balls. How many more Azure balls are there than Blue balls?", "lEquations": ["X=616-869"], "lSolutions": [-253]},
	{"iIndex": 727, "sQuestion": "Sarah was given 301 Yellow balls, and 238 Violet balls. How many more Violet balls are there than Yellow balls?", "lEquations": ["X=238-301"], "lSolutions": [-63]},
	{"iIndex": 728, "sQuestion": "Sarah was given 439 Azure balls, and 602 Gray balls. How many more Azure balls are there than Gray balls?", "lEquations": ["X=439-602"], "lSolutions": [-163]},
	{"iIndex": 729, "sQuestion": "Sarah was given 322 Red balls, 773 Brown balls, and 791 Azure balls. How many more Red balls are there than Brown balls?", "lEquations": ["X=322-773"], "lSolutions": [-451]},
	{"iIndex": 730, "sQuestion": "Sarah was given 770 Yellow balls, 393 Orange balls, 135 Black balls, and 733 Magenta balls. How many more Yellow balls are there than Orange balls?", "lEquations": ["X=770-393"], "lSolutions": [377]},
	{"iIndex": 731, "sQuestion": "Sarah was given 271 Orange balls, and 341 Green balls. How many more Orange balls are there than Green balls?", "lEquations": ["X=271-341"], "lSolutions": [-70]},
	{"iIndex": 732, "sQuestion": "Sarah was given 204 Magenta balls, 419 Red balls, and 382 Brown balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=204-419"], "lSolutions": [-215]},
	{"iIndex": 733, "sQuestion": "Sarah was given 183 Brown balls, 752 White balls, and 970 Gray balls. How many more Gray balls are there than Brown balls?", "lEquations": ["X=970-183"], "lSolutions": [787]},
	{"iIndex": 734, "sQuestion": "Sarah was given 425 Orange balls, and 676 Red balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=676-425"], "lSolutions": [251]},
	{"iIndex": 735, "sQuestion": "Sarah was given 987 Black balls, and 538 Gray balls. How many more Gray balls are there than Black balls?", "lEquations": ["X=538-987"], "lSolutions": [-449]},
	{"iIndex": 736, "sQuestion": "Sarah was given 799 Black balls, 46 Pink balls, 244 Green balls, and 119 Blue balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=46-119"], "lSolutions": [-73]},
	{"iIndex": 737, "sQuestion": "Sarah was given 576 Golden balls, 658 Red balls, 212 Pink balls, 500 Gray balls, and 896 Blue balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=896-658"], "lSolutions": [238]},
	{"iIndex": 738, "sQuestion": "Sarah was given 368 Azure balls, and 688 Brown balls. How many more Azure balls are there than Brown balls?", "lEquations": ["X=368-688"], "lSolutions": [-320]},
	{"iIndex": 739, "sQuestion": "Sarah was given 178 Magenta balls, 519 White balls, 624 Blue balls, 481 Gray balls, and 70 Green balls. How many more Blue balls are there than Magenta balls?", "lEquations": ["X=624-178"], "lSolutions": [446]},
	{"iIndex": 740, "sQuestion": "Sarah was given 870 Orange balls, 691 Magenta balls, 133 Violet balls, and 558 Green balls. How many more Orange balls are there than Violet balls?", "lEquations": ["X=870-133"], "lSolutions": [737]},
	{"iIndex": 741, "sQuestion": "Sarah was given 943 Red balls, and 717 Violet balls. How many more Red balls are there than Violet balls?", "lEquations": ["X=943-717"], "lSolutions": [226]},
	{"iIndex": 742, "sQuestion": "Sarah was given 471 White balls, 466 Golden balls, 581 Pink balls, 939 Violet balls, and 689 Black balls. How many more White balls are there than Pink balls?", "lEquations": ["X=471-581"], "lSolutions": [-110]},
	{"iIndex": 743, "sQuestion": "Sarah was given 182 Brown balls, 776 Black balls, 588 Yellow balls, and 5 Red balls. How many more Red balls are there than Black balls?", "lEquations": ["X=5-776"], "lSolutions": [-771]},
	{"iIndex": 744, "sQuestion": "Sarah was given 357 Red balls, 537 Brown balls, and 879 Black balls. How many more Black balls are there than Brown balls?", "lEquations": ["X=879-537"], "lSolutions": [342]},
	{"iIndex": 745, "sQuestion": "Sarah was given 638 Orange balls, and 554 Pink balls. How many more Orange balls are there than Pink balls?", "lEquations": ["X=638-554"], "lSolutions": [84]},
	{"iIndex": 746, "sQuestion": "Sarah was given 923 Green balls, and 960 Black balls. How many more Green balls are there than Black balls?", "lEquations": ["X=923-960"], "lSolutions": [-37]},
	{"iIndex": 747, "sQuestion": "Sarah was given 519 Gray balls, 450 Orange balls, 805 Green balls, 805 Brown balls, and 933 Magenta balls. How many more Magenta balls are there than Brown balls?", "lEquations": ["X=933-805"], "lSolutions": [128]},
	{"iIndex": 748, "sQuestion": "Sarah was given 80 Green balls, 848 Gray balls, and 684 Pink balls. How many more Gray balls are there than Green balls?", "lEquations": ["X=848-80"], "lSolutions": [768]},
	{"iIndex": 749, "sQuestion": "Sarah was given 841 Orange balls, 791 Red balls, 748 Brown balls, 880 Gray balls, and 735 Golden balls. How many more Brown balls are there than Orange balls?", "lEquations": ["X=748-841"], "lSolutions": [-93]},
	{"iIndex": 750, "sQuestion": "Sarah was given 75 Azure balls, 412 Blue balls, 691 Violet balls, and 130 Gray balls. How many more Violet balls are there than Azure balls?", "lEquations": ["X=691-75"], "lSolutions": [616]},
	{"iIndex": 751, "sQuestion": "Sarah was given 940 Magenta balls, 265 Blue balls, 391 Yellow balls, and 107 Black balls. How many more Blue balls are there than Black balls?", "lEquations": ["X=265-107"], "lSolutions": [158]},
	{"iIndex": 752, "sQuestion": "Sarah was given 523 Brown balls, 597 Azure balls, 480 Magenta balls, and 999 Black balls. How many more Brown balls are there than Black balls?", "lEquations": ["X=523-999"], "lSolutions": [-476]},
	{"iIndex": 753, "sQuestion": "Sarah was given 790 Azure balls, 267 Gray balls, and 632 Golden balls. How many more Golden balls are there than Azure balls?", "lEquations": ["X=632-790"], "lSolutions": [-158]},
	{"iIndex": 754, "sQuestion": "Sarah was given 19 Pink balls, 985 Azure balls, and 659 White balls. How many more Pink balls are there than Azure balls?", "lEquations": ["X=19-985"], "lSolutions": [-966]},
	{"iIndex": 755, "sQuestion": "Sarah was given 839 Yellow balls, and 457 Violet balls. How many more Violet balls are there than Yellow balls?", "lEquations": ["X=457-839"], "lSolutions": [-382]},
	{"iIndex": 756, "sQuestion": "Sarah was given 220 Orange balls, 678 Brown balls, and 205 Gray balls. How many more Brown balls are there than Gray balls?", "lEquations": ["X=678-205"], "lSolutions": [473]},
	{"iIndex": 757, "sQuestion": "Sarah was given 637 Green balls, 623 Red balls, 561 Golden balls, 73 Black balls, and 542 Magenta balls. How many more Magenta balls are there than Black balls?", "lEquations": ["X=542-73"], "lSolutions": [469]},
	{"iIndex": 758, "sQuestion": "Sarah was given 559 Black balls, 171 Brown balls, and 116 Violet balls. How many more Violet balls are there than Brown balls?", "lEquations": ["X=116-171"], "lSolutions": [-55]},
	{"iIndex": 759, "sQuestion": "Sarah was given 462 Gray balls, 235 Blue balls, 115 Violet balls, 864 Black balls, and 784 Magenta balls. How many more Gray balls are there than Black balls?", "lEquations": ["X=462-864"], "lSolutions": [-402]},
	{"iIndex": 760, "sQuestion": "Sarah was given 21 Gray balls, 342 Violet balls, 619 Green balls, and 825 Pink balls. How many more Pink balls are there than Violet balls?", "lEquations": ["X=825-342"], "lSolutions": [483]},
	{"iIndex": 761, "sQuestion": "Sarah was given 488 Red balls, 906 Violet balls, 263 Gray balls, 420 Brown balls, and 757 Black balls. How many more Black balls are there than Red balls?", "lEquations": ["X=757-488"], "lSolutions": [269]},
	{"iIndex": 762, "sQuestion": "Sarah was given 859 Azure balls, and 274 Black balls. How many more Black balls are there than Azure balls?", "lEquations": ["X=274-859"], "lSolutions": [-585]},
	{"iIndex": 763, "sQuestion": "Sarah was given 77 Violet balls, and 402 Yellow balls. How many more Yellow balls are there than Violet balls?", "lEquations": ["X=402-77"], "lSolutions": [325]},
	{"iIndex": 764, "sQuestion": "Sarah was given 16 White balls, 731 Green balls, 693 Azure balls, 249 Golden balls, and 551 Brown balls. How many more Green balls are there than White balls?", "lEquations": ["X=731-16"], "lSolutions": [715]},
	{"iIndex": 765, "sQuestion": "Sarah was given 706 Azure balls, 934 Blue balls, 966 Black balls, 979 Pink balls, and 735 Magenta balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=979-934"], "lSolutions": [45]},
	{"iIndex": 766, "sQuestion": "Sarah was given 23 Golden balls, 795 Azure balls, 45 White balls, 499 Magenta balls, and 759 Green balls. How many more Magenta balls are there than Azure balls?", "lEquations": ["X=499-795"], "lSolutions": [-296]},
	{"iIndex": 767, "sQuestion": "Sarah was given 386 Orange balls, 846 Blue balls, and 291 Violet balls. How many more Orange balls are there than Violet balls?", "lEquations": ["X=386-291"], "lSolutions": [95]},
	{"iIndex": 768, "sQuestion": "Sarah was given 150 Azure balls, and 479 Orange balls. How many more Azure balls are there than Orange balls?", "lEquations": ["X=150-479"], "lSolutions": [-329]},
	{"iIndex": 769, "sQuestion": "Sarah was given 600 Golden balls, and 300 Green balls. How many more Golden balls are there than Green balls?", "lEquations": ["X=600-300"], "lSolutions": [300]},
	{"iIndex": 770, "sQuestion": "Sarah was given 759 White balls, 649 Brown balls, 798 Black balls, and 694 Red balls. How many more Red balls are there than Black balls?", "lEquations": ["X=694-798"], "lSolutions": [-104]},
	{"iIndex": 771, "sQuestion": "Sarah was given 205 Magenta balls, 351 White balls, 186 Azure balls, 251 Green balls, and 142 Yellow balls. How many more Magenta balls are there than White balls?", "lEquations": ["X=205-351"], "lSolutions": [-146]},
	{"iIndex": 772, "sQuestion": "Sarah was given 395 Yellow balls, 592 Brown balls, 558 Gray balls, and 389 White balls. How many more Brown balls are there than Yellow balls?", "lEquations": ["X=592-395"], "lSolutions": [197]},
	{"iIndex": 773, "sQuestion": "Sarah was given 876 Violet balls, 848 Azure balls, 586 Blue balls, 576 White balls, and 986 Gray balls. How many more Blue balls are there than White balls?", "lEquations": ["X=586-576"], "lSolutions": [10]},
	{"iIndex": 774, "sQuestion": "Sarah was given 448 Violet balls, 839 Pink balls, 181 Golden balls, 113 Blue balls, and 582 Red balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=448-181"], "lSolutions": [267]},
	{"iIndex": 775, "sQuestion": "Sarah was given 894 Yellow balls, 540 Brown balls, and 165 Magenta balls. How many more Magenta balls are there than Brown balls?", "lEquations": ["X=165-540"], "lSolutions": [-375]},
	{"iIndex": 776, "sQuestion": "Sarah was given 878 Green balls, 522 Black balls, and 334 Orange balls. How many more Green balls are there than Orange balls?", "lEquations": ["X=878-334"], "lSolutions": [544]},
	{"iIndex": 777, "sQuestion": "Sarah was given 653 Green balls, 843 Magenta balls, and 135 Red balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=653-843"], "lSolutions": [-190]},
	{"iIndex": 778, "sQuestion": "Sarah was given 312 Red balls, 754 Pink balls, 43 Gray balls, and 435 Blue balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=435-312"], "lSolutions": [123]},
	{"iIndex": 779, "sQuestion": "Sarah was given 684 Violet balls, 697 Azure balls, and 897 Magenta balls. How many more Azure balls are there than Magenta balls?", "lEquations": ["X=697-897"], "lSolutions": [-200]},
	{"iIndex": 780, "sQuestion": "Sarah was given 867 Green balls, 544 Red balls, 764 Yellow balls, and 747 Golden balls. How many more Yellow balls are there than Green balls?", "lEquations": ["X=764-867"], "lSolutions": [-103]},
	{"iIndex": 781, "sQuestion": "Sarah was given 960 Pink balls, 926 Blue balls, 361 Orange balls, 249 Yellow balls, and 731 Black balls. How many more Pink balls are there than Orange balls?", "lEquations": ["X=960-361"], "lSolutions": [599]},
	{"iIndex": 782, "sQuestion": "Sarah was given 13 White balls, 395 Gray balls, 676 Yellow balls, and 99 Violet balls. How many more White balls are there than Gray balls?", "lEquations": ["X=13-395"], "lSolutions": [-382]},
	{"iIndex": 783, "sQuestion": "Sarah was given 411 Black balls, 189 Blue balls, 449 Yellow balls, 870 Violet balls, and 622 Red balls. How many more Black balls are there than Red balls?", "lEquations": ["X=411-622"], "lSolutions": [-211]},
	{"iIndex": 784, "sQuestion": "Sarah was given 384 Orange balls, 675 Brown balls, 155 Magenta balls, and 124 Red balls. How many more Brown balls are there than Orange balls?", "lEquations": ["X=675-384"], "lSolutions": [291]},
	{"iIndex": 785, "sQuestion": "Sarah was given 874 Red balls, 878 Blue balls, 928 Magenta balls, 110 Green balls, and 51 Pink balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=51-878"], "lSolutions": [-827]},
	{"iIndex": 786, "sQuestion": "Sarah was given 221 Gray balls, and 13 Orange balls. How many more Orange balls are there than Gray balls?", "lEquations": ["X=13-221"], "lSolutions": [-208]},
	{"iIndex": 787, "sQuestion": "Sarah was given 388 Green balls, 111 Red balls, 906 Pink balls, 832 Yellow balls, and 626 Gray balls. How many more Gray balls are there than Red balls?", "lEquations": ["X=626-111"], "lSolutions": [515]},
	{"iIndex": 788, "sQuestion": "Sarah was given 198 White balls, 170 Azure balls, 23 Brown balls, and 514 Orange balls. How many more Brown balls are there than Orange balls?", "lEquations": ["X=23-514"], "lSolutions": [-491]},
	{"iIndex": 789, "sQuestion": "Sarah was given 953 Magenta balls, 616 Black balls, and 742 Blue balls. How many more Magenta balls are there than Blue balls?", "lEquations": ["X=953-742"], "lSolutions": [211]},
	{"iIndex": 790, "sQuestion": "Sarah was given 461 Violet balls, 33 White balls, 882 Gray balls, and 102 Blue balls. How many more White balls are there than Blue balls?", "lEquations": ["X=33-102"], "lSolutions": [-69]},
	{"iIndex": 791, "sQuestion": "Sarah was given 498 Pink balls, 518 Golden balls, and 937 Magenta balls. How many more Pink balls are there than Golden balls?", "lEquations": ["X=498-518"], "lSolutions": [-20]},
	{"iIndex": 792, "sQuestion": "Sarah was given 681 Pink balls, 168 Magenta balls, and 442 Violet balls. How many more Violet balls are there than Pink balls?", "lEquations": ["X=442-681"], "lSolutions": [-239]},
	{"iIndex": 793, "sQuestion": "Sarah was given 551 Yellow balls, 208 Magenta balls, 303 Golden balls, and 608 Gray balls. How many more Magenta balls are there than Yellow balls?", "lEquations": ["X=208-551"], "lSolutions": [-343]},
	{"iIndex": 794, "sQuestion": "Sarah was given 570 Yellow balls, and 183 Green balls. How many more Yellow balls are there than Green balls?", "lEquations": ["X=570-183"], "lSolutions": [387]},
	{"iIndex": 795, "sQuestion": "Sarah was given 932 Violet balls, 24 Green balls, 797 Gray balls, and 662 Pink balls. How many more Green balls are there than Violet balls?", "lEquations": ["X=24-932"], "lSolutions": [-908]},
	{"iIndex": 796, "sQuestion": "Sarah was given 102 Brown balls, 842 White balls, 451 Blue balls, and 728 Azure balls. How many more Azure balls are there than White balls?", "lEquations": ["X=728-842"], "lSolutions": [-114]},
	{"iIndex": 797, "sQuestion": "Sarah was given 668 Black balls, 180 Golden balls, 651 Blue balls, 264 Magenta balls, and 620 Pink balls. How many more Blue balls are there than Black balls?", "lEquations": ["X=651-668"], "lSolutions": [-17]},
	{"iIndex": 798, "sQuestion": "Sarah was given 684 Magenta balls, and 682 Pink balls. How many more Pink balls are there than Magenta balls?", "lEquations": ["X=682-684"], "lSolutions": [-2]},
	{"iIndex": 799, "sQuestion": "Sarah was given 653 Violet balls, 580 Yellow balls, and 211 Green balls. How many more Yellow balls are there than Green balls?", "lEquations": ["X=580-211"], "lSolutions": [369]},
	{"iIndex": 800, "sQuestion": "Sarah was given 523 Brown balls, 405 White balls, and 412 Azure balls. How many more Brown balls are there than Azure balls?", "lEquations": ["X=523-412"], "lSolutions": [111]},
	{"iIndex": 801, "sQuestion": "Sarah was given 240 Green balls, and 745 Yellow balls. How many more Green balls are there than Yellow balls?", "lEquations": ["X=240-745"], "lSolutions": [-505]},
	{"iIndex": 802, "sQuestion": "Sarah was given 121 Brown balls, 330 White balls, 833 Magenta balls, 936 Violet balls, and 732 Blue balls. How many more Magenta balls are there than Violet balls?", "lEquations": ["X=833-936"], "lSolutions": [-103]},
	{"iIndex": 803, "sQuestion": "Sarah was given 883 Pink balls, 911 Orange balls, and 284 Red balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=284-911"], "lSolutions": [-627]},
	{"iIndex": 804, "sQuestion": "Sarah was given 436 Black balls, 519 Golden balls, 435 Orange balls, and 463 Yellow balls. How many more Yellow balls are there than Golden balls?", "lEquations": ["X=463-519"], "lSolutions": [-56]},
	{"iIndex": 805, "sQuestion": "Sarah was given 610 Red balls, and 463 Violet balls. How many more Violet balls are there than Red balls?", "lEquations": ["X=463-610"], "lSolutions": [-147]},
	{"iIndex": 806, "sQuestion": "Sarah was given 888 Black balls, and 409 Azure balls. How many more Azure balls are there than Black balls?", "lEquations": ["X=409-888"], "lSolutions": [-479]},
	{"iIndex": 807, "sQuestion": "Sarah was given 519 Gray balls, 832 Golden balls, 116 Yellow balls, 605 Azure balls, and 13 Violet balls. How many more Golden balls are there than Azure balls?", "lEquations": ["X=832-605"], "lSolutions": [227]},
	{"iIndex": 808, "sQuestion": "Sarah was given 404 Green balls, 984 Gray balls, 101 Pink balls, 803 Black balls, and 53 Red balls. How many more Gray balls are there than Pink balls?", "lEquations": ["X=984-101"], "lSolutions": [883]},
	{"iIndex": 809, "sQuestion": "Sarah was given 578 Red balls, 119 Pink balls, and 240 Green balls. How many more Green balls are there than Red balls?", "lEquations": ["X=240-578"], "lSolutions": [-338]},
	{"iIndex": 810, "sQuestion": "Sarah was given 562 Green balls, 195 Red balls, 126 Pink balls, 343 Gray balls, and 673 Yellow balls. How many more Gray balls are there than Red balls?", "lEquations": ["X=343-195"], "lSolutions": [148]},
	{"iIndex": 811, "sQuestion": "Sarah was given 735 Gray balls, 851 Orange balls, 619 Magenta balls, and 196 White balls. How many more Orange balls are there than Magenta balls?", "lEquations": ["X=851-619"], "lSolutions": [232]},
	{"iIndex": 812, "sQuestion": "Sarah was given 114 Blue balls, 335 Golden balls, and 597 Azure balls. How many more Azure balls are there than Golden balls?", "lEquations": ["X=597-335"], "lSolutions": [262]},
	{"iIndex": 813, "sQuestion": "Sarah was given 705 White balls, 734 Magenta balls, and 849 Golden balls. How many more Golden balls are there than Magenta balls?", "lEquations": ["X=849-734"], "lSolutions": [115]},
	{"iIndex": 814, "sQuestion": "Sarah was given 266 Violet balls, 903 Azure balls, 275 Black balls, 622 Yellow balls, and 452 Red balls. How many more Azure balls are there than Yellow balls?", "lEquations": ["X=903-622"], "lSolutions": [281]},
	{"iIndex": 815, "sQuestion": "Sarah was given 787 Azure balls, 453 Brown balls, and 728 Black balls. How many more Azure balls are there than Black balls?", "lEquations": ["X=787-728"], "lSolutions": [59]},
	{"iIndex": 816, "sQuestion": "Sarah was given 833 Green balls, 302 Pink balls, and 761 Azure balls. How many more Pink balls are there than Green balls?", "lEquations": ["X=302-833"], "lSolutions": [-531]},
	{"iIndex": 817, "sQuestion": "Sarah was given 863 Golden balls, 612 Orange balls, 772 Red balls, and 221 Pink balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=863-221"], "lSolutions": [642]},
	{"iIndex": 818, "sQuestion": "Sarah was given 548 Green balls, 931 Magenta balls, and 681 Violet balls. How many more Violet balls are there than Green balls?", "lEquations": ["X=681-548"], "lSolutions": [133]},
	{"iIndex": 819, "sQuestion": "Sarah was given 678 Golden balls, 70 Magenta balls, and 807 Gray balls. How many more Magenta balls are there than Golden balls?", "lEquations": ["X=70-678"], "lSolutions": [-608]},
	{"iIndex": 820, "sQuestion": "Sarah was given 990 Green balls, 680 Pink balls, 903 Golden balls, 59 Orange balls, and 619 White balls. How many more Pink balls are there than Green balls?", "lEquations": ["X=680-990"], "lSolutions": [-310]},
	{"iIndex": 821, "sQuestion": "Sarah was given 185 Pink balls, 197 Black balls, 193 Red balls, and 923 Golden balls. How many more Pink balls are there than Golden balls?", "lEquations": ["X=185-923"], "lSolutions": [-738]},
	{"iIndex": 822, "sQuestion": "Sarah was given 535 Magenta balls, 996 Golden balls, 949 White balls, 247 Violet balls, and 678 Blue balls. How many more Magenta balls are there than White balls?", "lEquations": ["X=535-949"], "lSolutions": [-414]},
	{"iIndex": 823, "sQuestion": "Sarah was given 396 Red balls, 313 White balls, 363 Pink balls, 32 Violet balls, and 939 Gray balls. How many more Violet balls are there than Pink balls?", "lEquations": ["X=32-363"], "lSolutions": [-331]},
	{"iIndex": 824, "sQuestion": "Sarah was given 448 Brown balls, 63 Yellow balls, 693 Orange balls, 720 Golden balls, and 538 Red balls. How many more Orange balls are there than Red balls?", "lEquations": ["X=693-538"], "lSolutions": [155]},
	{"iIndex": 825, "sQuestion": "Sarah was given 158 White balls, and 487 Azure balls. How many more White balls are there than Azure balls?", "lEquations": ["X=158-487"], "lSolutions": [-329]},
	{"iIndex": 826, "sQuestion": "Sarah was given 630 Red balls, 867 Blue balls, 169 Violet balls, 422 White balls, and 465 Pink balls. How many more Pink balls are there than Red balls?", "lEquations": ["X=465-630"], "lSolutions": [-165]},
	{"iIndex": 827, "sQuestion": "Sarah was given 76 White balls, 968 Gray balls, and 723 Azure balls. How many more Azure balls are there than Gray balls?", "lEquations": ["X=723-968"], "lSolutions": [-245]},
	{"iIndex": 828, "sQuestion": "Sarah was given 231 Red balls, and 705 Magenta balls. How many more Magenta balls are there than Red balls?", "lEquations": ["X=705-231"], "lSolutions": [474]},
	{"iIndex": 829, "sQuestion": "Sarah was given 916 Golden balls, and 325 Azure balls. How many more Golden balls are there than Azure balls?", "lEquations": ["X=916-325"], "lSolutions": [591]},
	{"iIndex": 830, "sQuestion": "Sarah was given 607 Orange balls, 931 White balls, 314 Golden balls, and 446 Azure balls. How many more Golden balls are there than White balls?", "lEquations": ["X=314-931"], "lSolutions": [-617]},
	{"iIndex": 831, "sQuestion": "Sarah was given 138 Magenta balls, 674 Violet balls, and 842 Gray balls. How many more Gray balls are there than Magenta balls?", "lEquations": ["X=842-138"], "lSolutions": [704]},
	{"iIndex": 832, "sQuestion": "Sarah was given 813 Azure balls, and 228 Blue balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=228-813"], "lSolutions": [-585]},
	{"iIndex": 833, "sQuestion": "Sarah was given 563 Azure balls, and 295 Red balls. How many more Red balls are there than Azure balls?", "lEquations": ["X=295-563"], "lSolutions": [-268]},
	{"iIndex": 834, "sQuestion": "Sarah was given 325 Blue balls, 118 Magenta balls, 971 Orange balls, 661 Pink balls, and 122 Green balls. How many more Green balls are there than Blue balls?", "lEquations": ["X=122-325"], "lSolutions": [-203]},
	{"iIndex": 835, "sQuestion": "Sarah was given 574 White balls, 917 Magenta balls, 57 Violet balls, 109 Azure balls, and 476 Yellow balls. How many more Violet balls are there than White balls?", "lEquations": ["X=57-574"], "lSolutions": [-517]},
	{"iIndex": 836, "sQuestion": "Sarah was given 319 Orange balls, 470 Brown balls, 49 Red balls, and 130 Pink balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=49-319"], "lSolutions": [-270]},
	{"iIndex": 837, "sQuestion": "Sarah was given 858 Golden balls, and 439 Black balls. How many more Black balls are there than Golden balls?", "lEquations": ["X=439-858"], "lSolutions": [-419]},
	{"iIndex": 838, "sQuestion": "Sarah was given 590 Yellow balls, 505 Violet balls, 512 Gray balls, 735 Red balls, and 665 Orange balls. How many more Orange balls are there than Red balls?", "lEquations": ["X=665-735"], "lSolutions": [-70]},
	{"iIndex": 839, "sQuestion": "Sarah was given 803 Magenta balls, 551 Brown balls, 198 Blue balls, and 136 Gray balls. How many more Magenta balls are there than Blue balls?", "lEquations": ["X=803-198"], "lSolutions": [605]},
	{"iIndex": 840, "sQuestion": "Sarah was given 460 Magenta balls, and 987 Brown balls. How many more Magenta balls are there than Brown balls?", "lEquations": ["X=460-987"], "lSolutions": [-527]},
	{"iIndex": 841, "sQuestion": "Sarah was given 93 Red balls, 676 Black balls, 171 Pink balls, and 175 Violet balls. How many more Violet balls are there than Black balls?", "lEquations": ["X=175-676"], "lSolutions": [-501]},
	{"iIndex": 842, "sQuestion": "Sarah was given 348 Magenta balls, 793 Azure balls, and 676 Green balls. How many more Magenta balls are there than Green balls?", "lEquations": ["X=348-676"], "lSolutions": [-328]},
	{"iIndex": 843, "sQuestion": "Sarah was given 782 Azure balls, 855 Yellow balls, and 953 Orange balls. How many more Azure balls are there than Orange balls?", "lEquations": ["X=782-953"], "lSolutions": [-171]},
	{"iIndex": 844, "sQuestion": "Sarah was given 59 Red balls, 115 Golden balls, and 232 Green balls. How many more Green balls are there than Red balls?", "lEquations": ["X=232-59"], "lSolutions": [173]},
	{"iIndex": 845, "sQuestion": "Sarah was given 811 Gray balls, 616 White balls, 20 Violet balls, 822 Red balls, and 551 Golden balls. How many more Red balls are there than White balls?", "lEquations": ["X=822-616"], "lSolutions": [206]},
	{"iIndex": 846, "sQuestion": "Sarah was given 691 Azure balls, 577 Pink balls, 508 Blue balls, and 855 Magenta balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=508-691"], "lSolutions": [-183]},
	{"iIndex": 847, "sQuestion": "Sarah was given 781 White balls, 64 Green balls, 294 Golden balls, and 57 Violet balls. How many more White balls are there than Golden balls?", "lEquations": ["X=781-294"], "lSolutions": [487]},
	{"iIndex": 848, "sQuestion": "Sarah was given 282 Black balls, 980 Golden balls, 728 Violet balls, and 36 Brown balls. How many more Black balls are there than Violet balls?", "lEquations": ["X=282-728"], "lSolutions": [-446]},
	{"iIndex": 849, "sQuestion": "Sarah was given 1000 Yellow balls, 804 Blue balls, 502 Magenta balls, and 271 Green balls. How many more Yellow balls are there than Blue balls?", "lEquations": ["X=1000-804"], "lSolutions": [196]},
	{"iIndex": 850, "sQuestion": "Sarah was given 423 Azure balls, 470 Brown balls, 445 Red balls, 227 Pink balls, and 468 Gray balls. How many more Gray balls are there than Azure balls?", "lEquations": ["X=468-423"], "lSolutions": [45]},
	{"iIndex": 851, "sQuestion": "Sarah was given 642 Azure balls, 147 Blue balls, 468 Gray balls, 360 Red balls, and 361 White balls. How many more Azure balls are there than Gray balls?", "lEquations": ["X=642-468"], "lSolutions": [174]},
	{"iIndex": 852, "sQuestion": "Sarah was given 902 Yellow balls, 690 Green balls, and 262 White balls. How many more Green balls are there than White balls?", "lEquations": ["X=690-262"], "lSolutions": [428]},
	{"iIndex": 853, "sQuestion": "Sarah was given 276 Magenta balls, 956 Orange balls, 436 Black balls, and 716 White balls. How many more Orange balls are there than Black balls?", "lEquations": ["X=956-436"], "lSolutions": [520]},
	{"iIndex": 854, "sQuestion": "Sarah was given 741 Magenta balls, 180 White balls, 228 Blue balls, 685 Violet balls, and 123 Orange balls. How many more White balls are there than Magenta balls?", "lEquations": ["X=180-741"], "lSolutions": [-561]},
	{"iIndex": 855, "sQuestion": "Sarah was given 44 Orange balls, 424 Golden balls, and 903 Blue balls. How many more Blue balls are there than Golden balls?", "lEquations": ["X=903-424"], "lSolutions": [479]},
	{"iIndex": 856, "sQuestion": "Sarah was given 478 Orange balls, 649 Golden balls, and 851 White balls. How many more White balls are there than Orange balls?", "lEquations": ["X=851-478"], "lSolutions": [373]},
	{"iIndex": 857, "sQuestion": "Sarah was given 36 Gray balls, and 729 Magenta balls. How many more Gray balls are there than Magenta balls?", "lEquations": ["X=36-729"], "lSolutions": [-693]},
	{"iIndex": 858, "sQuestion": "Sarah was given 612 Azure balls, and 223 Gray balls. How many more Gray balls are there than Azure balls?", "lEquations": ["X=223-612"], "lSolutions": [-389]},
	{"iIndex": 859, "sQuestion": "Sarah was given 226 Green balls, 123 Gray balls, 754 Yellow balls, and 972 Blue balls. How many more Blue balls are there than Gray balls?", "lEquations": ["X=972-123"], "lSolutions": [849]},
	{"iIndex": 860, "sQuestion": "Sarah was given 607 Green balls, 365 Yellow balls, 924 Gray balls, and 54 Violet balls. How many more Green balls are there than Violet balls?", "lEquations": ["X=607-54"], "lSolutions": [553]},
	{"iIndex": 861, "sQuestion": "Sarah was given 1000 Pink balls, 313 Violet balls, 532 Yellow balls, and 882 Blue balls. How many more Yellow balls are there than Blue balls?", "lEquations": ["X=532-882"], "lSolutions": [-350]},
	{"iIndex": 862, "sQuestion": "Sarah was given 626 Red balls, 156 Violet balls, 674 Black balls, and 228 Golden balls. How many more Black balls are there than Golden balls?", "lEquations": ["X=674-228"], "lSolutions": [446]},
	{"iIndex": 863, "sQuestion": "Sarah was given 830 Green balls, 889 Violet balls, 681 Golden balls, 657 Pink balls, and 375 Gray balls. How many more Golden balls are there than Pink balls?", "lEquations": ["X=681-657"], "lSolutions": [24]},
	{"iIndex": 864, "sQuestion": "Sarah was given 965 White balls, 127 Brown balls, 306 Violet balls, 632 Azure balls, and 514 Gray balls. How many more Brown balls are there than White balls?", "lEquations": ["X=127-965"], "lSolutions": [-838]},
	{"iIndex": 865, "sQuestion": "Sarah was given 459 Blue balls, and 376 Yellow balls. How many more Yellow balls are there than Blue balls?", "lEquations": ["X=376-459"], "lSolutions": [-83]},
	{"iIndex": 866, "sQuestion": "Sarah was given 746 Pink balls, 133 Magenta balls, 828 Golden balls, and 697 Black balls. How many more Black balls are there than Golden balls?", "lEquations": ["X=697-828"], "lSolutions": [-131]},
	{"iIndex": 867, "sQuestion": "Sarah was given 189 Yellow balls, 509 White balls, and 466 Black balls. How many more Black balls are there than Yellow balls?", "lEquations": ["X=466-189"], "lSolutions": [277]},
	{"iIndex": 868, "sQuestion": "Sarah was given 312 White balls, 12 Gray balls, 646 Orange balls, 609 Red balls, and 470 Black balls. How many more Gray balls are there than Black balls?", "lEquations": ["X=12-470"], "lSolutions": [-458]},
	{"iIndex": 869, "sQuestion": "Sarah was given 568 Blue balls, 595 Orange balls, and 416 Red balls. How many more Blue balls are there than Red balls?", "lEquations": ["X=568-416"], "lSolutions": [152]},
	{"iIndex": 870, "sQuestion": "Sarah was given 869 Red balls, 864 Yellow balls, and 865 Golden balls. How many more Red balls are there than Yellow balls?", "lEquations": ["X=869-864"], "lSolutions": [5]},
	{"iIndex": 871, "sQuestion": "Sarah was given 681 Orange balls, and 509 Golden balls. How many more Golden balls are there than Orange balls?", "lEquations": ["X=509-681"], "lSolutions": [-172]},
	{"iIndex": 872, "sQuestion": "Sarah was given 816 Orange balls, and 141 Brown balls. How many more Brown balls are there than Orange balls?", "lEquations": ["X=141-816"], "lSolutions": [-675]},
	{"iIndex": 873, "sQuestion": "Sarah was given 189 Violet balls, and 228 White balls. How many more White balls are there than Violet balls?", "lEquations": ["X=228-189"], "lSolutions": [39]},
	{"iIndex": 874, "sQuestion": "Sarah was given 490 Red balls, 153 White balls, 780 Gray balls, and 922 Black balls. How many more Gray balls are there than Red balls?", "lEquations": ["X=780-490"], "lSolutions": [290]},
	{"iIndex": 875, "sQuestion": "Sarah was given 136 Golden balls, and 825 Yellow balls. How many more Golden balls are there than Yellow balls?", "lEquations": ["X=136-825"], "lSolutions": [-689]},
	{"iIndex": 876, "sQuestion": "Sarah was given 12 Magenta balls, 582 Yellow balls, 944 Gray balls, 68 Orange balls, and 750 Golden balls. How many more Gray balls are there than Golden balls?", "lEquations": ["X=944-750"], "lSolutions": [194]},
	{"iIndex": 877, "sQuestion": "Sarah was given 672 White balls, 771 Orange balls, and 379 Violet balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=379-771"], "lSolutions": [-392]},
	{"iIndex": 878, "sQuestion": "Sarah was given 565 Golden balls, 172 White balls, and 925 Brown balls. How many more White balls are there than Brown balls?", "lEquations": ["X=172-925"], "lSolutions": [-753]},
	{"iIndex": 879, "sQuestion": "Sarah was given 512 Orange balls, 928 Magenta balls, 484 Violet balls, and 932 Azure balls. How many more Violet balls are there than Azure balls?", "lEquations": ["X=484-932"], "lSolutions": [-448]},
	{"iIndex": 880, "sQuestion": "Sarah was given 102 Golden balls, and 810 Black balls. How many more Golden balls are there than Black balls?", "lEquations": ["X=102-810"], "lSolutions": [-708]},
	{"iIndex": 881, "sQuestion": "Sarah was given 618 White balls, 919 Orange balls, and 602 Magenta balls. How many more Magenta balls are there than White balls?", "lEquations": ["X=602-618"], "lSolutions": [-16]},
	{"iIndex": 882, "sQuestion": "Sarah was given 810 Blue balls, 428 Magenta balls, 386 Pink balls, and 923 Gray balls. How many more Blue balls are there than Gray balls?", "lEquations": ["X=810-923"], "lSolutions": [-113]},
	{"iIndex": 883, "sQuestion": "Sarah was given 75 Golden balls, 106 Gray balls, 337 Yellow balls, and 872 Orange balls. How many more Gray balls are there than Yellow balls?", "lEquations": ["X=106-337"], "lSolutions": [-231]},
	{"iIndex": 884, "sQuestion": "Sarah was given 959 Brown balls, 194 Red balls, 28 Orange balls, 513 Azure balls, and 768 Pink balls. How many more Red balls are there than Brown balls?", "lEquations": ["X=194-959"], "lSolutions": [-765]},
	{"iIndex": 885, "sQuestion": "Sarah was given 464 Black balls, and 875 Blue balls. How many more Blue balls are there than Black balls?", "lEquations": ["X=875-464"], "lSolutions": [411]},
	{"iIndex": 886, "sQuestion": "Sarah was given 463 Green balls, 128 Pink balls, 72 Azure balls, 218 Orange balls, and 213 Blue balls. How many more Pink balls are there than Green balls?", "lEquations": ["X=128-463"], "lSolutions": [-335]},
	{"iIndex": 887, "sQuestion": "Sarah was given 501 Azure balls, 451 Golden balls, and 340 Pink balls. How many more Azure balls are there than Pink balls?", "lEquations": ["X=501-340"], "lSolutions": [161]},
	{"iIndex": 888, "sQuestion": "Sarah was given 373 Azure balls, 371 Black balls, and 89 Orange balls. How many more Orange balls are there than Black balls?", "lEquations": ["X=89-371"], "lSolutions": [-282]},
	{"iIndex": 889, "sQuestion": "Sarah was given 366 Blue balls, and 368 Green balls. How many more Blue balls are there than Green balls?", "lEquations": ["X=366-368"], "lSolutions": [-2]},
	{"iIndex": 890, "sQuestion": "Sarah was given 452 Yellow balls, 474 Golden balls, 923 Gray balls, and 731 Pink balls. How many more Yellow balls are there than Golden balls?", "lEquations": ["X=452-474"], "lSolutions": [-22]},
	{"iIndex": 891, "sQuestion": "Sarah was given 687 Black balls, 795 Azure balls, 250 Green balls, and 60 Orange balls. How many more Green balls are there than Black balls?", "lEquations": ["X=250-687"], "lSolutions": [-437]},
	{"iIndex": 892, "sQuestion": "Sarah was given 370 Gray balls, 530 Red balls, 86 Magenta balls, and 801 Azure balls. How many more Magenta balls are there than Gray balls?", "lEquations": ["X=86-370"], "lSolutions": [-284]},
	{"iIndex": 893, "sQuestion": "Sarah was given 547 Brown balls, 31 Red balls, 204 Blue balls, 826 Gray balls, and 990 White balls. How many more Red balls are there than Blue balls?", "lEquations": ["X=31-204"], "lSolutions": [-173]},
	{"iIndex": 894, "sQuestion": "Sarah was given 421 Gray balls, and 522 Azure balls. How many more Azure balls are there than Gray balls?", "lEquations": ["X=522-421"], "lSolutions": [101]},
	{"iIndex": 895, "sQuestion": "Sarah was given 556 Violet balls, 883 Golden balls, and 862 Green balls. How many more Violet balls are there than Green balls?", "lEquations": ["X=556-862"], "lSolutions": [-306]},
	{"iIndex": 896, "sQuestion": "Sarah was given 677 Yellow balls, 34 Azure balls, 87 Orange balls, 505 Pink balls, and 995 Red balls. How many more Yellow balls are there than Pink balls?", "lEquations": ["X=677-505"], "lSolutions": [172]},
	{"iIndex": 897, "sQuestion": "Sarah was given 188 Gray balls, 526 Orange balls, and 71 Red balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=71-526"], "lSolutions": [-455]},
	{"iIndex": 898, "sQuestion": "Sarah was given 364 Violet balls, 713 Azure balls, and 602 Magenta balls. How many more Azure balls are there than Violet balls?", "lEquations": ["X=713-364"], "lSolutions": [349]},
	{"iIndex": 899, "sQuestion": "Sarah was given 606 Gray balls, 384 Green balls, 885 Blue balls, 627 Magenta balls, and 533 Orange balls. How many more Gray balls are there than Blue balls?", "lEquations": ["X=606-885"], "lSolutions": [-279]},
	{"iIndex": 900, "sQuestion": "Sarah was given 856 Violet balls, 943 Magenta balls, 150 Pink balls, and 211 Green balls. How many more Green balls are there than Violet balls?", "lEquations": ["X=211-856"], "lSolutions": [-645]},
	{"iIndex": 901, "sQuestion": "Sarah was given 653 Black balls, 666 Orange balls, 69 Golden balls, and 510 White balls. How many more Orange balls are there than White balls?", "lEquations": ["X=666-510"], "lSolutions": [156]},
	{"iIndex": 902, "sQuestion": "Sarah was given 426 Gray balls, 174 Azure balls, 54 Blue balls, 938 Golden balls, and 298 White balls. How many more Golden balls are there than Gray balls?", "lEquations": ["X=938-426"], "lSolutions": [512]},
	{"iIndex": 903, "sQuestion": "Sarah was given 214 Violet balls, 643 Golden balls, and 717 Blue balls. How many more Violet balls are there than Golden balls?", "lEquations": ["X=214-643"], "lSolutions": [-429]},
	{"iIndex": 904, "sQuestion": "Sarah was given 628 Magenta balls, and 377 Azure balls. How many more Azure balls are there than Magenta balls?", "lEquations": ["X=377-628"], "lSolutions": [-251]},
	{"iIndex": 905, "sQuestion": "Sarah was given 61 Yellow balls, 332 Violet balls, 989 Orange balls, and 465 Golden balls. How many more Violet balls are there than Yellow balls?", "lEquations": ["X=332-61"], "lSolutions": [271]},
	{"iIndex": 906, "sQuestion": "Sarah was given 500 Orange balls, and 704 White balls. How many more Orange balls are there than White balls?", "lEquations": ["X=500-704"], "lSolutions": [-204]},
	{"iIndex": 907, "sQuestion": "Sarah was given 447 Pink balls, 45 Gray balls, 809 Black balls, 769 Green balls, and 471 Violet balls. How many more Gray balls are there than Pink balls?", "lEquations": ["X=45-447"], "lSolutions": [-402]},
	{"iIndex": 908, "sQuestion": "Sarah was given 301 Orange balls, and 431 Pink balls. How many more Orange balls are there than Pink balls?", "lEquations": ["X=301-431"], "lSolutions": [-130]},
	{"iIndex": 909, "sQuestion": "Sarah was given 276 Gray balls, 135 Azure balls, 875 White balls, and 210 Golden balls. How many more Gray balls are there than Azure balls?", "lEquations": ["X=276-135"], "lSolutions": [141]},
	{"iIndex": 910, "sQuestion": "Sarah was given 712 Pink balls, 112 White balls, 565 Gray balls, 878 Magenta balls, and 34 Azure balls. How many more Azure balls are there than White balls?", "lEquations": ["X=34-112"], "lSolutions": [-78]},
	{"iIndex": 911, "sQuestion": "Sarah was given 232 Black balls, 3 White balls, 545 Pink balls, 33 Violet balls, and 523 Red balls. How many more Red balls are there than White balls?", "lEquations": ["X=523-3"], "lSolutions": [520]},
	{"iIndex": 912, "sQuestion": "Sarah was given 740 Orange balls, 674 Black balls, 218 Brown balls, 886 Yellow balls, and 251 Red balls. How many more Orange balls are there than Black balls?", "lEquations": ["X=740-674"], "lSolutions": [66]},
	{"iIndex": 913, "sQuestion": "Sarah was given 81 Orange balls, 712 Green balls, and 214 Black balls. How many more Orange balls are there than Black balls?", "lEquations": ["X=81-214"], "lSolutions": [-133]},
	{"iIndex": 914, "sQuestion": "Sarah was given 794 Brown balls, and 265 Magenta balls. How many more Magenta balls are there than Brown balls?", "lEquations": ["X=265-794"], "lSolutions": [-529]},
	{"iIndex": 915, "sQuestion": "Sarah was given 245 Red balls, 435 Gray balls, and 77 Magenta balls. How many more Gray balls are there than Magenta balls?", "lEquations": ["X=435-77"], "lSolutions": [358]},
	{"iIndex": 916, "sQuestion": "Sarah was given 695 Magenta balls, 45 White balls, and 286 Violet balls. How many more Magenta balls are there than Violet balls?", "lEquations": ["X=695-286"], "lSolutions": [409]},
	{"iIndex": 917, "sQuestion": "Sarah was given 362 Azure balls, 728 Blue balls, 344 Gray balls, 880 Magenta balls, and 513 Black balls. How many more Black balls are there than Gray balls?", "lEquations": ["X=513-344"], "lSolutions": [169]},
	{"iIndex": 918, "sQuestion": "Sarah was given 876 Orange balls, 823 Gray balls, and 931 Green balls. How many more Gray balls are there than Green balls?", "lEquations": ["X=823-931"], "lSolutions": [-108]},
	{"iIndex": 919, "sQuestion": "Sarah was given 114 Violet balls, 50 Golden balls, 67 Gray balls, and 891 Azure balls. How many more Violet balls are there than Gray balls?", "lEquations": ["X=114-67"], "lSolutions": [47]},
	{"iIndex": 920, "sQuestion": "Sarah was given 722 Golden balls, 151 Azure balls, 852 Yellow balls, 890 Gray balls, and 916 Black balls. How many more Black balls are there than Gray balls?", "lEquations": ["X=916-890"], "lSolutions": [26]},
	{"iIndex": 921, "sQuestion": "Sarah was given 761 Blue balls, 425 Violet balls, 345 Pink balls, 672 Magenta balls, and 320 Green balls. How many more Violet balls are there than Blue balls?", "lEquations": ["X=425-761"], "lSolutions": [-336]},
	{"iIndex": 922, "sQuestion": "Sarah was given 449 Orange balls, and 125 Black balls. How many more Black balls are there than Orange balls?", "lEquations": ["X=125-449"], "lSolutions": [-324]},
	{"iIndex": 923, "sQuestion": "Sarah was given 756 Azure balls, 547 Black balls, 460 Red balls, and 749 Violet balls. How many more Azure balls are there than Violet balls?", "lEquations": ["X=756-749"], "lSolutions": [7]},
	{"iIndex": 924, "sQuestion": "Sarah was given 102 Gray balls, 565 Black balls, 250 Yellow balls, and 508 Magenta balls. How many more Black balls are there than Magenta balls?", "lEquations": ["X=565-508"], "lSolutions": [57]},
	{"iIndex": 925, "sQuestion": "Sarah was given 702 White balls, 340 Red balls, 313 Pink balls, and 568 Azure balls. How many more Red balls are there than Pink balls?", "lEquations": ["X=340-313"], "lSolutions": [27]},
	{"iIndex": 926, "sQuestion": "Sarah was given 883 Golden balls, 943 Magenta balls, and 784 Orange balls. How many more Golden balls are there than Orange balls?", "lEquations": ["X=883-784"], "lSolutions": [99]},
	{"iIndex": 927, "sQuestion": "Sarah was given 848 Magenta balls, 785 White balls, and 779 Red balls. How many more Red balls are there than White balls?", "lEquations": ["X=779-785"], "lSolutions": [-6]},
	{"iIndex": 928, "sQuestion": "Sarah was given 775 Golden balls, 874 Green balls, 540 Blue balls, 190 Red balls, and 180 Azure balls. How many more Green balls are there than Red balls?", "lEquations": ["X=874-190"], "lSolutions": [684]},
	{"iIndex": 929, "sQuestion": "Sarah was given 578 Gray balls, 332 Magenta balls, and 165 Green balls. How many more Green balls are there than Magenta balls?", "lEquations": ["X=165-332"], "lSolutions": [-167]},
	{"iIndex": 930, "sQuestion": "Sarah was given 919 Blue balls, 891 Pink balls, 289 Magenta balls, and 33 Red balls. How many more Pink balls are there than Blue balls?", "lEquations": ["X=891-919"], "lSolutions": [-28]},
	{"iIndex": 931, "sQuestion": "Sarah was given 883 White balls, 149 Yellow balls, 439 Pink balls, 222 Orange balls, and 959 Brown balls. How many more Yellow balls are there than Brown balls?", "lEquations": ["X=149-959"], "lSolutions": [-810]},
	{"iIndex": 932, "sQuestion": "Sarah was given 381 Orange balls, 344 Red balls, 50 Black balls, and 531 Green balls. How many more Black balls are there than Red balls?", "lEquations": ["X=50-344"], "lSolutions": [-294]},
	{"iIndex": 933, "sQuestion": "Sarah was given 628 Golden balls, 836 White balls, 90 Magenta balls, 19 Brown balls, and 9 Azure balls. How many more Golden balls are there than White balls?", "lEquations": ["X=628-836"], "lSolutions": [-208]},
	{"iIndex": 934, "sQuestion": "Sarah was given 51 Blue balls, 227 Brown balls, 931 White balls, and 306 Orange balls. How many more Brown balls are there than White balls?", "lEquations": ["X=227-931"], "lSolutions": [-704]},
	{"iIndex": 935, "sQuestion": "Sarah was given 727 Orange balls, 883 Red balls, and 103 Gray balls. How many more Red balls are there than Orange balls?", "lEquations": ["X=883-727"], "lSolutions": [156]},
	{"iIndex": 936, "sQuestion": "Sarah was given 490 Pink balls, 70 Golden balls, 14 Brown balls, 466 White balls, and 328 Violet balls. How many more Violet balls are there than Brown balls?", "lEquations": ["X=328-14"], "lSolutions": [314]},
	{"iIndex": 937, "sQuestion": "Sarah was given 112 Azure balls, 474 Red balls, 899 Orange balls, and 674 Black balls. How many more Orange balls are there than Red balls?", "lEquations": ["X=899-474"], "lSolutions": [425]},
	{"iIndex": 938, "sQuestion": "Sarah was given 517 Azure balls, and 455 White balls. How many more Azure balls are there than White balls?", "lEquations": ["X=517-455"], "lSolutions": [62]},
	{"iIndex": 939, "sQuestion": "Sarah was given 153 Green balls, 821 White balls, 1 Brown balls, and 510 Gray balls. How many more Gray balls are there than Green balls?", "lEquations": ["X=510-153"], "lSolutions": [357]},
	{"iIndex": 940, "sQuestion": "Sarah was given 689 Black balls, 990 Orange balls, and 551 Azure balls. How many more Azure balls are there than Black balls?", "lEquations": ["X=551-689"], "lSolutions": [-138]},
	{"iIndex": 941, "sQuestion": "Sarah was given 894 White balls, 733 Pink balls, 652 Blue balls, and 395 Violet balls. How many more Blue balls are there than White balls?", "lEquations": ["X=652-894"], "lSolutions": [-242]},
	{"iIndex": 942, "sQuestion": "Sarah was given 219 Gray balls, 740 Orange balls, and 464 Azure balls. How many more Azure balls are there than Gray balls?", "lEquations": ["X=464-219"], "lSolutions": [245]},
	{"iIndex": 943, "sQuestion": "Sarah was given 640 Pink balls, 277 Magenta balls, and 660 Violet balls. How many more Pink balls are there than Magenta balls?", "lEquations": ["X=640-277"], "lSolutions": [363]},
	{"iIndex": 944, "sQuestion": "Sarah was given 960 White balls, and 614 Brown balls. How many more Brown balls are there than White balls?", "lEquations": ["X=614-960"], "lSolutions": [-346]},
	{"iIndex": 945, "sQuestion": "Sarah was given 257 Orange balls, and 187 Brown balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=257-187"], "lSolutions": [70]},
	{"iIndex": 946, "sQuestion": "Sarah was given 1000 Red balls, and 478 Yellow balls. How many more Red balls are there than Yellow balls?", "lEquations": ["X=1000-478"], "lSolutions": [522]},
	{"iIndex": 947, "sQuestion": "Sarah was given 496 Green balls, 177 Orange balls, 677 Magenta balls, and 310 Pink balls. How many more Green balls are there than Orange balls?", "lEquations": ["X=496-177"], "lSolutions": [319]},
	{"iIndex": 948, "sQuestion": "Sarah was given 79 Black balls, 125 Orange balls, and 303 Azure balls. How many more Azure balls are there than Black balls?", "lEquations": ["X=303-79"], "lSolutions": [224]},
	{"iIndex": 949, "sQuestion": "Sarah was given 704 Golden balls, 371 Blue balls, 110 Red balls, and 461 Magenta balls. How many more Golden balls are there than Red balls?", "lEquations": ["X=704-110"], "lSolutions": [594]},
	{"iIndex": 950, "sQuestion": "Sarah was given 445 Brown balls, and 90 Gray balls. How many more Brown balls are there than Gray balls?", "lEquations": ["X=445-90"], "lSolutions": [355]},
	{"iIndex": 951, "sQuestion": "Sarah was given 803 Green balls, 641 Azure balls, 719 Brown balls, 11 Black balls, and 71 Yellow balls. How many more Azure balls are there than Black balls?", "lEquations": ["X=641-11"], "lSolutions": [630]},
	{"iIndex": 952, "sQuestion": "Sarah was given 703 Pink balls, 520 White balls, 613 Black balls, 339 Orange balls, and 41 Azure balls. How many more Pink balls are there than Azure balls?", "lEquations": ["X=703-41"], "lSolutions": [662]},
	{"iIndex": 953, "sQuestion": "Sarah was given 863 Brown balls, and 879 Orange balls. How many more Brown balls are there than Orange balls?", "lEquations": ["X=863-879"], "lSolutions": [-16]},
	{"iIndex": 954, "sQuestion": "Sarah was given 744 Orange balls, 631 Azure balls, 934 Black balls, and 210 Violet balls. How many more Violet balls are there than Black balls?", "lEquations": ["X=210-934"], "lSolutions": [-724]},
	{"iIndex": 955, "sQuestion": "Sarah was given 726 Magenta balls, 741 Azure balls, 542 Golden balls, 657 White balls, and 572 Gray balls. How many more Magenta balls are there than Azure balls?", "lEquations": ["X=726-741"], "lSolutions": [-15]},
	{"iIndex": 956, "sQuestion": "Sarah was given 507 Violet balls, 761 Magenta balls, 141 Red balls, 352 Green balls, and 742 Blue balls. How many more Blue balls are there than Violet balls?", "lEquations": ["X=742-507"], "lSolutions": [235]},
	{"iIndex": 957, "sQuestion": "Sarah was given 827 Gray balls, 505 Orange balls, and 20 Golden balls. How many more Orange balls are there than Gray balls?", "lEquations": ["X=505-827"], "lSolutions": [-322]},
	{"iIndex": 958, "sQuestion": "Sarah was given 738 Green balls, and 161 Brown balls. How many more Brown balls are there than Green balls?", "lEquations": ["X=161-738"], "lSolutions": [-577]},
	{"iIndex": 959, "sQuestion": "Sarah was given 964 Pink balls, 112 Gray balls, and 619 Violet balls. How many more Pink balls are there than Gray balls?", "lEquations": ["X=964-112"], "lSolutions": [852]},
	{"iIndex": 960, "sQuestion": "Sarah was given 702 Blue balls, and 704 White balls. How many more Blue balls are there than White balls?", "lEquations": ["X=702-704"], "lSolutions": [-2]},
	{"iIndex": 961, "sQuestion": "Sarah was given 254 Violet balls, and 182 Magenta balls. How many more Magenta balls are there than Violet balls?", "lEquations": ["X=182-254"], "lSolutions": [-72]},
	{"iIndex": 962, "sQuestion": "Sarah was given 817 Yellow balls, and 13 Orange balls. How many more Orange balls are there than Yellow balls?", "lEquations": ["X=13-817"], "lSolutions": [-804]},
	{"iIndex": 963, "sQuestion": "Sarah was given 876 Yellow balls, 889 Pink balls, and 677 Blue balls. How many more Blue balls are there than Yellow balls?", "lEquations": ["X=677-876"], "lSolutions": [-199]},
	{"iIndex": 964, "sQuestion": "Sarah was given 220 Pink balls, 641 Golden balls, 250 Red balls, 493 Yellow balls, and 289 Gray balls. How many more Red balls are there than Gray balls?", "lEquations": ["X=250-289"], "lSolutions": [-39]},
	{"iIndex": 965, "sQuestion": "Sarah was given 68 Blue balls, 580 Magenta balls, 256 Pink balls, 466 Red balls, and 143 Orange balls. How many more Red balls are there than Magenta balls?", "lEquations": ["X=466-580"], "lSolutions": [-114]},
	{"iIndex": 966, "sQuestion": "Sarah was given 97 Orange balls, and 756 Pink balls. How many more Orange balls are there than Pink balls?", "lEquations": ["X=97-756"], "lSolutions": [-659]},
	{"iIndex": 967, "sQuestion": "Sarah was given 491 Orange balls, 122 White balls, 863 Brown balls, 90 Green balls, and 319 Azure balls. How many more Green balls are there than White balls?", "lEquations": ["X=90-122"], "lSolutions": [-32]},
	{"iIndex": 968, "sQuestion": "Sarah was given 710 Violet balls, 991 Red balls, and 875 Black balls. How many more Black balls are there than Red balls?", "lEquations": ["X=875-991"], "lSolutions": [-116]},
	{"iIndex": 969, "sQuestion": "Sarah was given 783 Magenta balls, 276 Black balls, and 141 Yellow balls. How many more Magenta balls are there than Black balls?", "lEquations": ["X=783-276"], "lSolutions": [507]},
	{"iIndex": 970, "sQuestion": "Sarah was given 108 Red balls, 750 Orange balls, 202 Magenta balls, and 311 Black balls. How many more Orange balls are there than Red balls?", "lEquations": ["X=750-108"], "lSolutions": [642]},
	{"iIndex": 971, "sQuestion": "Sarah was given 898 Yellow balls, and 750 Gray balls. How many more Gray balls are there than Yellow balls?", "lEquations": ["X=750-898"], "lSolutions": [-148]},
	{"iIndex": 972, "sQuestion": "Sarah was given 775 Gray balls, 471 Golden balls, 479 Orange balls, and 340 Black balls. How many more Orange balls are there than Gray balls?", "lEquations": ["X=479-775"], "lSolutions": [-296]},
	{"iIndex": 973, "sQuestion": "Sarah was given 948 Red balls, and 851 White balls. How many more Red balls are there than White balls?", "lEquations": ["X=948-851"], "lSolutions": [97]},
	{"iIndex": 974, "sQuestion": "Sarah was given 981 Golden balls, 920 Red balls, 539 Black balls, and 538 Azure balls. How many more Golden balls are there than Red balls?", "lEquations": ["X=981-920"], "lSolutions": [61]},
	{"iIndex": 975, "sQuestion": "Sarah was given 321 Blue balls, and 209 Red balls. How many more Red balls are there than Blue balls?", "lEquations": ["X=209-321"], "lSolutions": [-112]},
	{"iIndex": 976, "sQuestion": "Sarah was given 848 Yellow balls, 467 Azure balls, 205 Orange balls, and 773 White balls. How many more Yellow balls are there than White balls?", "lEquations": ["X=848-773"], "lSolutions": [75]},
	{"iIndex": 977, "sQuestion": "Sarah was given 348 Azure balls, 244 Blue balls, and 508 Yellow balls. How many more Blue balls are there than Yellow balls?", "lEquations": ["X=244-508"], "lSolutions": [-264]},
	{"iIndex": 978, "sQuestion": "Sarah was given 659 Brown balls, and 850 Yellow balls. How many more Yellow balls are there than Brown balls?", "lEquations": ["X=850-659"], "lSolutions": [191]},
	{"iIndex": 979, "sQuestion": "Sarah was given 500 Azure balls, 726 Golden balls, 704 Gray balls, 295 Orange balls, and 62 Brown balls. How many more Brown balls are there than Orange balls?", "lEquations": ["X=62-295"], "lSolutions": [-233]},
	{"iIndex": 980, "sQuestion": "Sarah was given 976 Black balls, 664 Golden balls, and 167 Green balls. How many more Golden balls are there than Black balls?", "lEquations": ["X=664-976"], "lSolutions": [-312]},
	{"iIndex": 981, "sQuestion": "Sarah was given 402 Red balls, 867 Violet balls, 965 Green balls, and 7 Orange balls. How many more Violet balls are there than Orange balls?", "lEquations": ["X=867-7"], "lSolutions": [860]},
	{"iIndex": 982, "sQuestion": "Sarah was given 937 Green balls, and 760 Golden balls. How many more Golden balls are there than Green balls?", "lEquations": ["X=760-937"], "lSolutions": [-177]},
	{"iIndex": 983, "sQuestion": "Sarah was given 713 White balls, 485 Gray balls, 942 Violet balls, 1000 Orange balls, and 781 Blue balls. How many more Gray balls are there than Orange balls?", "lEquations": ["X=485-1000"], "lSolutions": [-515]},
	{"iIndex": 984, "sQuestion": "Sarah was given 263 Green balls, 728 Brown balls, 826 Gray balls, and 270 Violet balls. How many more Brown balls are there than Violet balls?", "lEquations": ["X=728-270"], "lSolutions": [458]},
	{"iIndex": 985, "sQuestion": "Sarah was given 242 Brown balls, 417 Pink balls, 613 Magenta balls, 458 Violet balls, and 77 Blue balls. How many more Violet balls are there than Brown balls?", "lEquations": ["X=458-242"], "lSolutions": [216]},
	{"iIndex": 986, "sQuestion": "Sarah was given 874 Orange balls, and 361 Blue balls. How many more Orange balls are there than Blue balls?", "lEquations": ["X=874-361"], "lSolutions": [513]},
	{"iIndex": 987, "sQuestion": "Sarah was given 324 White balls, 44 Golden balls, and 686 Red balls. How many more Red balls are there than Golden balls?", "lEquations": ["X=686-44"], "lSolutions": [642]},
	{"iIndex": 988, "sQuestion": "Sarah was given 922 Blue balls, 987 Magenta balls, and 540 Azure balls. How many more Blue balls are there than Azure balls?", "lEquations": ["X=922-540"], "lSolutions": [382]},
	{"iIndex": 989, "sQuestion": "Sarah was given 149 Green balls, 870 White balls, and 15 Pink balls. How many more Pink balls are there than Green balls?", "lEquations": ["X=15-149"], "lSolutions": [-134]},
	{"iIndex": 990, "sQuestion": "Sarah was given 144 Orange balls, 891 Red balls, and 177 Yellow balls. How many more Yellow balls are there than Red balls?", "lEquations": ["X=177-891"], "lSolutions": [-714]},
	{"iIndex": 991, "sQuestion": "Sarah was given 987 White balls, and 857 Gray balls. How many more Gray balls are there than White balls?", "lEquations": ["X=857-987"], "lSolutions": [-130]},
	{"iIndex": 992, "sQuestion": "Sarah was given 757 Pink balls, 494 Black balls, and 476 Magenta balls. How many more Pink balls are there than Black balls?", "lEquations": ["X=757-494"], "lSolutions": [263]},
	{"iIndex": 993, "sQuestion": "Sarah was given 866 Magenta balls, and 299 Azure balls. How many more Magenta balls are there than Azure balls?", "lEquations": ["X=866-299"], "lSolutions": [567]},
	{"iIndex": 994, "sQuestion": "Sarah was given 299 Orange balls, and 837 Gray balls. How many more Gray balls are there than Orange balls?", "lEquations": ["X=837-299"], "lSolutions": [538]},
	{"iIndex": 995, "sQuestion": "Sarah was given 842 White balls, and 213 Green balls. How many more White balls are there than Green balls?", "lEquations": ["X=842-213"], "lSolutions": [629]},
	{"iIndex": 996, "sQuestion": "Sarah was given 742 Azure balls, 986 Magenta balls, 108 Gray balls, and 381 Brown balls. How many more Azure balls are there than Brown balls?", "lEquations": ["X=742-381"], "lSolutions": [361]},
	{"iIndex": 997, "sQuestion": "Sarah was given 490 Brown balls, 709 Orange balls, 11 White balls, and 253 Yellow balls. How many more Orange balls are there than Brown balls?", "lEquations": ["X=709-490"], "lSolutions": [219]},
	{"iIndex": 998, "sQuestion": "Sarah was given 379 Black balls, 106 Blue balls, 906 White balls, 99 Green balls, and 283 Gray balls. How many more White balls are there than Blue balls?", "lEquations": ["X=906-106"], "lSolutions": [800]},
	{"iIndex": 999, "sQuestion": "Sarah was given 160 Violet balls, 489 Orange balls, and 58 Gray balls. How many more Orange balls are there than Gray balls?", "lEquations": ["X=489-58"], "lSolutions": [431]}
]
